script_version("16.03.26 NA")
script_name("FBIhelper")
script_author("Trofim_Shcherbakov")
script_description("По техническим вопросам обращаться - vk.com/tsidex")

slot0 = "16.03.26 NA"
slot1 = [[
16.03.26
Отключение системы автообновлений. Дальнейшая установка в ручном порядке, в соответствии
с местным законодательством в разделе модификаций
06.03.26
Ну и прочее тоже вырезано, пофикшено что не пофикшено

04.03.26
Удаление старого /rn /fn 

22.12.25
1. Возврат автологина и автобенза в /fh
2. Мелкие фиксы

24.10.25
1. Добавлена возможность перемещения виджета в /fh
2. Добавленга возможность убрать отображение id_marker в виджете


23.10.25
1. Фикс /ii
2. Отображение после смерти убившего тебя игрока на виджете
3. Фикс /sus (окно закрывается после выдачи)
4. Прочие незначительные изменения

08.10.25
1. Мелкие фиксы;
2. Убрана кнопка быстрых отыгровок на колёсико, добавлена
возможность отключать FB и /fix в меню на колёсико мыши

07.10.25
1. Мелкие фиксы;
2. Миниигра на /clc


06.10.25
1. Обновлена система умной выдачи розыска /sus [id], кодексы в ней теперь обновляются
самостоятельно при замене файла wanted.txt, который также будет подгружаться с каждым обновлением;
2. Были внесены некоторые фиксы, связанные с получением собственного ID для оптимизации скрипта;
3. Вырезана тонна костыльного дерьма (30% всего кода, да), связанного со старой умной выдачей розыска;


23.07.25
Фикс фастбая

17.05.25
Убрана надоедливая строка с tasks после каждого смс

25.04.25
Обновлён список команд, кодексы в /ук, вырезано много лишнего и исправлен ряд ошибок

20.03.25
Фикс переноса текста

21.12.24
Фикс фиксов
Обновление кодексов в /ук

13.12.24
Что-то вроде фиксов и удаление камхака
27.11.24
Изменение отыгровки удостоверения
19.11.24
Фикс /hold и /mir

18.11.24
1. Обновление кодексов, кроме умной выдачи розыска.
2. Откат обновлений с ручным вводом стандартных команд в биндер и соответственно
их возвращение обратно.
3. Перестановка умного SETMARK с "Num+" на "3"(ибо нумпад не у всех)

]]

require("lib.moonloader")
require("lib.sampfuncs")

slot3 = require("ffi")
slot4 = require("windows.message")
slot5 = require("encoding")
slot5.default = "CP1251"
slot6 = slot5.UTF8
slot7 = require("vkeys")
slot8 = require("lib.samp.events")
slot9 = require("lib.game.weapons")
slot10 = require("vkeys")
slot11 = require("imgui_piemenu")
slot12 = require("memory")
slot13 = require("inicfg")
slot14 = "moonloader\\config\\FBIhelper.ini"

createDirectory("C:\\ProgramData\\moonloader\\config\\")

slot15 = require("moonloader").download_status
slot16 = require("fAwesome5")
slot17 = require("matrix3x3")
slot18 = require("vector3d")
slot19, slot20 = nil
slot21 = -1
slot22 = nil
slot23 = 0
slot24 = false
slot25 = 0
slot26 = 1
slot27 = 1
slot28 = nil
slot29 = 20
slot30 = 0
slot31 = renderLoadTextureFromFile("moonloader\\FBIhelper\\im\\fbi.png")
slot32 = false
slot33 = require("mimgui").new
slot34 = slot3.string
slot35 = slot3.sizeof
slot36, slot37 = getScreenResolution()
commands = {
	"t",
	"n",
	"w",
	"s",
	"fm",
	"g",
	"r",
	"f"
}
bi = false

if script_properties then
	script_properties("work-in-pause")
end

slot38 = [[
УГОЛОВНЫЙ КОДЕКС
---------------------------------

Глава 1. Причинение вреда здоровью
1.1 За причинение вреда средней степени тяжести гражданскому лицу, либо сотруднику правоохранительных органов (Далее ПО) без применения огнестрельного, холодного либо иного вида оружия или используемых в качестве него предметов, преступнику присваивается 3 степень розыска.

Глава 2. Вооруженное нападение
2.1 За вооруженное нападение с применением огнестрельного оружия на гражданское лицо, либо сотрудника ПО, преступнику присваивается 6 степень розыска
2.2 За вооруженное нападение с применением холодного оружия, либо используемых в качестве него предметов (Кастеты, клюшки, катаны, биты, нож и т.д.) на гражданское лицо, либо сотрудника ПО, преступнику присваивается 5 степень розыска

Глава 3. Транспортные преступления
3.1 За попытку угона служебного либо личного транспортного средства, правонарушителю присваивается 1 степень розыска
3.2 За угон служебного либо личного транспортного средства, правонарушителю присваивается 2 степень розыска
3.3 За причинение физического вреда гражданскому лицу, либо сотруднику ПО транспортным средством, правонарушителю присваивается 4 степень розыска
3.4 За скрытие с места ДТП, причинившее ущерб физическому лицу, транспортным средствам или повреждение общегородской инфраструктуры, правонарушителю присваивается 2 степень розыска

Глава 4. Намеренное введение в заблуждение
4.1 За использование формы и знаков отличия представителей государственных органов власти (МВД, МО) с целью введения в заблуждение, обмана и получения личной выгоды, правонарушителю присваивается 2 степень розыска.
4.2 За использование транспортного средства, оборудованного проблесковыми маячками, СГУ, спецсигналами с целью введения в заблуждение, обмана и получения личной выгоды, правонарушителю присваивается 2 степень розыска.
Примечание: исключающими транспортными средствами являются: спецтранспорт, транспорт во владении государственных организаций.
4.3 За выдачу себя за другое лицо, не являющееся представителем государственных органов власти, сотрудником правоохранительных органов с целью введения в заблуждение, обмана и получения личной выгоды, правонарушителю присваивается 1 степень розыска.

Глава 5. Взятка
5.1 За попытку или дачу взятки должностному лицу, правонарушителю присваивается 3 степень розыска
5.2 За получение взятки должностным лицом, правонарушителю присваивается 3 степень розыска
5.3 За вымогательство взятки должностным лицом, правонарушителю присваивается 4 степень розыска

Глава 6. Подделка документов
6.1 За подделку документов удостоверяющих личность, а также служебное положение гражданина (служебное удостоверение), правонарушителю присваивается 2 степень розыска
6.2 За подделку медицинских справок, выписок или других документов правонарушителю присваивается 1 степень розыска

Глава 7. Оружие
7.1 Открытое ношение огнестрельного, пневматического, травматического оружия без цели самообороны, наказывается присвоением 2 степени розыска.
Исключение: сотрудники МВД при исполнении, а также сотрудники МО, находящиеся на военном объекте.
Примечание: Если человек по первому требованию убрал оружие - преступность деяния устраняется
7.2 Применение огнестрельного оружия в отсутствии угрозы жизни, правонарушителю присваивается 4 степень розыска
7.3 За незаконное владение огнестрельным оружием (без лицензии), правонарушителю присваивается 4 степень розыска
7.4 За продажу/покупку/хранение (включая хранение в личном доме/квартире)/кражу нелегально добытого оружия и/или патронов к нему, за владение таковым, а также за владения оружием со стертыми номерными знаками и/или измененным нарезом ствола, правонарушителю присваивается 5 степень розыска
7.5 За изготовление оружия и/или патронов, не имея на то специальной лицензии, правонарушителю присваивается 5 степень розыска
7.6 За угрозу применения огнестрельного оружия, нацеливаясь на сотрудника МВД, правонарушителю присваивается 3 уровень розыска

Глава 8. Похищение людей, удержание в заложниках, незаконное лишение свободы
8.1 За похищение, взятие в заложники гражданского лица правонарушителю присваивается 6-я степень розыска, а также накладывается штрафная санкция в размере 150.000$ за каждого гражданина, чьи права были нарушены
8.2 За похищение, взятие в заложники лица, облеченного государственной властью (Вице-президент, Премьер-министр, генеральный инспектор, верховный судья, губернаторы, министры, военные генералы, директор ФБР) правонарушителю присваивается 6 степень розыска, а также накладывается штрафная санкция в размере 200.000$ и судебным решением назначается мера наказания в виде пожизненного заключения под стражей
8.3 За похищение или взятие в заложники Президента Синей Федерации правонарушителю присваивается 6 степень розыска, налагается штраф в размере 300,000$, и судебным решением назначается мера наказания в виде пожизненного заключения под стражей.
8.4 За незаконное лишение свободы гражданского лица правонарушителю присваивается 3-я степень розыска, а также накладывается штрафная санкция в размере 50.000$
8.5 За незаконное лишение свободы лица, облеченного государственной властью (Президент, Вице-президент, Премьер-министр, Генеральный инспектор, Верховный судья, губернаторы, министры, военные генералы, директор ФБР) правонарушителю присваивается 6-я степень розыска, а также накладывается штрафная санкция в размере 100.000$ и судебным решением назначается мера наказания в виде пожизненного заключения под стражей

Глава 9. Неподчинение
9.1 За неподчинение сотруднику ПО или представителем генеральной инспекции, отдавшему законный приказ и находящемуся при исполнении, правонарушителю присваивается 3 степень розыска
9.2 За неподчинению сотруднику ПО, отдавшему законный приказ при обстановке ЧС в Федерации, а также при проведении спец. операции, правонарушителю присваивается 4 степень розыска
9.3 За отказ от выплаты штрафа или при его несвоевременной выплате, выданная штрафная санкция увеличивается втрое, нарушившему присваивается 3 степень розыска

Глава 10. Проникновение
10.1 За отказ покинуть охраняемую ПО территорию, правонарушителю присваивается 2 степень розыска
10.2 За незаконное проникновение на территорию закрытой военной базы либо военного объекта (Авианосец и т.п.), правонарушителю присваивается 3 степень розыска.
10.3 Проникновение и последующий отказ покинуть территорию частной собственности другого гражданина, правонарушителю присваивается 1 степень розыска
10.4 Проникновение в здания гос. учреждений с вооружением, наказывается 2 степенью розыска. (Статья не распространяется на сотрудников МВД, находящихся при исполнении)
Примечание: Если человек по первому требованию убрал оружие - преступность деяния устраняется
10.5 Проникновение в здания гос. учреждений в маске, наказывается 1 степенью розыска. (Статья не распространяется на сотрудников МВД, находящихся при исполнении, а также на военнослужащих МО, которые пребывают на территории военного объекта или участвуют в специальной операции)
Примечание: Если человек по первому требованию снял маску - преступность деяния устраняется.
10.6 За незаконное (несанкционированное) проникновение на территорию Федерального Бюро Расследований, правонарушителю присваивается 5 степень розыска

Глава 11. Наркотические вещества
11.1 За незаконное хранение наркотических средств в больших количествах (более 5 грамм на руках, и 10 грамм в доме), правонарушителю присваивается 3 степень розыска и налагается штраф в размере 50.000$
11.2 За незаконный оборот, продажу, покупку наркотических веществ, правонарушителю присваивается 6 степень розыска и налагается штраф в размере 125.000$
11.3 За производство любых наркотических, психотропных препаратов, правонарушителю присваивается 5 степень розыска и налагается штраф в размере 80.000$

Глава 12. Терроризм и экстремизм
12.1 За планирование/исполнение теракта, правонарушителю присваивается 6 степень розыска и судебным решением назначается мера наказания в виде пожизненного заключения под стражей
12.2 За помощь в исполнении теракта, правонарушителю присваивается 6 степень розыска и судебным решением назначается мера наказания в виде пожизненного заключения под стражей
12.3 За организацию теракта руководителю преступной организации, которая его организовала и провела, присваивается 6 степень розыска и судебным решением назначается мера наказания в виде пожизненного заключения под стражей

Глава 13. Хулиганство
13.1 Ложный вызов сотрудников ПО, правонарушителю присваивается 2 степень розыска и налагается штраф в размере 10.000$
13.2 За хулиганство с применением либо с угрозой применения насилия в отношении к гражданам, правонарушителю присваивается 3 степень розыска.
13.3 За хулиганство в публичном, общественном месте выражаемое в грубом неуважении к обществу, правам граждан, правонарушителю присваивается 2 степень розыска
13.4 За организацию незаконной уличной гонки на дорогах общего пользования правонарушителю присваивается 3 степень розыска и налагается штраф в размере 40.000$

Глава 14. Публичные мероприятия
14.1 За срыв согласованного собрания, митинга, демонстрации, шествия или пикета правонарушителю присваивается 2 степень розыска
14.2 За организацию несанкционированного собрания, митинга, демонстрации, шествия или пикета, правонарушителю присваивается 4 степень розыска и налагается штраф в размере 150.000$, и по 30.000$ за каждого участника нелегального митинга
14.3 За участие в несанкционированном собрании, митинге, демонстрации, шествии или пикете, правонарушителю присваивается 3 степень розыска и налагается штраф в размере 50.000$

Глава 15. Соучастие и содействие
15.1 За соучастие и/или содействие в преступлении любой главы Уголовного Кодекса, гражданину присваивается степень розыска по статье, в которой он участвует

Глава 16. Преступная организация
16.1 За создание, организацию, управление или соуправление преступной организацией, которая совершила преступления, правонарушителю присваивается 6 степень розыска. Пожизненное заключение под стражей назначается судебным решением в случае, если организация совершила хотя бы одно особо тяжкое преступление, предусмотренное главами 8, 12 или 25 Уголовного кодекса
16.2 За участие в преступной организации, совершение преступных деяний в соучастии, правонарушителю присваивается 6 степень розыска

Глава 17. Таможенный и постовой контроль
Примечание: санкции за преступления, предусмотренные по данной главе, не могут быть квалифицированы в том числе по главе 9 и выдаются только при наличии дежурных сотрудников МВД на таможне.
17.1 За проезд пункта таможенного поста без предъявления паспорта, правонарушителю присваивается 3 степень розыска
17.2 За уклонение от обыска транспортного средства на таможенном посту, правонарушителю присваивается 3 степень розыска

Глава 18. Оскорбление
18.1 За публичное оскорбление представителя(ей) власти, какие-либо унижения или неуважение при исполнении им (ими) своих должностных обязанностей, правонарушителю присваивается 2 степень розыска и налагается штраф в размере 35.000$
18.2 За неоднократные оскорбления представителя(ей) власти, какие-либо унижения или неуважение при исполнении им (ими) своих должностных обязанностей, правонарушителю присваивается 3 степень розыска и налагается штраф в размере 70.000$

Глава 19. Домогательство и изнасилование
19.1 За домогательство сексуального характера, правонарушителю присваивается 2 степень розыска
19.2 За совершение изнасилования, насильственных действий сексуального характера, правонарушителю присваивается 4 степень розыска

Глава 20. Побег и уклонение от законных мер
20.1 За побег или уклонение от законных мер, предпринимаемых сотрудниками правоохранительных органов или представителями Генеральной инспекции, правонарушителю присваивается 6 степень розыска.

Глава 21. Грабеж и кража
21.1 За причинение имущественного ущерба высокой степени тяжести, правонарушителю присваивается 4 степень розыска
21.2 За осуществление грабежа, ограбления с применением огнестрельного, холодного оружия, правонарушителю присваивается 5 степень розыска
21.3 За осуществление грабежа на военных объектах (Авианосец, военные базы), правонарушителю присваивается 6 степень розыска

Глава 22. Незаконное предпринимательство
22.1 За повторное осуществление незаконной предпринимательской деятельности, правонарушителю присваивается 5 степень розыска;

Глава 23. Кража налоговых данных
23.1 За кражу налоговых данных и ограбление/налет на инкассаторский фургон, правонарушителю присваивается 4 степень розыска
23.2 За преднамеренное оказание помощи в ограблении от сотрудника правительства, правонарушителю присваивается 3 степень розыска
23.3 За сговор сотрудников правительства с грабителями, с целью передачи налоговых данных, правонарушителю присваивается 2 степень розыска

Глава 24. Сбор информации и государственная измена
Примечание к главе: Подозреваемый задерживается на основании п.1 статьи 2 Процессуального кодекса до проведения полного расследования
24.1 Любой незаконный сбор информации или же попытка сбора информации с особо охраняемых объектов: Администрация Президента, офис Федерального Бюро расследований, Военных баз, Военного объекта особого назначения "Авианосец" путём слежки за лицами, имеющими причастность к данным организациям, либо наблюдением за объектами без какой-либо причины и одобрения руководства данных объектов. Правонарушителю присваивается 6 степень розыска.
24.2. За разглашение и продажу государственной тайны, касательно правительства, правоохранительных органов, органов минобороны, правонарушитель получает 6 степень розыска, и штраф в размере 300.000$ (В данную статью входит информация: о закрытых спецоперациях, закрытая информация для граждан Синей Федерации)
24.3. За попытку добычи государственной тайны незаконным путем повлекшие за собой утечку информации в массы, правонарушитель получает 5 степень розыска

Глава 25. Убийство
Примечание к главе: Подозреваемый задерживается на основании п.1 статьи 2 Процессуального кодекса до проведения полного расследования
25.1. За умышленное убийство гражданина Синей Федерации правонарушитель получает 6 степень розыска
25.2. За нанесение тяжких телесных повреждение повлекшее за собой убийство гражданина Синей Федерации правонарушитель получает 6 степень розыска
25.3. За произведение заказного убийства, исполнитель и заказчик, а также лица так или иначе содействующие этому, привлекаются к уголовной ответственности и получают 6 степень розыска и судебным решением назначается мера наказания в виде пожизненного заключения под стражей
25.4. За проведение массовых и серийных убийств (от двух человек) на территории Синей Федерации правонарушитель получает 6 степень розыска и судебным решением назначается мера наказания в виде пожизненного заключения под стражей
25.5. За убийство высокопоставленных лиц (Президент, Вице-президент, Премьер-министр, генеральный инспектор, верховный судья, губернаторы, министры, военные генералы, директор ФБР) правонарушителю присваивается 6 степень розыска и судебным решением назначается мера наказания в виде пожизненного заключения под стражей

Глава 26. Должностные преступления
26.1 За превышение, игнорирование, неисполнение, присвоение, либо ненадлежащее исполнение должностных (служебных) обязанностей, правонарушителю присваивается наказание в виде исполнительных работ или штраф до 300.000$
26.1.2 За те же деяния предусмотренные в 27.1, повлекшие за собой негативные последствия для организации, государства или граждан, правонарушителю присваивается 6 степень розыска и штраф до 1.000.000$
26.2 За внесение должностным лицом заведомо ложных сведений в официальные документы, правонарушителю присваивается 5 степень розыска.

Глава 27. Предоставление заведомо ложных данных
27.1 За дачу заведомо ложных показаний, правонарушителю присваивается 2 степень розыска
27.2 За дачу заведомо ложных показаний на судебном заседании, правонарушителю присваивается 4 степень розыска
Примечание: данная статья инкриминируется только судом при вынесении вердикта по делу в случае подтверждения ложности показаний.

Глава 28. Неисполнение судебных постановление, неуважение к суду
Примечание: статьи в данных главах могут быть инкриминированы судом при вынесении вердикта по делу.
28.1 За любое игнорирование, невыполнение, умышленное нарушение решений, определений, постановлений, приговор суда, правонарушителю присваивается 6 степень розыска
28.2 За повторную неявку в суд, подсудимому (обвиняемому в уголовном преступлении) присваивается 6 степень розыска
28.3 За попытку оказать влияние на ход судебного процесса путем подкупа, шантажа, угроз судьям, свидетелям или обвиняемым, правонарушителю присваивается 6 степень розыска
28.4 За грубое неуважение к суду, выражающееся в агрессивных действиях, неадекватном поведении, попытке сорвать судебное заседание, правонарушителю присваивается 5 степень розыска

Глава 29. Укрывательство преступников находящихся в розыске
29.1 За отказ в выдаче сотрудника организации, находящегося в федеральном розыске, по запросу ФБР, на руководителя организации налагается штраф в размере 150.000$.
29.2 За оказание противодействия, препятствия, реализации запроса ФБР на выдачу, лицам оказывающим препятствие присваивается 3 степень розыска и налагается штраф в размере 35.000$
29.3 За повторный инцидент с отказом в выдаче преступника, на руководителя организации налагается штраф в размере 250.000$, присваивается 6 степень розыска.

Глава 30. Злоупотребление полномочиями и фабрикация уголовных дел
Злонамеренное преследование (*) - это умышленное, намеренное оказание давления, создание помех, проблем, сложностей для граждан, используя служебные полномочия и ресурсы, с целью получения выгоды, сведения личных счетов. Например фабрикование уголовного дела, против человека не являющегося виновным, выдвижение заведомо ложных, надуманных, сфабрикованных обвинений, не имея никаких доказательств виновности преследуемого лица.
30.1 За умышленное использование полномочий сотрудниками МВД с целью личной выгоды, получения информации личных счетов граждан или злонамеренного преследования, ему присваивается 6 степень розыска и налагается штраф в размере 85.000$.
30.2 За фабрикацию уголовных дел, фальсификацию доказательств и результатов по уголовному делу, сотрудникам это допустившим присваивается 4 уровень розыска, накладывается штраф в размере 100.000$.
30.3 Руководство организации может проводить внутренние служебные проверки и расследования по факту фабрикации уголовных дел своими сотрудниками, с последующими увольнениями, занесениями в черный список организации.


---------------------------------
АДМИНИСТРАТИВНЫЙ КОДЕКС?
---------------------------------

Глава I. Общие нарушения
Статья 1. Нанесение вреда здоровью
1.1 За нанесение вреда здоровью легкой степени тяжести (( до 25% хп )) на правонарушителя налагается штраф в размере 150.000$

Статья 2. Общественные правонарушения
2.1 За курение в общественном месте на правонарушителя налагается штраф в размере 15.000$
2.2 За употребление спиртных напитков в общественном месте на правонарушителя налагается штраф в размере 10.000$

Статья 3. Кража
3.1 За причинение имущественного вреда легкой степени тяжести (кража) на правонарушителя налагается штраф в пятикратном размере стоимости имущества
3.2 За причинение имущественного вреда средней степени тяжести (кража) на правонарушителя налагается штраф в десятикратном размере стоимости имущества

Статья 4. Незаконное предпринимательство
4.1 За совершение предпринимательской деятельности без наличия государственной регистрации(лицензии) на правонарушителя налагается штраф в размере 1.500.000$ и закрытие организации, предприятия, учреждения.
4.2 За предоставление рабочих мест без наличия государственной лицензии, на руководителя компании налагается штраф в размере 75.000$ за одного сотрудника.

Статья 5. Причинение ущерба
5.1 За причинение незначительного ущерба частной либо государственной собственности на правонарушителя налагается штраф в размере 25.000$
5.2 За причинение ущерба средней тяжести частной либо государственной собственности на правонарушителя налагается штраф в размере 50.000$

Статья 6. Оскорбление
6.1 За оскорбление гражданина на правонарушителя налагается штраф в размере 10.000$
6.2 За оскорбление сотрудника ПО на правонарушителя налагается штраф в размере 20.000$

Статья 7. Клевета
7.1 За распространение заведомо ложной информации порочащей честь, достоинство, деловую репутацию (клевета) на правонарушителя налагается штраф в размере 50.000$

Статья 8. Административные нарушения в области правосудия
8.1. За неявку в суд, на правонарушителя налагается штраф в размере 200.000$.
8.2. За неуважение к суду, выражающееся в игнорировании, обсуждении решений, замечаний судьи, на правонарушителя налагается штраф в размере 125.000$.

Статья 9. Злонамеренное преследование со стороны сотрудников МВД
Примечание: санкции за нарушения, предусмотренные настоящей статьей, могут быть применены только в том случае, если соответствующие действия имели место в течение одного срока полномочий.
9.1 Главе департамента полиции штата, сотрудники которого регулярно и неоднократно (3+ случая) используют полномочия с целью злонамеренного преследования, налагается штраф в размере 1.250.000$.
9.2 Директору Федерального бюро расследований, сотрудники которого регулярно и неоднократно (3+ случая) используют полномочия с целью злонамеренного преследования, налагается штраф в размере 2.500.000$.
9.3 Министру Внутренних Дел, сотрудники министерства внутренних дел которого регулярно и неоднократно (от 5+ случаев) используют полномочия с целью злонамеренного преследования, налагается штраф в размере 5.000.000$.

Статья 10. Незаконные уличные гонки
10.1 За участие в незаконной уличной гонке или соревновании на правонарушителя налагается штраф в размере 20.000$
10.2 За рекламу или продвижение незаконных уличных гонок на правонарушителя налагается штраф в размере 10.000$

Статья 11. Нарушения в рамках адвокатского запроса
11.1 За несвоевременную передачу или неправомерный отказ от предоставления сведений, намеренную передачу ложных сведений адвокату в рамках адвокатского запроса на правонарушителя налагается штраф в размере 100.000$

Глава II. Административные нарушения в области дорожного движения
Статья 1. За движение на автомобиле без регистрационных номеров на правонарушителя налагается штраф в размере 20.000$
Статья 2. За отсутствие у водителя паспорта и документов на автомобиль на правонарушителя налагается штраф в размере 25.000$
Статья 3. За управление неисправным автомобилем (Черный дым из двигателя и иные функциональные неисправности, оказывающие влияние на безопасность движения) на правонарушителя налагается штраф в размере 17.500$
Статья 4. За управление транспортом водителем в состоянии алкогольного опьянения на правонарушителя налагается штраф в размере 25.000$, а также изъятие прав на управление автомобилем.
Статья 5. За опасное вождение, перестроение создающее риск ДТП на дороге на правонарушителя налагается штраф в размере 22.500$
Статья 6. За несоблюдение требований знаков дорожного движения на правонарушителя налагается штраф в размере 12.500$
Статья 7. За движение автомобиля по встречной полосе движения, за исключением государственного транспорта в проблесковыми маячками на правонарушителя налагается штраф в размере 25.000$
Статья 7.1 За повторное нарушение пункта 7 II раздела АК на правонарушителя налагается штраф в размере 25.000$ и изъятие водительского удостоверения
Статья 8. За движение, парковку на газонах, тротуарах и других покрытий указанных в правилах дорожного движения на правонарушителя налагается штраф в размере 17.500$
Статья 9. За движение автомобиля по железнодорожным путям на правонарушителя налагается штраф в размере 20.000$
Статья 10. За езду без включенных внешних световых приборов в тёмное время суток или в условиях недостаточной видимости на правонарушителя налагается штраф в размере 15.000$
Статья 11. За управление пикапом или грузовиком с пассажирами, перевозимыми внутри кузова, на задней части транспортного средства или в иных местах, не предназначенных для безопасной перевозки людей, на водителя налагается штраф 25.000$
Статья 12. За многочисленные нарушения (3 и более) в области дорожного движения на правонарушителя налагается штраф в размере суммы нарушенных статей и изъятие водительского удостоверения
Примечание: статья применяется в случае, когда правонарушителем в ходе одной поездки или в течение одного временного периода совершено 3 и более нарушений
Статья 13. За управление транспортным средством с модификациями, препятствующим пропусканию света менее чем на 70 процентов на правонарушителя налагается штраф в размере 15.000$ или письменное предупреждение


---------------------------------
ПРОЦЕССУАЛЬНЫЙ КОДЕКС?
---------------------------------

Глава I Процесс задержания
Задержание - это мера кратковременного (на срок до 2 часов) лишения человека права на свободу, которая осуществляется на основании (гл. II ч.1) Процессуального Кодекса.
Задержание не считается мерой наказания, оно носит исключительно внесудебный характер и в совокупности с другими предусмотренными законом средствами и методами позволяет сотрудникам правоохранительных органов собрать необходимые сведения (достаточную доказательственную базу) для решения вопроса о возможности или невозможности применения к лицу какой-либо ответственности.

Статья 1. Задержание подозреваемого
1.1. Лицо может быть задержано по подозрению в совершении преступления, за которое может быть назначено наказание в виде лишения свободы или штрафная санкция.

При наличии хотя бы одного из следующих оснований:
а) Когда лицо застигнуто в момент совершения преступления или непосредственно
после его совершения, сотрудником правоохранительных органов;
б) Когда на этом лице или его одежде, при нем или в его имуществе обнаружены явные следы преступления.
в) Когда 3 и более свидетелей указывают на данное лицо как на совершившее преступление.
г) Когда есть фото или видео фиксация совершенного преступления этим лицом.
д) Если имеется нормативный документ или указ уполномоченного лица.
е) Когда имеются существенные факты полагать что лицо может быть виновным в совершении преступления (схожесть фоторобота, схожесть описания предметов одежды, индивидуальные признаки лица, одинаковый номер паспорта и/или номер телефона с правонарушителем);
ж) Когда лицо застигнуто на месте совершения преступления сотрудником правоохранительных органов.

1.2. Если лицо намеренно скрывает свою личность без законных на то оснований (( ношение системной маски (/mask), либо отыгрыш РП маски )), то такое лицо может быть задержано вне хода расследования до установки личности.
1.3. Лицо может быть задержано до выяснения обстоятельств с целью получения информации, сведений, показаний по текущему уголовному производству, расследованию на срок не более 40 минут.

Статья 1.1. Порядок задержания правомочным лицом
1.1.1. При задержании лица сотруднику необходимо: представиться, предъявив удостоверение/нашивку/жетон, разъяснить основания задержания.
1.1.1.1. сотрудник ПО имеет право не представляться в следующих случаях:
а) Сотруднику угрожает опасность.
б) Задержание было произведено на территории пенитенциарного учреждения, Департамента LSPD/SFPD/LVPD, ФБР, зала Суда.
в) Массовое скопление людей (вдвое больше сотрудников проводивших процессуальные действия).
1.1.2. Сотрудник, осуществляющий задержание, по первому требованию обязан предоставить задержанному служебные документы/нашивку/жетон/бейдж, позволяющие идентифицировать личность сотрудника.
1.1.2.1. Субъекты задержания вправе потребовать у сотрудника ПО предоставить служебные документы/нашивку/жетон/бейдж, но не более чем 2 раза за весь период процесса задержания.
1.1.3. В случаях, в которых требуется доставление подозреваемого для проведения последующих процессуальных мероприятий (допрос, помещение в ИВС) сотруднику необходимо: провести первичный обыск, зачитать правила Миранды.
"Вы имеете право хранить молчание. Всё, что вы скажете, может и будет использовано против Вас. Вы имеете право на один телефонный звонок. Также Вы имеете право на адвоката. Если вам необходим адвокат, он будет для Вас запрошен. Вы понимаете свои права?"
1.1.4. Допускаются коррективы формулировки, но суть должна оставаться неизменной.
1.1.5. Субъекты задержания вправе потребовать у сотрудника ПО разъяснения его прав, но не более чем 2 раза за весь период процесса задержания.
1.1.6. В случае, если задержанный не сообщает сотруднику об ясности своих прав в течение 3-х (трёх) минут с момента вопроса сотрудника, сотрудник не обязан удостоверяться у задержанного в понимании его прав и обязан запротоколировать (зафиксировать на видеозапись) данный факт.
1.1.7. Сотрудник ПО имеет право не проводить первичный обыск в случаях если:
а) Сотруднику угрожает опасность.
б) Задержание было произведено на территории пенитенциарного учреждения, Департамента LSPD/SFPD/LVPD, ФБР, зала Суда.
в) Массовое скопление людей (вдвое больше сотрудников проводивших процессуальные действия).

Статья 1.2. Субъекты задержания
1.2.1. В процессе задержания участвуют:
а) Сотрудник или сотрудники правоохранительных органов, являющиеся непосредственными инициаторами процессуальных действий
б) Задержанный, в отношении которого проводится арест.
в) При задержании может присутствовать адвокат, заключивший письменный или устный договор об оказании юридических услуг с задержанным.

1.2.1. Никаких других третьих лиц в процессе задержания быть не может. Сотрудники правоохранительных органов вправе потребовать отойти от места задержания на 6 метров всех граждан.

Статья 1.3. Основания освобождения подозреваемого
1.3.1. Подозреваемый подлежит освобождению по решению сотрудника проводившего задержание и допрос, если:
а) не подтвердилось подозрение в совершении преступления;
б) за нарушение не предусмотрено меры пресечения в виде заключения под стражу;
в) прошло больше 2 часов с момента задержания и не была избрана мера пресечения в виде заключения под стражу.

Статья 1.4. Права задержанного:
1.4.1. Задержанный имеет право на один телефонный звонок в присутствии сотрудника. Сотрудник обязан предоставить данный звонок подозреваемому во время процесса задержания.
1.4.1.1. Длительность звонка не должна превышать 7 минут. Звонок частному или государственному адвокату также считается за потраченный телефонный звонок. Предельный срок задержания подозреваемого продлевается на количество времени, потраченного на звонок.
Примечание: Звонок считается за потраченный, при условии что собеседник поднял трубку.
Исключение: Согласие сотрудника проводящего задержание на увеличение длительности звонка.
1.4.2. Задержанный имеет право хранить молчание.
1.4.3 Задержанный имеет право на адвоката как государственного, так и частного.

Статья 1.5. Обязанности сотрудника выполняющего задержание
1.5.1.Сотрудник обязан разъяснить адвокату причины задержания.
1.5.2. Сотрудник, осуществляющий задержание, по первому требованию обязан предоставить задержанному служебные документы/нашивку/жетон/бейдж, позволяющие идентифицировать личность сотрудника.
1.5.3. задержанный вправе потребовать предоставить вышеуказанные опознавательные знаки или документы повторно, но не более чем 2 раза за весь период процесса задержания.
1.5.4 Сотрудник обязан осуществить все затребованные права задержанного и убедиться в их осуществлении.

Глава II Следствие

Статья 2. Право сотрудников и руководства организации
2.1 Право сотрудников МВД объявлять граждан в розыск до выяснения обстоятельств на основаниях, прописанных в 1.1 ПК, на срок не более 120 минут. На время подобных следственных действий лицу присваивается 6 степень розыска, после проведения которых она снимается.
2.2 Руководство организации может проводить внутренние служебные проверки и расследования по факту фабрикации уголовных дел своими сотрудниками, с последующими увольнениями, занесениями в черный список организации

Глава III Обыск

Статья 3. Личный обыск
3.1. Подозреваемый может быть подвергнут личному обыску во время задержания, ареста, чрезвычайного положения и военного положения в Федерации.

Статья 4. Обыск транспортного средства.
4.1. Сотрудник ПО имеет право обыскать транспортное средство в следующих случаях:
а) Ориентировка, иная информация, об использовании ТС или груза в противоправных целях.
б) Наличие следов преступления на транспортном средстве.
в) Задержание лица, находившегося в ТС.
г) Подтвержденный факт наличия запрещенных средств, нелегальных предметов, лиц находящихся в федеральном розыске/проходящих по уголовному делу в транспортном средстве.

Статья 5. Обыск частных территорий, помещений и зданий
5.1. Обыск частных территорий, помещений и зданий производится только при наличии ордера от Президента, Судьи, Генерального инспектора и его заместителя. Выдача ордера регулируется ФЗ “О государственной системе ордеров”
5.1.1. В исключительных случаях, когда обыск частной территории не терпит отлагательства, обыск может быть произведен на основании решения сотрудника правоохранительных органов без ордера. В этом случае, сотрудник правоохранительных органов не позднее 5 часов с момента начала производства следственного действия должен уведомить Генерального инспектора, его заместителей, или своего курирующего инспектора.
Примеры исключительных случаев для проведения обыска без ордера:
а) Человек целенаправленно скрывается от преследования в помещении.
б) Человек скрыл факт установки взрывного устройства в доме и готов его использовать.
в) Угроза безопасности первых лиц Государства
г) Подтвержденный факт наличия запрещенных средств, нелегальных предметов, лиц находящихся в федеральном розыске/проходящих по уголовному делу в имуществе подозреваемого.
е) Задержание участников преступных организаций, подозреваемых в террористическом акте;
ж) Согласие владельца имущества;
з) Существует угроза жизни или здоровья людей, находящихся в имуществе;
и) Предотвращение совершения преступления, предотвращение утраты улик при достаточно имеющихся на то обстоятельствах.

Статья 6. Понятие и последовательность
6.1. Стадии применения силы - последовательность и классификация возможных законных действий в отношении нарушителя закона со стороны сотрудника правоохранительных ведомств.
6.2. Порядок применения стадий силы:
1) Первая стадия - Присутствие сотрудника правоохранительных органов — эта стадия состоит только из присутствия сотрудника в штатной униформе, возможно с должным образом маркированным средством передвижения (мотоциклом, автомобилем, катером).
Присутствия с очевидной возможностью для объектов понимать присутствие сотрудника полиции, как правило, достаточно для выполнения требований закона и прекращения мелких правонарушений. В зависимости от обстановки и количества людей на месте, этот уровень применения силы может потребовать присутствия нескольких полицейских для уверенного
контроля ситуации.
2) Вторая стадия - Устные требования/команды — ясные и понятные устные распоряжения сотрудника полиции объекту применения силы. В большинстве моделей сотрудник полиции имеет право дополнять свои распоряжения предупреждениями о последствиях за
неисполнение распоряжений, с тем, чтобы улучшить степень кооперативности объекта воздействия. Распоряжения должны быть исполнимыми и законными, а предупреждения должны соответствовать ступеням модели применения силы, в случае отказа объекта выполнять распоряжения. Вероятно, неисполнимым будет, например, требование лицу в инвалидной коляске встать.
3) Третья стадия - Силовое воздействие без спец.средств — К этой стадии относятся заламывание рук, нажатия на болевые точки и обычное применение наручников. На этой стадии существует вероятность нанесения легкого вреда здоровью, но очень мала вероятность причинения тяжкого вреда в виде переломов костей или разрывов связок. Также стадия включает в себя удары руками и ногами, сюда же может относиться применение дубинок. Вероятность нанесения вреда здоровью субъекта в виде переломов, растяжений и разрывов связок.
4) Четвертая стадия - Применение специальных средств — к этой стадии относится применение электрошоковых устройств, водометов, полицейских собак. В некоторых моделях к этому уровню может относиться применение дубинок и слезоточивых аэрозолей. Как правило, специальные средства предназначены для воздействия на мышечную ткань, руки и ноги.
5) Пятая стадия - Смертельная сила — под этой стадией воздействия используется огнестрельное оружие. Однако в этом качестве может выступать и автомобиль, и любое подручное оружие, обладающее необходимыми свойствами. На этой ступени воздействия очень вероятно причинение смерти или нанесение тяжкого вреда здоровью объекта применения силы.
6.3. Стадии применения силы должны соблюдаться в порядке, прописанном в данном кодексе, за исключением ситуаций когда субъект задержания уже нарушил закон или ситуация требует экстренных действий, в таком случае можно перейти к любой стадии без последовательности.
(Пример: вооруженный преступник, угроза жизни человеку/офицеру, отсутствие возможности применить одну из стадий).

Глава V Допрос
Допрос - следственно-розыскное мероприятие, которое проводится на стадии досудебного следствия для получения информации о факте совершения лицом уголовного правонарушения, предусмотренного Уголовным Кодексом. В ходе допроса задаются определённые вопросы, направленные на уточнение и выявления новых фактов об уголовном правонарушении.

Статья 7. Основания для вызова на допрос:
7.1 Основанием для вызова на допрос могут быть:
1) Следствие по делу, досудебное разбирательство
2) Обращение/жалоба в инспекционное управление
3) Лицо так или иначе фигурирует в уголовном/административном деле.

Статья 8. Субъекты допроса
8.1 Субъектами допроса являются:
1) Сотрудники правоохранительных органов, отделов, подразделений, ведущие и/или содействующие следствию.
2) Свидетель, потерпевший, подозреваемый, обвиняемый
3) Адвокат
4) Инспектор офиса Генерального инспектора

Статья 9. Лица уполномоченные к проведению допроса
9.1. Полномочиями на проведения допроса обладают только:
1) Сотрудники инспекционного управления с должности инспектор
2) Сотрудники министерства внутренних дел

Статья 10. Права и обязанности участников допроса
10.1. Свидетель/потерпевший имеет право:
1) Знать по какой причине его вызвали на допрос
2) Присутствовать на допросе со своим адвокатом.
3) Не свидетельствовать против себя и своих близких. Примечание: прямой отказ от дачи показаний, может расцениваться как уклонение от расследования.
4) Обжаловать по окончанию допроса незаконные действия сотрудников в отношении себя.
5) Отказаться от допроса в ночное время с 23:00 до 10:00.
6) Хранить молчание.
7) На один телефонный звонок в течение 7-ми минут.

10.2. Подозреваемый/обвиняемый имеет право:
1) Знать в чём он подозревается/обвиняется.
2) Давать объяснения и показания по предъявленным к нему обвинениям, или подозрению в совершении преступления.
3) Пользоваться услугами частного/государственного адвоката.
4) Обжаловать по окончанию допроса незаконные действия сотрудников в отношении себя.
5) Отказаться от допроса в ночное время с 23:00 до 10:00.
6) Хранить молчание.
7) На один телефонный звонок в течение 7-ми минут.

10.3. Адвокат имеет право:
1) Единожды требовать 7-ми минутный перерыв во время проведения допроса, с целью скорректировать тактику поведения обвиняемого на допросе.
1.1) Перерыв не идет в счет общего времени проведения допроса.
2) Отказаться от участия в допросе по морально-этическим соображениям с разрешения Генерального инспектора.
3) На приватную беседу с доверителем не более 15-ти минут. Примечание: Перерыв и приватная беседу не идут в счет общего времени проведения допроса.

10.4. Сотрудник проводящий допрос имеет право:
1) Ограничивать свободу перемещения допрашиваемого с целью обеспечения собственной безопасности (использовать наручники).
2) Прерывать/прекращать процедуру допроса в любой момент времени.
3) Обыскивать всех участников допроса, в рамках установленных действующим законодательством с целью собственной безопасности и безопасности субъектов допроса
4) Проверять документы участников допроса
5) Задавать вопросы касающиеся делопроизводства или досудебных разбирательств всем участникам допроса
6) Использовать показания допрашиваемого как доказательства в рамках делопроизводства
7) Использовать все законные методы для обеспечения конфиденциальности полученной в ходе допроса информации

10.5. Допрашиваемый обязан:
1) Максимально ясно и чётко давать показания.
2) Соблюдать устоявшиеся морально-этические нормы общения и поведения.
3) Говорить правду и только правду.
4) Отвечать на все вопросы сотрудника, за исключением вопросов которые напрямую или косвенно не относятся к делопроизводству или досудебному разбирательству или хранить молчание.
Примечание: прямой отказ от дачи показаний, может расцениваться как уклонение от расследования.

10.6. Сотрудник, проводящий допрос, обязан:
1) Убедиться в том, требуются ли субъектам допроса разъяснение их прав, в случае необходимости разъяснить их.
1.1) субъекты допроса вправе потребовать у сотрудника ПО разъяснения его прав, но не более чем 2 раза за весь период процесса задержания.
2) Вести полную видеозапись и аудиозапись допроса (протокол).
2.1) срок хранения протокола допроса составляет 5 суток.
3) Обеспечивать соблюдение прав участников допроса.

Статья 11. Правила проведения допроса
11.1. При проведении допроса должны быть соблюдены следующие правила:
1) Не допускаются угрозы применения физического насилия, а также другие незаконные способы воздействия на допрашиваемого.
2) Все участники допроса должны быть ознакомлены с их правами
3) Время проведения процедуры допроса не должно превышать 40 минут. Исключение: Дальнейшее проведение допроса разрешается с согласием допрашиваемого

Статья 12. Подготовительный порядок к проведения допроса предусматривает действия, обязательные к исполнению следователю к задержанному для проведения дальнейшего допроса.
12.1. Порядок к проведению допроса:
1. Завести задержанного в комнату допроса.
2. Провести полный обыск задержанного лица.
3. Запросить у задержанного документы, которые удостоверяют его личность. В случаях, если документы отсутствуют по любым из причин, уточнить его Фамилию Имя, дату и место рождения и проверить эти данные через внутренние базы данных МВД или ФБР. При необходимости, допускается использование биометрической проверки (например: по отпечаткам пальцев или фотографии).
4. Убедиться, что в комнате допроса ведётся запись (протокол).
5. Представиться задержанному.
6. Объяснить кем задержанный является на допросе. (свидетель/обвиняемый/подозреваемый/потерпевший)
7. Объяснить задержанному его права и обязанности.
12.2. В случае исполнения всех пунктов порядка, следователь имеет право начать процедуру допроса в отношении задержанного.
12.2.1 Сотрудник обязан сказать на запись дату и время начала допроса, по его окончанию - дату и время окончания допроса.

Глава VI Смягчающие и отягчающие обстоятельства.
Статья 13. Смягчающие обстоятельства
Смягчающие обстоятельства - это условия или факторы, которые уменьшают степень вины правонарушителя. Они могут повлиять на решение о смягчении меры ответственности или наказания. Учитываются при назначении наказания.
1) Чистосердечное признание - добровольное признание вины и выражение раскаяния в совершении правонарушения на этапе досудебного расследования, до предъявления официальных обвинений или на ранних стадиях следствия.
2) Активное содействие следствию - оказание существенной помощи правоохранительным органам в раскрытии преступления, сборе доказательств или задержании соучастников.
3) Помощь в раскрытии преступления - любые действия, направленные на облегчение работы следствия и раскрытие других преступлений, связанных с делом.
4) Нарушение правоохранительными органами досудебного расследования - в процессе досудебного расследования были допущены ошибки или нарушения прав гражданина.
5) Нарушение прав граждан в статусе подозреваемого или обвиняемого - любые нарушения прав личности на стадии задержания или следствия.

Статья 14. Отягчающие обстоятельства
Отягчающие обстоятельства - это факторы, которые увеличивают степень вины или тяжесть преступления, влияя на решение суда о мере наказания.
1) Рецидив - совершение повторного преступления после осуждения за аналогичное или иное преступление.
2) Совершение преступления в составе группы лиц по предварительному сговору - преступление совершено несколькими лицами, заранее договорившимися о совместных действиях.
3) Тяжелые последствия преступления - преступление повлекло за собой гибель людей, нанесение серьезного ущерба здоровью или имуществу.
4) Совершение преступления с особой жестокостью - применение чрезмерного насилия или умышленное причинение мучений жертве.
5) Совершение преступления в состоянии алкогольного или наркотического опьянения - данный факт может служить отягчающим обстоятельством, так как такие состояния снижают самоконтроль и увеличивают общественную опасность преступления.
6) Уклонения от следствия и/или суда - попытка избежать ответственности, выразившаяся в скрытии от органов следствия или неявке на судебные заседания.

Глава VII Подписка о невыезде
Подписка о невыезде - это мера пресечения, применяемая в рамках уголовного процесса, которая заключается в обязательстве подозреваемого или обвиняемого не покидать территорию страны без разрешения следователя или суда. Лицо, подписавшее такое обязательство, обязано являться по вызовам следственных органов или суда и не препятствовать расследованию.

Статья 15. Основания для выдачи подписки
5.1 Основанием для выдачи подписки о невыезде является наличие у следственных органов обоснованных подозрений или обвинений в совершении преступления подозреваемым или обвиняемым. При этом учитываются риски уклонения лица от следствия и суда, воспрепятствования расследованию либо совершения иных противоправных действий.

Статья 16. Порядок подписания подписки о невыезде
16.1. Следователь имеет право после допроса подозреваемого или обвиняемого составить и направить в суд ходатайство о подписке о невыезде, если имеются основания полагать, что лицо может уклониться от следствия и суда, воспрепятствовать расследованию или совершить новые преступления. После подачи следователем ходатайства в суд о назначении подписки о невыезде, подозреваемый или обвиняемый должен быть уведомлён о подаче данного ходатайства, а также о возможных последствиях в случае его удовлетворения судом.
16.1.1. Уведомление должно включать информацию о том, что до момента судебного решения подозреваемый не ограничен в праве на передвижение, но после вынесения судебного акта о назначении подписки о невыезде, он обязан будет соблюдать установленные судом ограничения. Следователь обязан разъяснить подозреваемому, что за выезд из страны до или после возможного утверждения судом подписки о невыезде может повлечь за собой более строгие меры пресечения, включая заключение под стражу.
16.2. Ходатайство в суд о назначении подписки о невыезде должно быть подано следователем не позднее чем через 5 часов после уведомления подозреваемого или обвиняемого.
16.3. Подписка о невыезде не вступает в силу до момента её утверждения судом. Суд обязан рассмотреть ходатайство в течение 24 часов с момента его получения. Если суд принимает решение об утверждении подписки о невыезде, она вступает в силу немедленно. В случае отказа суда в удовлетворении ходатайства подписка о невыезде не применяется, а все ранее наложенные временные ограничения автоматически отменяются.

Статья 17. Особые обстоятельства
17.1. Если подозреваемый или обвиняемый покинул территорию Федерации до того, как суд утвердил подписку о невыезде, следователь обязан незамедлительно:
а) Инициировать процедуру розыска лица;
б) Уведомить суд о произошедшем, с указанием, что подозреваемый (обвиняемый) покинул страну.
17.1.1. В таком случае суд, после рассмотрения информации о побеге, может:
а) Выписать ордер AS (Arrest and Search) на имя подозреваемого или обвиняемого;
б) Принять иные меры в соответствии с законодательством.
17.2. Выезд из страны до решения суда может быть расценено как уклонение от следствия и суда и стать основанием для назначения более строгих мер пресечения, включая заключение под стражу.

Глава VIII Повестка
Повестка - это официальный документ, который выдается правоохранительными, надзорными органами, а также судом, с целью уведомить гражданское лицо о необходимости явки в указанное время и место для выполнения определенных действий. Повестка обязывает получателя явиться для проведения следственных мероприятий, допроса, участия в судебном заседании, либо для предоставления показаний или документов.

Статья 18. Виды повесток
18.1. Повестка выданная Министерством внутренних дел - обязывает гражданское лицо явиться в указанное место и время для проведения следственных мероприятий. Такие мероприятия могут включать допрос, очные экспертизы, осмотры, иные процессуальные действия, необходимые для ведения расследования или проверки. Основанием для выдачи повестки служат доказательства или сведения, которые указывают на возможное нарушение законодательства Синей Федерации данным лицом.
18.1.1. Повестка направляется в письменной или электронной форме и должна быть вручена под роспись либо отправлена в личный кабинет на официальном портале Синей Федерации. Электронная подписка должна соответствовать законодательным требованиям и сопровождаться цифровой подписью.
18.1.2. Повестка должна содержать следующую информацию: имя и фамилию (отчество при наличии) лица, которому адресована, описание причин вызова, время и место явки, а также контактные данные уполномоченного лица, к которому можно обратиться для получения дополнительных сведений или предупреждения о невозможности явки.
18.1.3. Неявка по данной повестке может повлечь за собой штрафные санкции, наказание в виде лишения свободы или меры принудительного привода, если гражданское лицо не имеет уважительных причин для неявки. Размер штрафов и порядок их наложения, лишение свободы определяюется в соответствии с административным и уголовным кодексом Синей Федерации. Принудительный привод осуществляется органами внутренних дел.
18.2. Повестка-постановление выданная офисом Генерального инспектора - применяется в случаях, когда требуется провести внутреннее расследование или проверку, касающуюся возможных нарушений законов, норм или внутренних положений служебными лицами или государственными сотрудниками, либо если они могут иметь отношение к расследованию или проверке. Изначально выпускаемые в виде постановления, а после рассылаются на личные адреса.
18.2.1. Повестка-постановление направляется лицу в письменной форме либо через официальный портал в личный кабинет.
18.2.2. Документ должен содержать имя и фамилию (отчество при наличии) лица, которому адресована повестка, описание повода для явки, время и место явки, а также указание на закон, который служит основанием для вызова.
18.2.3. Явка по повестке обязательна. Неявка при отсутствии уважительных причин и предварительного предупреждения может повлечь за собой применение мер принудительного привода и/или лишения свободы.
18.3. Судебная повестка - обязует гражданское лицо или организацию явиться в суд для участия в судебном заседании. Такая повестка может быть направлена как истцу, так и ответчику, а также свидетелям, экспертам и другим участникам процесса, которых суд счел необходимыми для рассмотрения дела. Повестка также может предусматривать предоставление определенных документов или доказательств, необходимых для разрешения дела.
18.3.1. Судебная повестка выдается судом и может быть направлена как в письменной, так и в электронной форме.
18.3.2. Документ включает информацию о судебном деле (номер дела, наименование суда), имя и фамилию (отчество при наличии)или название организации, время, дату и место проведения заседания, а также имя судьи или судебного секретаря, к которому можно обратиться для получения информации.
18.3.3. Неявка на судебное заседание без уважительной причины и предварительного предупреждения может привести к применению мер принудительного привода или штрафам и лишения свободы, а также отложению слушания дела.

Статья 19. Доставка и обжалование повестки
19.1. Способы доставки повестки:
а) Отправка через личный кабинет гражданина на официальном портале Синей Федерации.
б) Личное вручение уполномоченными органами.
19.2. Гражданское лицо вправе обжаловать повестку, если считает её необоснованной. Для этого необходимо обратиться в офис Генерального инспектора в установленном законодательством порядке в течение пяти рабочих дней с момента получения повестки.
19.3. При получении повестки, гражданское лицо вправе запросить у выдающего повестку органу юридическую консультацию для ознакомления со своими правами и обязанностями. Орган, выдавший повестку, обязан предоставить информацию о правах и обязанностях гражданина, либо обеспечить его доступ к правовым консультациям.

Статья 20. Неявка по повестке
20.1. Уважительные причины для неявки по повестке:
а) Заболевание – Если гражданское лицо или его близкий родственник (в случае, если требуется уход) находится на лечении и имеет медицинское заключение, подтверждающее невозможность явки по состоянию здоровья. (( В случае бана ))
б) Несоответствие данных повестки – Если повестка была оформлена с ошибками или не была доставлена надлежащим образом.
в) Заблаговременное уведомление о невозможности присутствия – Если гражданское лицо заранее уведомило органы о невозможности явки и предоставило документы, подтверждающие причину неявки.
г) Иные причины, не предусмотренные в данной главе, не считаются уважительными. Однако могут быть исключительные случаи, когда гражданское лицо имеет основание полагать, что его обстоятельства заслуживают дополнительного рассмотрения. В таких случаях гражданин может обратиться в орган, выдавший повестку, с ходатайством о признании причины уважительной. Решение об удовлетворении такого ходатайства остаётся на усмотрение органа, исходя из специфики представленных данных и обстоятельств. Исключительные случаи должны быть тщательно обоснованы для предотвращения злоупотребления системой вызовов по повесткам.
20.1.1. В случае опоздания на судебное заседание гражданин обязан как можно скорее уведомить суд о причинах задержки. Суд оставляет за собой право перенести заседание или вынести меры ответственности за опоздание в зависимости от обстоятельств.

Глава IX Содержание лиц под стражей в ИВС и СИЗО при правоохранительных органах
Статья 21. Полицейский арест
21.1. Полицейский арест представляет собой краткосрочное содержание лица в изоляторе временного содержания (ИВС) при полицейском департаменте. Целью полицейского ареста является оперативное ограничение свободы лица, подозреваемого в совершении преступления, с целью обеспечения его доступности для проведения дальнейших процессуальных действий и предотвращения возможного уклонения от правосудия или уничтожения доказательств.
21.1.1. Полицейский арест производится на основании ордера AS (Arrest and Search), за исключение ситуаций, когда сотрудник правоохранительных органов вправе задержать лицо без ордера в случаях нахождения его в федеральном розыске (( то есть, у игрока имеется системный розыск )).
21.2. Содержание лица в ИВС не может превышать 48 часов с момента задержания. Если в течение 48 часов при наличии ордера AS обвиняемый не был переведен в СИЗО по решению суда, мера пресечения подлежит снятию.
Статья 22. Оперативное задержание
22.1. ПОперативное задержание представляет собой особую форму полицейского ареста, осуществляемую без ордера AS (Arrest and Search). Данное действие допускается исключительно в ситуациях, когда у сотрудника правоохранительных органов имеются неопровержимые доказательства причастности лица к совершению преступления и существует непосредственная угроза побега подозреваемого или уничтожения им доказательств. При этом оперативное задержание ограничено сроком в 24 часа, в течение которых сотрудник правоохранительных органов обязан получить ордер AS (Arrest and Search). В случае, если ордер не получен, задержанное лицо освобождается.

(( Сотруднику МВД рекомендуется, при возможности, осуществлять РП арест, при котором задержание осуществляется без применения системной команды /arrest. Команда /arrest может использоваться лишь в установленных правилами случаях, когда требуется оперативное задержание.))

Статья 23. Судебный арест
23.1. Судебный арест - это мера пресечения, связанная с длительным ограничением свободы, которая применяется по решению суда на основании ордера PTD (Pre-Trial Detention). В отличие от полицейского ареста, судебный арест предполагает содержание лица в следственном изоляторе (СИЗО), расположенном в исправительном учреждении.
23.1.1. Судебный арест применяется в случаях, когда требуется больше времени для проведения следственных действий или судебных разбирательств, и обеспечивает контроль над лицом, которое может скрыться от следствия или продолжить преступную деятельность. Срок судебного ареста не может превышать 48 часов до момента вынесения судом решение о продлении срока или изменения меры пресечения.
23.1.1.1. Суд вправе продлить срок судебного ареста не более двух раз. Если за это время судебное заседание не было назначено, мера пресечения снимается. В случае, если дата заседания назначена, мера пресечения действует до момента транспортировки лица на суд.

Статья 24. Ордер
24.1. Ордера выписываются и работают в соответствии с Федеральным законом "О государственной системе ордеров"

(( Лица, находящиеся под стражей, не вправе участвовать в РП, способные повлиять на ход расследования, за исключением попыток побега, которые могут быть совершены только в рамках правил. Также лица, находящиеся под стражей, не могут выполнять свои должностные РП обязанности в общем и целом.))


Последнее редактирование модератором: 19.05.2025
]]
slot39 = [[
Специальные:
| /fh - основное меню ФБР хелпера
| /hexit - отключение ФБР хелпера
| /kk - отключиться от сервера (команда для разработчика)
| /cc - очистка чата
| /fhlog - лог скрипта
| /rc - реконнект
| /fhreg - подкачка файла с базой домов для /tsh

Системные:
| /r - рация R с использованием ТЕГа, если он имеется в настройках
| /f - рация F с использованием ТЕГа, если он имеется в настройках
| /su - выдача розыска с автоматической отыгровкой
| /susp - выдача розыска без автоматической отыгровки
| /sus - умная выдача розыска (пока неактуальная)
| /cuff - использование наручников с автоматической отыгровкой
| /cuffsp - использование наручников без автоматической отыгровки
| /uncuff - использование наручников с автоматической отыгровкой
| /uncuff - использование наручников без автоматической отыгровки
| /putpl - усадить игрока в машину с автоматической отыгровкой
| /putplsp - усадить игрока в машину без автоматической отыгровки
| /eject - высадить игрока из машины с автоматической отыгровкой
| /ejectsp - высадить игрока из машины без автоматической отыгровки
| /ticket - выписать штраф с автоматической отыгровкой
| /ticketsp - выписать штраф без автоматической отыгровки
| /takelic - изъятие водительских прав с автоматической отыгровкой
| /takelicsp - изъятие водительских прав без автоматической отыгровки
| /arrest - отправить за решётку игрока с автоматической отыгровкой
| /arrestsp - отправить за решётку игрока без автоматической отыгровки
| /clear - снятие розыска с автоматической отыгровкой
| /clearsp - вынести игрока из базы разыскиваемых без автоматической отыгровки
| /hold - заломать руки человеку и вести его перед собой с автоматической отыгровкой
| /holdsp - заломать руки человеку и вести его перед собой без автоматической отыгровки
| /search - обыск игрока с автоматической отыгровкой
| /searchsp - обыскать игрока без автоматической отыгровки
| /skip - выдача пропуска в здания МВД с автоматической отыгровкой
| /skipsp - выдача пропуска без автоматической отыгровки
| /open - использование шлагбаума с автоматической отыгровкой
| /opensp - использование шлагбаума без автоматической отыгровки
| /mask - использование маски с автоматической отыгровкой
| /masksp - использование маски без автоматической отыгровки
| /healme - использование аптечки с автоматической отыгровкой
| /healmesp - использование аптечки без автоматической отыгровки
| /hack - взлом двери дома с автоматической отыгровкой	
| /hacksp - взлом двери дома без автоматической отыгровки
| /invite - инвайт игрока с автоматической отыгровкой
| /invitesp - инвайт игрока без автоматической отыгровки
| /incar - вытащить игрока из машины с автоматической отыгровкой
| /inmoto - вытащить игрока из мото или велосипеда с автоматической отыгровкой
| /pull - вытащить игрока из транспорта без автоматической отыгровки
| /cs - переодеться самостоятельно через /changeskin с автоматической отыгровкой
| /css - переодеть игрока через /changeskin с автоматической отыгровкой
| /changeskin - поменять форму без автоматической отыгровки
| /rang - выдать ранг игроку с автоматической отыгровкой
| /offrang - выдать ранг игроку в оффлайне с автоматической отыгровкой
| /rangsp - повысить ранг игроку без автоматической отыгровки
| /uninvite - увольнение игрока с автоматической отыгровкой
| /uninviteoff - увольнение игрока в оффлайне с автоматической отыгровкой
| /fo - прослушка с автоматической отыгровкой
| /foff - отключение прослушки с автоматической отыгровкой
| /follow - прослушка без автоматической отыгровки

Дополнительные:
| /fb - фастбай (так-же используется в меню на колёсико мыши)
| /ln - ООС чат лидеров
| /tsh - поиск дома по его номеру
| /rb - удаление маркера поиска дома	
| /sos - использование красной кнопки для тревоги (вне машины)
| /qsm - использование красной кнопки для тревоги (в машине)
| /sm - сокращение команды /setmark (всегда играется с автоматической отыгровкой)
| /hh - отклонить вызов и отключить телефон с автоматической отыгровкой
| /pp - принять вызов с автоматической отыгровкой
| /bl - использование блокнота
| /cam - начало видеозаписи с автоматической отыгровкой
| /cams - окончание видеозаписи с автоматической отыгровкой
| /alp | /alpt | /alps - древняя пасхалка с вайта РП альпинизм через игру в /try и использование /break
| /ук - информация по кодексам
| /vid - скрыть виджет
| /hist - просмотр истории ников игрока по ID
| /gg - сообщить о задержании игрока с автоматической отыгровкой
| /mir - миранда с автоматической отыгровкой
| /mon - GPS трекер с автоматической отыгровкой
| /moff - снятие GPS трекера с автоматической отыгровкой
| /biz - сокращение команды /business
| /ton - тонировка и усиление транспорта с автоматической отыгровкой (не используйте без RP подготовок под фрапс)
| /nar - изъять наркотики с автоматической отыгровкой
| /pt - изъять патроны с автоматической отыгровкой
| /ot - отнять отмычку у заключённого с автоматической отыгровкой
| /ja - сокращение команды /jaildoor
| /cf - снять и надеть наручники без RP (фикс бага после /eject)
| /pg - быстрое /su id 3 9.1 УК при погоне с автоматической отыгровкой
| /pn - приказать в мегафон не выходить из автомобиля и выбросить ключи в окно
| /pk - приказать в мегафон немедленно покинуть транспорт
| /pr - приказать в мегафон прекратить преследование транспорта
| /meg - использование мегафона
| /megsp - использование мегафона вне ранчера/полицейского крузера
| /krik - кричалка с автоматической отыгровкой
| /rhelp - запрос помощи в рацию R
| /fhelp - запрос помощи в рацию F
| /unc - снять с себя наручники при помощи отмычки с автоматической отыгровкой
| /dor - приказать уступить дорогу транспорту
| /уд - использовать удостоверение с данными из настроек ФБР хелпера
| /ii - быстро переодеться в одежду из первого слота в инвентаре
| /ud - использование удостоверения с возможностью написать данные самостоятельно
]]
slot40 = 8186484168865098.0
slot41 = 4887
slot42 = nil

decode = function(slot0)
	slot1 = uv0
	slot2 = 16384 + uv1

	return slot0.gsub(slot0, "%x%x", function (slot0)
		slot1 = uv0 % 274877906944.0
		slot2 = (uv0 - slot1) / 274877906944.0
		slot3 = slot2 % 128
		slot0 = tonumber(slot0, 16)
		slot4 = (slot0 + (slot2 - slot3) / 128) * (2 * slot3 + 1) % 256
		uv0 = slot1 * uv1 + slot2 + slot0 + slot4

		return string.char(slot4)
	end)
end

BindJson = function(slot0, slot1)
	assert(slot0)
	assert(slot1)

	slot2 = function(slot0, slot1)
		slot2 = 0

		for slot6, slot7 in pairs(slot0) do
			if type(slot1[slot6]) == "nil" then
				slot1[slot6] = slot7
				slot2 = slot2 + 1
			elseif type(slot1[slot6]) == "table" and type(slot7) == "table" then
				slot1, _changedValues = uv0(slot7, slot1[slot6])
				slot2 = slot2 + _changedValues
			end
		end

		return slot1, slot2
	end

	slot3 = function(slot0)
		slot1, slot2 = pcall(encodeJson, slot0)

		if not slot1 or slot2 == nil then
			return false, "encode error"
		end

		if not io.open(uv0, "w") then
			return false, "cannot open file"
		end

		slot3:write(slot2)
		slot3:close()
	end

	slot5, slot6, slot7 = (function ()
		if not doesFileExist(uv0) then
			uv1(uv2)
		end

		if not io.open(uv0, "r") then
			return false, {}, "cannot open file"
		end

		slot0:close()

		slot2, slot3 = pcall(decodeJson, slot0:read("*a"))

		if not slot2 or slot3 == nil then
			return false, {}, "decode error"
		end

		slot4, slot5 = uv3(uv2, slot3)

		if slot5 > 0 then
			uv1(slot4)
		end

		return slot2, slot4, "ok"
	end)()

	return slot5, slot5 and setmetatable(slot6, {
		__call = function (slot0)
			uv0(slot0)
		end
	}) or {}, slot7
end

loadBindJson = function(slot0, slot1)
	slot2, slot3 = BindJson(slot0, slot1)

	if not slot2 then
		print("Не удалось загрузить JSON: " .. slot0)
	end

	return slot3
end

slot40 = loadBindJson(getWorkingDirectory() .. "\\fhbind.json", {})

chkupd = function()
	math.randomseed(os.time())
	createDirectory(getWorkingDirectory() .. "\\config\\")

	slot1 = decode("20c2c5364cc91b8e7f07e31509c5f2d1JDo4Y3LQ24uHsgKVhGJfwDuu3WR2GoT4g2a50113e17842")
	waiter1 = true

	downloadUrlToFile("https://raw.githubusercontent.com/TSIDEX/FBIhelper/main/moonloader/version.json", getWorkingDirectory() .. "\\config\\" .. math.random(1, 93482) .. ".json", function (slot0, slot1, slot2, slot3)
		if slot1 == 58 then
			if doesFileExist(uv0) then
				if io.open(uv0, "r") then
					slot5 = decodeJson(slot4:read("*a"))
					updatelink = slot5.updateurl
					updateversion = slot5.latest

					slot4:close()
					os.remove(uv0)
					os.remove(uv0)
					os.remove(uv0)

					if slot5.latest ~= uv1 then
						lua_thread.create(goupdate)
					else
						print("v" .. uv1 .. ": " .. decode("de2d4698575e0bb8660d0be1a7380435deecdf42b7892e"))

						slot5 = nil
						waiter1 = false
					end
				end
			else
				sampAddChatMessage("{FFFFFF}FH: невозможно проверить обновление", 16777215)
				print("невозможно проверить обновление, выгружаюсь из памяти")
			end
		end
	end)

	while waiter1 do
		wait(0)
	end
end

goupdate = function()
	sampAddChatMessage("{4c4f45}[FBI Helper] {FFFFFF}" .. "Обнаружено обновление. Пытаюсь обновиться c " .. uv0 .. " на " .. updateversion, -1)
	wait(250)
	sampAddChatMessage("{4c4f45}[FBI Helper] {FFFFFF}" .. "Производится установка компонента wanted.txt", -1)
	wait(250)
	downloadUrlToFile("https://raw.githubusercontent.com/TSIDEX/FBIhelper/main/moonloader/wanted.txt", getWorkingDirectory() .. "/wanted.txt", function (slot0, slot1, slot2, slot3)
		if slot1 == 5 then
			if sampGetChatString(99):find("Загружено") then
				sampSetChatString(99, uv0 .. string.format("Загружено %d KB из %d KB.", slot2 / 1000, slot3 / 1000), nil, -1)
			else
				sampAddChatMessage(uv0 .. string.format("Загружено %d KB из %d KB.", slot2 / 1000, slot3 / 1000), uv1)
			end
		elseif slot1 == 6 then
			print("Загрузка успешно завершена.")
			sampAddChatMessage(uv0 .. "Установка wanted.txt успешно завершена.", uv1)

			goupdatestatus = true
		end

		if slot1 == 58 and goupdatestatus == nil then
			sampAddChatMessage(uv0 .. "Загрузка прошла неудачно. Обратитесь в поддержку.", uv1)
		end
	end)
	wait(1000)
	downloadUrlToFile(updatelink, thisScript().path, function (slot0, slot1, slot2, slot3)
		if slot1 == 5 then
			if sampGetChatString(99):find("Загружено") then
				sampSetChatString(99, uv0 .. string.format("Загружено %d KB из %d KB.", slot2 / 1000, slot3 / 1000), nil, -1)
			else
				sampAddChatMessage(uv0 .. string.format("Загружено %d KB из %d KB.", slot2 / 1000, slot3 / 1000), uv1)
			end
		elseif slot1 == 6 then
			print("Загрузка обновления завершена.")
			sampAddChatMessage(uv0 .. "Обновление завершено!", uv1)

			goupdatestatus = true

			thisScript():reload()
		end

		if slot1 == 58 and goupdatestatus == nil then
			sampAddChatMessage(uv0 .. "Обновление прошло неудачно. Обратитесь в поддержку.", uv1)
		end
	end)
end

slot2.DarkTheme = function()
	uv0.SwitchContext()

	uv0.GetStyle().WindowPadding = uv0.ImVec2(5, 5)
	uv0.GetStyle().FramePadding = uv0.ImVec2(5, 5)
	uv0.GetStyle().ItemSpacing = uv0.ImVec2(5, 5)
	uv0.GetStyle().ItemInnerSpacing = uv0.ImVec2(2, 2)
	uv0.GetStyle().TouchExtraPadding = uv0.ImVec2(0, 0)
	uv0.GetStyle().IndentSpacing = 0
	uv0.GetStyle().ScrollbarSize = 10
	uv0.GetStyle().GrabMinSize = 10
	uv0.GetStyle().WindowBorderSize = 1
	uv0.GetStyle().ChildBorderSize = 2
	uv0.GetStyle().PopupBorderSize = 1
	uv0.GetStyle().FrameBorderSize = 1
	uv0.GetStyle().TabBorderSize = 1
	uv0.GetStyle().WindowRounding = 5
	uv0.GetStyle().ChildRounding = 5
	uv0.GetStyle().FrameRounding = 5
	uv0.GetStyle().PopupRounding = 5
	uv0.GetStyle().ScrollbarRounding = 5
	uv0.GetStyle().GrabRounding = 5
	uv0.GetStyle().TabRounding = 5
	uv0.GetStyle().WindowTitleAlign = uv0.ImVec2(0.5, 0.5)
	uv0.GetStyle().ButtonTextAlign = uv0.ImVec2(0.5, 0.5)
	uv0.GetStyle().SelectableTextAlign = uv0.ImVec2(0.5, 0.5)
	uv0.GetStyle().Colors[uv0.Col.Text] = uv0.ImVec4(1, 1, 1, 1)
	uv0.GetStyle().Colors[uv0.Col.TextDisabled] = uv0.ImVec4(0.5, 0.5, 0.5, 1)
	uv0.GetStyle().Colors[uv0.Col.WindowBg] = uv0.ImVec4(0.07, 0.07, 0.07, 0.97)
	uv0.GetStyle().Colors[uv0.Col.ChildBg] = uv0.ImVec4(0.07, 0.07, 0.07, 0.3)
	uv0.GetStyle().Colors[uv0.Col.PopupBg] = uv0.ImVec4(0.07, 0.07, 0.07, 1)
	uv0.GetStyle().Colors[uv0.Col.Border] = uv0.ImVec4(0.25, 0.25, 0.26, 0.54)
	uv0.GetStyle().Colors[uv0.Col.BorderShadow] = uv0.ImVec4(0, 0, 0, 0)
	uv0.GetStyle().Colors[uv0.Col.FrameBg] = uv0.ImVec4(0.12, 0.12, 0.12, 1)
	uv0.GetStyle().Colors[uv0.Col.FrameBgHovered] = uv0.ImVec4(0.25, 0.25, 0.26, 1)
	uv0.GetStyle().Colors[uv0.Col.FrameBgActive] = uv0.ImVec4(0.25, 0.25, 0.26, 1)
	uv0.GetStyle().Colors[uv0.Col.TitleBg] = uv0.ImVec4(0.12, 0.12, 0.12, 1)
	uv0.GetStyle().Colors[uv0.Col.TitleBgActive] = uv0.ImVec4(0.12, 0.12, 0.12, 1)
	uv0.GetStyle().Colors[uv0.Col.TitleBgCollapsed] = uv0.ImVec4(0.12, 0.12, 0.12, 1)
	uv0.GetStyle().Colors[uv0.Col.MenuBarBg] = uv0.ImVec4(0.12, 0.12, 0.12, 1)
	uv0.GetStyle().Colors[uv0.Col.ScrollbarBg] = uv0.ImVec4(0.12, 0.12, 0.12, 1)
	uv0.GetStyle().Colors[uv0.Col.ScrollbarGrab] = uv0.ImVec4(0, 0, 0, 1)
	uv0.GetStyle().Colors[uv0.Col.ScrollbarGrabHovered] = uv0.ImVec4(0.41, 0.41, 0.41, 1)
	uv0.GetStyle().Colors[uv0.Col.ScrollbarGrabActive] = uv0.ImVec4(0.51, 0.51, 0.51, 1)
	uv0.GetStyle().Colors[uv0.Col.CheckMark] = uv0.ImVec4(1, 1, 1, 1)
	uv0.GetStyle().Colors[uv0.Col.SliderGrab] = uv0.ImVec4(0.21, 0.2, 0.2, 1)
	uv0.GetStyle().Colors[uv0.Col.SliderGrabActive] = uv0.ImVec4(0.21, 0.2, 0.2, 1)
	uv0.GetStyle().Colors[uv0.Col.Button] = uv0.ImVec4(0.12, 0.12, 0.12, 1)
	uv0.GetStyle().Colors[uv0.Col.ButtonHovered] = uv0.ImVec4(0.21, 0.2, 0.2, 1)
	uv0.GetStyle().Colors[uv0.Col.ButtonActive] = uv0.ImVec4(0.41, 0.41, 0.41, 1)
	uv0.GetStyle().Colors[uv0.Col.Header] = uv0.ImVec4(0.12, 0.12, 0.12, 1)
	uv0.GetStyle().Colors[uv0.Col.HeaderHovered] = uv0.ImVec4(0.2, 0.2, 0.2, 1)
	uv0.GetStyle().Colors[uv0.Col.HeaderActive] = uv0.ImVec4(0.47, 0.47, 0.47, 1)
	uv0.GetStyle().Colors[uv0.Col.Separator] = uv0.ImVec4(0.12, 0.12, 0.12, 1)
	uv0.GetStyle().Colors[uv0.Col.SeparatorHovered] = uv0.ImVec4(0.12, 0.12, 0.12, 1)
	uv0.GetStyle().Colors[uv0.Col.SeparatorActive] = uv0.ImVec4(0.12, 0.12, 0.12, 1)
	uv0.GetStyle().Colors[uv0.Col.ResizeGrip] = uv0.ImVec4(1, 1, 1, 0.25)
	uv0.GetStyle().Colors[uv0.Col.ResizeGripHovered] = uv0.ImVec4(1, 1, 1, 0.67)
	uv0.GetStyle().Colors[uv0.Col.ResizeGripActive] = uv0.ImVec4(1, 1, 1, 0.95)
	uv0.GetStyle().Colors[uv0.Col.Tab] = uv0.ImVec4(0.12, 0.12, 0.12, 1)
	uv0.GetStyle().Colors[uv0.Col.TabHovered] = uv0.ImVec4(0.28, 0.28, 0.28, 1)
	uv0.GetStyle().Colors[uv0.Col.TabActive] = uv0.ImVec4(0.3, 0.3, 0.3, 1)
	uv0.GetStyle().Colors[uv0.Col.TabUnfocused] = uv0.ImVec4(0.07, 0.1, 0.15, 0.97)
	uv0.GetStyle().Colors[uv0.Col.TabUnfocusedActive] = uv0.ImVec4(0.14, 0.26, 0.42, 1)
	uv0.GetStyle().Colors[uv0.Col.PlotLines] = uv0.ImVec4(0.61, 0.61, 0.61, 1)
	uv0.GetStyle().Colors[uv0.Col.PlotLinesHovered] = uv0.ImVec4(1, 0.43, 0.35, 1)
	uv0.GetStyle().Colors[uv0.Col.PlotHistogram] = uv0.ImVec4(0.9, 0.7, 0, 1)
	uv0.GetStyle().Colors[uv0.Col.PlotHistogramHovered] = uv0.ImVec4(1, 0.6, 0, 1)
	uv0.GetStyle().Colors[uv0.Col.TextSelectedBg] = uv0.ImVec4(1, 0, 0, 0.35)
	uv0.GetStyle().Colors[uv0.Col.DragDropTarget] = uv0.ImVec4(1, 1, 0, 0.9)
	uv0.GetStyle().Colors[uv0.Col.NavHighlight] = uv0.ImVec4(0.26, 0.59, 0.98, 1)
	uv0.GetStyle().Colors[uv0.Col.NavWindowingHighlight] = uv0.ImVec4(1, 1, 1, 0.7)
	uv0.GetStyle().Colors[uv0.Col.NavWindowingDimBg] = uv0.ImVec4(0.8, 0.8, 0.8, 0.2)
	uv0.GetStyle().Colors[uv0.Col.ModalWindowDimBg] = uv0.ImVec4(0, 0, 0, 0.7)
end

slot2.OnInitialize(function ()
	uv0.GetIO().IniFilename = nil

	uv0.DarkTheme()
end)

var_cfg = function()
	cfg = uv0.load({
		config = {
			delayfunc1 = "1200",
			delay2 = "1200",
			delay10 = "1200",
			txt16 = "t16",
			delay24 = "1200",
			txt19 = "t19",
			CheckBox10 = false,
			CheckBox19 = false,
			delay14 = "1200",
			CheckBox3 = false,
			management = "CID",
			CheckBox28 = false,
			fbfix = true,
			name = "Владимир Виноградов",
			CheckBox4 = false,
			CheckTxt28 = false,
			txt28 = "t28",
			Gunbox4 = true,
			delay3 = "1200",
			delay4 = "1200",
			Gunbox7 = false,
			CheckBox31 = false,
			Gunbox8 = true,
			CheckTxt8 = false,
			CheckTxt6 = false,
			autobenz = false,
			Gunbox6 = false,
			smiup = false,
			delay17 = "1200",
			txt26 = "t26",
			func1 = true,
			CheckBox2 = false,
			CheckTxt27 = false,
			delay27 = "1200",
			Gunbox5 = true,
			delay7 = "1200",
			CheckTxt5 = true,
			Gunbox3 = true,
			CheckBox9 = false,
			txt9 = "t9",
			Gunbox2 = false,
			CheckBox8 = false,
			delay28 = "1200",
			txt6 = "t6",
			txt8 = "t8",
			txt5 = "t5",
			txt7 = "t7",
			Gunbox1 = false,
			CheckTxt19 = false,
			CheckBox20 = false,
			delay6 = "1200",
			smark = "999",
			posX = -100,
			delay11 = "1200",
			pw = false,
			CheckTxt4 = true,
			CheckTxt29 = false,
			delay16 = "1200",
			txt11 = "t11",
			CheckTxt18 = false,
			CheckTxt7 = false,
			delay1 = "1200",
			txt2 = "t2",
			txt4 = "t4",
			txt1 = "t1",
			txt3 = "t3",
			CheckTxt11 = false,
			CheckTxt9 = false,
			mobile = "9999999",
			net = false,
			CheckTxt12 = false,
			delay12 = "1200",
			CheckTxt21 = false,
			delay21 = "1200",
			CheckTxt10 = false,
			delay26 = "1200",
			CheckTxt22 = false,
			stbind = true,
			txt18 = "t18",
			Gunbox9 = false,
			CheckBox18 = false,
			CheckBox5 = true,
			CheckBox29 = false,
			CheckTxt20 = false,
			delay13 = "1200",
			delay19 = "1200",
			CheckTxt30 = false,
			delay15 = "1200",
			CheckTxt17 = false,
			org = "FBI",
			da = false,
			sms = "9999999",
			delay22 = "1200",
			delay9 = "1200",
			txt22 = "t22",
			CheckBox6 = false,
			password = "",
			delay30 = "1200",
			CheckBox33 = false,
			delay5 = "1200",
			CheckTxt1 = true,
			txt23 = "t23",
			posY = -100,
			CheckBox77 = true,
			txt21 = "t21",
			CheckTxt15 = false,
			CheckBox11 = false,
			CheckTxt2 = true,
			delay8 = "1200",
			delay23 = "1200",
			rang = "Младший агент",
			CheckTxt16 = false,
			delay29 = "1200",
			CheckTxt13 = false,
			txt30 = "t30",
			CheckBox13 = true,
			rtag = "",
			CheckTxt25 = false,
			txt27 = "t27",
			delay25 = "1200",
			CheckBox14 = false,
			CheckTxt14 = false,
			txt25 = "t25",
			txt10 = "t10",
			txt20 = "t20",
			txt13 = "t13",
			CheckTxt26 = false,
			grav = "Лубянка",
			CheckTxt23 = false,
			delay20 = "1200",
			news = true,
			ftag = "",
			txt12 = "t12",
			txt15 = "t15",
			CheckTxt24 = false,
			pie2 = true,
			CheckTxt3 = true,
			txt29 = "t29",
			txt14 = "t14",
			txt24 = "t24",
			txt17 = "t17",
			delay18 = "1200"
		},
		bl = {},
		dfunc1 = {},
		txt1 = {},
		txt2 = {},
		txt3 = {},
		txt4 = {},
		txt5 = {},
		txt6 = {},
		txt7 = {},
		txt8 = {},
		txt9 = {},
		txt10 = {},
		txt11 = {},
		txt12 = {},
		txt13 = {},
		txt14 = {},
		txt15 = {},
		txt16 = {},
		txt17 = {},
		txt18 = {},
		txt19 = {},
		txt20 = {},
		txt21 = {},
		txt22 = {},
		txt23 = {},
		txt24 = {},
		txt25 = {},
		txt26 = {},
		txt27 = {},
		txt28 = {},
		txt29 = {},
		txt30 = {}
	}, "FBIhelper")
end

var_cfg()

slot41 = {
	name = slot33.char[256](),
	text = slot33.char[10000](),
	wait = slot33.int(1200)
}
slot42 = {
	id = -1,
	name = slot33.char[256](),
	text = slot33.char[10000](),
	wait = slot33.int(1200)
}
slot43 = {
	true,
	false,
	false,
	false,
	false,
	false
}
slot44 = {
	click = slot33.bool(),
	vid = slot33.bool(),
	spw = slot33.bool(),
	mainwindow = slot33.bool(),
	uk = slot33.bool(),
	sus = slot33.bool(),
	home = slot33.bool(),
	newsm = slot33.bool(),
	pw = slot33.bool(cfg.config.pw),
	smiup = slot33.bool(cfg.config.smiup),
	CheckBox2 = slot33.bool(cfg.config.CheckBox2),
	autobenz = slot33.bool(cfg.config.autobenz),
	CheckBox3 = slot33.bool(cfg.config.CheckBox3),
	CheckBox4 = slot33.bool(cfg.config.CheckBox4),
	CheckBox5 = slot33.bool(cfg.config.CheckBox5),
	CheckBox6 = slot33.bool(cfg.config.CheckBox6),
	CheckBox8 = slot33.bool(cfg.config.CheckBox8),
	CheckBox9 = slot33.bool(cfg.config.CheckBox9),
	CheckBox10 = slot33.bool(cfg.config.CheckBox10),
	CheckBox11 = slot33.bool(cfg.config.CheckBox11),
	CheckBox13 = slot33.bool(cfg.config.CheckBox13),
	CheckBox14 = slot33.bool(cfg.config.CheckBox14),
	CheckBox18 = slot33.bool(cfg.config.CheckBox18),
	CheckBox19 = slot33.bool(cfg.config.CheckBox19),
	CheckBox20 = slot33.bool(cfg.config.CheckBox20),
	fbfix = slot33.bool(cfg.config.fbfix),
	CheckBox28 = slot33.bool(cfg.config.CheckBox28),
	CheckBox29 = slot33.bool(cfg.config.CheckBox29),
	CheckBox77 = slot33.bool(cfg.config.CheckBox77),
	CheckBox31 = slot33.bool(cfg.config.CheckBox31),
	CheckBox33 = slot33.bool(cfg.config.CheckBox33),
	CheckTxt1 = slot33.bool(cfg.config.CheckTxt1),
	CheckTxt2 = slot33.bool(cfg.config.CheckTxt2),
	CheckTxt3 = slot33.bool(cfg.config.CheckTxt3),
	CheckTxt4 = slot33.bool(cfg.config.CheckTxt4),
	CheckTxt5 = slot33.bool(cfg.config.CheckTxt5),
	CheckTxt6 = slot33.bool(cfg.config.CheckTxt6),
	CheckTxt7 = slot33.bool(cfg.config.CheckTxt7),
	CheckTxt8 = slot33.bool(cfg.config.CheckTxt8),
	CheckTxt9 = slot33.bool(cfg.config.CheckTxt9),
	CheckTxt10 = slot33.bool(cfg.config.CheckTxt10),
	CheckTxt11 = slot33.bool(cfg.config.CheckTxt11),
	CheckTxt12 = slot33.bool(cfg.config.CheckTxt12),
	CheckTxt13 = slot33.bool(cfg.config.CheckTxt13),
	CheckTxt14 = slot33.bool(cfg.config.CheckTxt14),
	CheckTxt15 = slot33.bool(cfg.config.CheckTxt15),
	CheckTxt16 = slot33.bool(cfg.config.CheckTxt16),
	CheckTxt17 = slot33.bool(cfg.config.CheckTxt17),
	CheckTxt18 = slot33.bool(cfg.config.CheckTxt18),
	CheckTxt19 = slot33.bool(cfg.config.CheckTxt19),
	CheckTxt20 = slot33.bool(cfg.config.CheckTxt20),
	CheckTxt21 = slot33.bool(cfg.config.CheckTxt21),
	CheckTxt22 = slot33.bool(cfg.config.CheckTxt22),
	CheckTxt23 = slot33.bool(cfg.config.CheckTxt23),
	CheckTxt24 = slot33.bool(cfg.config.CheckTxt24),
	CheckTxt25 = slot33.bool(cfg.config.CheckTxt25),
	CheckTxt26 = slot33.bool(cfg.config.CheckTxt26),
	CheckTxt27 = slot33.bool(cfg.config.CheckTxt27),
	CheckTxt28 = slot33.bool(cfg.config.CheckTxt28),
	CheckTxt29 = slot33.bool(cfg.config.CheckTxt29),
	CheckTxt30 = slot33.bool(cfg.config.CheckTxt30),
	Gunbox1 = slot33.bool(cfg.config.Gunbox1),
	Gunbox2 = slot33.bool(cfg.config.Gunbox2),
	Gunbox3 = slot33.bool(cfg.config.Gunbox3),
	Gunbox4 = slot33.bool(cfg.config.Gunbox4),
	Gunbox5 = slot33.bool(cfg.config.Gunbox5),
	Gunbox6 = slot33.bool(cfg.config.Gunbox6),
	Gunbox7 = slot33.bool(cfg.config.Gunbox7),
	Gunbox8 = slot33.bool(cfg.config.Gunbox8),
	Gunbox9 = slot33.bool(cfg.config.Gunbox9),
	func1 = slot33.bool(cfg.config.func1)
}
slot45 = {
	password = slot33.char[256](),
	name = slot33.char[256](slot6(cfg.config.name)),
	rang = slot33.char[256](slot6(cfg.config.rang)),
	org = slot33.char[256](slot6(cfg.config.org)),
	management = slot33.char[256](slot6(cfg.config.management)),
	rtag = slot33.char[256](slot6(cfg.config.rtag)),
	ftag = slot33.char[256](slot6(cfg.config.ftag)),
	tsh = slot33.char[5](),
	txt1 = slot33.char[256](slot6(cfg.config.txt1)),
	txt2 = slot33.char[256](slot6(cfg.config.txt2)),
	txt3 = slot33.char[256](slot6(cfg.config.txt3)),
	txt4 = slot33.char[256](slot6(cfg.config.txt4)),
	txt5 = slot33.char[256](slot6(cfg.config.txt5)),
	txt6 = slot33.char[256](slot6(cfg.config.txt6)),
	txt7 = slot33.char[256](slot6(cfg.config.txt7)),
	txt8 = slot33.char[256](slot6(cfg.config.txt8)),
	txt9 = slot33.char[256](slot6(cfg.config.txt9)),
	txt10 = slot33.char[256](slot6(cfg.config.txt10)),
	txt11 = slot33.char[256](slot6(cfg.config.txt11)),
	txt12 = slot33.char[256](slot6(cfg.config.txt12)),
	txt13 = slot33.char[256](slot6(cfg.config.txt13)),
	txt14 = slot33.char[256](slot6(cfg.config.txt14)),
	txt15 = slot33.char[256](slot6(cfg.config.txt15)),
	txt16 = slot33.char[256](slot6(cfg.config.txt16)),
	txt17 = slot33.char[256](slot6(cfg.config.txt17)),
	txt18 = slot33.char[256](slot6(cfg.config.txt18)),
	txt19 = slot33.char[256](slot6(cfg.config.txt19)),
	txt20 = slot33.char[256](slot6(cfg.config.txt20)),
	txt21 = slot33.char[256](slot6(cfg.config.txt21)),
	txt22 = slot33.char[256](slot6(cfg.config.txt22)),
	txt23 = slot33.char[256](slot6(cfg.config.txt23)),
	txt24 = slot33.char[256](slot6(cfg.config.txt24)),
	txt25 = slot33.char[256](slot6(cfg.config.txt25)),
	txt26 = slot33.char[256](slot6(cfg.config.txt26)),
	txt27 = slot33.char[256](slot6(cfg.config.txt27)),
	txt28 = slot33.char[256](slot6(cfg.config.txt28)),
	txt29 = slot33.char[256](slot6(cfg.config.txt29)),
	txt30 = slot33.char[256](slot6(cfg.config.txt30)),
	delayfunc1 = slot33.char[256](slot6(cfg.config.delayfunc1)),
	delay1 = slot33.char[256](slot6(cfg.config.delay1)),
	delay2 = slot33.char[256](slot6(cfg.config.delay2)),
	delay3 = slot33.char[256](slot6(cfg.config.delay3)),
	delay4 = slot33.char[256](slot6(cfg.config.delay4)),
	delay5 = slot33.char[256](slot6(cfg.config.delay5)),
	delay6 = slot33.char[256](slot6(cfg.config.delay6)),
	delay7 = slot33.char[256](slot6(cfg.config.delay7)),
	delay8 = slot33.char[256](slot6(cfg.config.delay8)),
	delay9 = slot33.char[256](slot6(cfg.config.delay9)),
	delay10 = slot33.char[256](slot6(cfg.config.delay10)),
	delay11 = slot33.char[256](slot6(cfg.config.delay11)),
	delay12 = slot33.char[256](slot6(cfg.config.delay12)),
	delay13 = slot33.char[256](slot6(cfg.config.delay13)),
	delay14 = slot33.char[256](slot6(cfg.config.delay14)),
	delay15 = slot33.char[256](slot6(cfg.config.delay15)),
	delay16 = slot33.char[256](slot6(cfg.config.delay16)),
	delay17 = slot33.char[256](slot6(cfg.config.delay17)),
	delay18 = slot33.char[256](slot6(cfg.config.delay18)),
	delay19 = slot33.char[256](slot6(cfg.config.delay19)),
	delay20 = slot33.char[256](slot6(cfg.config.delay20)),
	delay21 = slot33.char[256](slot6(cfg.config.delay21)),
	delay22 = slot33.char[256](slot6(cfg.config.delay22)),
	delay23 = slot33.char[256](slot6(cfg.config.delay23)),
	delay24 = slot33.char[256](slot6(cfg.config.delay24)),
	delay25 = slot33.char[256](slot6(cfg.config.delay25)),
	delay26 = slot33.char[256](slot6(cfg.config.delay26)),
	delay27 = slot33.char[256](slot6(cfg.config.delay27)),
	delay28 = slot33.char[256](slot6(cfg.config.delay28)),
	delay29 = slot33.char[256](slot6(cfg.config.delay29)),
	delay30 = slot33.char[256](slot6(cfg.config.delay30)),
	bl = slot33.char[300000](slot6(table.concat(cfg.bl, "\n"))),
	tfunc1 = slot33.char[300000](slot6(table.concat(cfg.dfunc1, "\n"))),
	txt1o1 = slot33.char[300000](slot6(table.concat(cfg.txt1, "\n"))),
	txt2o1 = slot33.char[300000](slot6(table.concat(cfg.txt2, "\n"))),
	txt3o1 = slot33.char[300000](slot6(table.concat(cfg.txt3, "\n"))),
	txt4o1 = slot33.char[300000](slot6(table.concat(cfg.txt4, "\n"))),
	txt5o1 = slot33.char[300000](slot6(table.concat(cfg.txt5, "\n"))),
	txt6o1 = slot33.char[300000](slot6(table.concat(cfg.txt6, "\n"))),
	txt7o1 = slot33.char[300000](slot6(table.concat(cfg.txt7, "\n"))),
	txt8o1 = slot33.char[300000](slot6(table.concat(cfg.txt8, "\n"))),
	txt9o1 = slot33.char[300000](slot6(table.concat(cfg.txt9, "\n"))),
	txt10o1 = slot33.char[300000](slot6(table.concat(cfg.txt10, "\n"))),
	txt11o1 = slot33.char[300000](slot6(table.concat(cfg.txt11, "\n"))),
	txt12o1 = slot33.char[300000](slot6(table.concat(cfg.txt12, "\n"))),
	txt13o1 = slot33.char[300000](slot6(table.concat(cfg.txt13, "\n"))),
	txt14o1 = slot33.char[300000](slot6(table.concat(cfg.txt14, "\n"))),
	txt15o1 = slot33.char[300000](slot6(table.concat(cfg.txt15, "\n"))),
	txt16o1 = slot33.char[300000](slot6(table.concat(cfg.txt16, "\n"))),
	txt17o1 = slot33.char[300000](slot6(table.concat(cfg.txt17, "\n"))),
	txt18o1 = slot33.char[300000](slot6(table.concat(cfg.txt18, "\n"))),
	txt19o1 = slot33.char[300000](slot6(table.concat(cfg.txt19, "\n"))),
	txt20o1 = slot33.char[300000](slot6(table.concat(cfg.txt20, "\n"))),
	txt21o1 = slot33.char[300000](slot6(table.concat(cfg.txt21, "\n"))),
	txt22o1 = slot33.char[300000](slot6(table.concat(cfg.txt22, "\n"))),
	txt23o1 = slot33.char[300000](slot6(table.concat(cfg.txt23, "\n"))),
	txt24o1 = slot33.char[300000](slot6(table.concat(cfg.txt24, "\n"))),
	txt25o1 = slot33.char[300000](slot6(table.concat(cfg.txt25, "\n"))),
	txt26o1 = slot33.char[300000](slot6(table.concat(cfg.txt26, "\n"))),
	txt27o1 = slot33.char[300000](slot6(table.concat(cfg.txt27, "\n"))),
	txt28o1 = slot33.char[300000](slot6(table.concat(cfg.txt28, "\n"))),
	txt29o1 = slot33.char[300000](slot6(table.concat(cfg.txt29, "\n"))),
	txt30o1 = slot33.char[300000](slot6(table.concat(cfg.txt30, "\n")))
}
slot46 = slot2.OnFrame(function ()
	return uv0.mainwindow[0]
end, function (slot0)
	slot1, slot2 = getScreenResolution()
	slot3, slot4 = getScreenResolution()
	slot5, slot6, slot7 = getCharCoordinates(PLAYER_PED)
	slot8 = sampGetPlayerPing(myid())

	uv0.PushStyleColor(uv0.Col.WindowBg, uv0.ImVec4(0, 0, 0, 0.2))
	renderDrawTexture(uv1, (slot1 - 900) / 2, (slot2 - 490) / 2, 900, 500, 0, 4294967295.0)
	uv0.SetNextWindowPos(uv0.ImVec2(slot1 / 2, slot2 / 2), uv0.Cond.FirstUseEver, uv0.ImVec2(0.5, 0.5))
	uv0.SetNextWindowSize(uv0.ImVec2(900, 510), uv0.Cond.FirstUseEver)
	uv0.Begin(uv2(" FH: ") .. uv3 .. "", uv4.mainwindow, uv0.WindowFlags.NoResize + uv0.WindowFlags.NoMove + uv0.WindowFlags.NoCollapse)
	uv0.SetCursorPos(uv0.ImVec2(17, 30))

	if uv0.BeginChild("##runwin", uv0.ImVec2(865, 470), true) then
		uv0.Columns(2)
		uv0.SetColumnWidth(-1, 165)

		if uv0.Button(uv2(" Настройки"), uv0.ImVec2(150, 50)) then
			uu()

			uv5[1] = true
		end

		if uv0.Button(uv2(" Биндер"), uv0.ImVec2(150, 50)) then
			uu()

			uv5[2] = true
		end

		uv0.SetCursorPos(uv0.ImVec2(10, 200))
		uv0.NextColumn()
		uv0.NewLine()
		uv0.SameLine(3)

		if uv5[1] then
			if uv0.Button(uv2("Основные настройки")) then
				uv6 = 1
			end

			uv0.SameLine()

			if uv0.Button(uv2("Контактная информация")) then
				uv6 = 2
			end

			if uv6 == 1 then
				uv0.PushStyleColor(uv0.Col.ChildBg, uv0.ImVec4(0, 0, 0, 0.4))

				if uv0.BeginChild("##knopochki", uv0.ImVec2(630, 160), true) then
					uv0.Columns(3)

					if uv0.Checkbox(uv2("Стандартные функции"), uv4.CheckBox77) then
						cfg.config.CheckBox77 = uv4.CheckBox77[0]

						uv7.save(cfg, "FBIhelper")
					end

					uv0.Tootlip([[
Отключение данного параметра приведёт 
к полному отключению основных
функций и команд, используемых в ФБР и МВД.
			

После отключения или включения этого параметра необходимо
перезапустить скрипт CTRL+R!]])

					if uv0.Checkbox(uv2("Меню на колёсико мыши"), uv4.CheckBox13) then
						cfg.config.CheckBox13 = uv4.CheckBox13[0]

						uv7.save(cfg, "FBIhelper")
					end

					uv0.Tootlip("Если данный параметр включён, то Вы сможете воспользоваться\nудобным меню, зажав колёсико мыши и выбрав нужный пункт. ")

					if uv0.Checkbox(uv2("Скрывать виджет"), uv4.CheckBox19) then
						cfg.config.CheckBox19 = uv4.CheckBox19[0]

						uv7.save(cfg, "FBIhelper")
					end

					uv0.Tootlip("Если данный параметр включён, то виджет больше не будет отображаться на экране\nи мешать Вам.")

					if uv0.Checkbox(uv2("AutoBenz"), uv4.autobenz) then
						cfg.config.autobenz = uv4.autobenz[0]

						uv7.save(cfg, "FBIhelper")
					end

					uv0.Tootlip("Автоматическая заправка транспорта")
					uv0.NextColumn()

					if uv0.Checkbox(uv2("Скрывать в чате /ad"), uv4.CheckBox8) then
						cfg.config.CheckBox8 = uv4.CheckBox8[0]

						uv7.save(cfg, "FBIhelper")
					end

					uv0.Tootlip("Если данный параметр включён, то объявления\n/ad больше не отображаются в Вашем чате и не мешают игре")

					if uv0.Checkbox(uv2("Скрывать в чате [G]"), uv4.CheckBox10) then
						cfg.config.CheckBox10 = uv4.CheckBox10[0]

						uv7.save(cfg, "FBIhelper")
					end

					uv0.Tootlip([[
Если данный параметр включён, то волна спец. рации
[G] будет отключена и не будет Вам мешать

!У некоторых пользователей данная функция
предоставлет кучу ошибок, в том числе пропадание
текста, отправляемого самим игроком!]])

					if uv0.Checkbox(uv2("Скрывать в чате [P]"), uv4.CheckBox11) then
						cfg.config.CheckBox11 = uv4.CheckBox11[0]

						uv7.save(cfg, "FBIhelper")
					end

					uv0.Tootlip("Если данный параметр включён, то волна партии\n[P] будет отключена и не будет Вам мешать")

					if uv0.Checkbox(uv2("Скрывать в чате [F]"), uv4.CheckBox9) then
						cfg.config.CheckBox9 = uv4.CheckBox9[0]

						uv7.save(cfg, "FBIhelper")
					end

					uv0.Tootlip([[
Если данный параметр включён, то общая волна
рации [F] будет отключена и не будет Вам мешать

!У некоторых пользователей данная функция
предоставлет кучу ошибок, в том числе пропадание
текста, отправляемого самим игроком!]])
					uv0.NextColumn()

					if uv0.Checkbox(uv2("Режим рабочего"), uv4.CheckBox20) then
						cfg.config.CheckBox20 = uv4.CheckBox20[0]

						uv7.save(cfg, "FBIhelper")
					end

					uv0.Tootlip([[
Если данный параметр включён, то сообщения в /f будут
переключаться автоматически на канал организации без
предоставления выбора отправки сообщений.
Окошко /find будет автоматически выбирать организацию.
Рация [F] работы будет скрыта, доступна только организации.]])

					if uv0.Checkbox(uv2("Auto /ad"), uv4.CheckBox29) then
						cfg.config.CheckBox29 = uv4.CheckBox29[0]

						uv7.save(cfg, "FBIhelper")
					end

					uv0.Tootlip("Если данный параметр включён, то отправленные\nвами объявления /ad будут автоматически повторяться\nдо отключения данного параметра")
					uv0.SameLine()
					uv0.Text("  ")
					uv0.SameLine()

					if uv0.Checkbox(uv2("/up"), uv4.smiup) then
						cfg.config.smiup = uv4.smiup[0]

						uv7.save(cfg, "FBIhelper")
					end

					uv0.Tootlip("Если данный параметр включён, то отправленные\nвами объявления /ad будут автоматически подниматься в очереди")

					if uv0.Checkbox(uv2("ExtraMessage"), uv4.CheckBox6) then
						cfg.config.CheckBox6 = uv4.CheckBox6[0]

						uv7.save(cfg, "FBIhelper")
					end

					uv0.Tootlip([[
Автоматический перенос слишком длинного текста на вторую строку.
Если у вас имеется подобный скрипт отдельно, то рекомендуется отключить.

Отключение или включение требует перезагрузки скрипта.]])
					uv0.EndChild()
				end

				uv0.Text(uv2("AutoLogin:"))
				uv0.SameLine()

				if uv0.InputText(uv2("##psw"), uv8.password, uv9(uv8.password)) then
					cfg.config.password = uv2:decode(uv10(uv8.password))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Tootlip("Автоматическая авторизация, используйте на свой страх и риск.\n!Не передавайте данные с настройками другим пользователям, не убедившись\nв отсутствии в них вашего пароля.")
				uv0.SameLine()

				if uv0.Checkbox(uv2("##pwr"), uv4.pw) then
					cfg.config.pw = uv4.pw[0]

					uv7.save(cfg, "FBIhelper")
				end

				uv0.SetCursorPos(uv0.ImVec2(170, 230))

				if uv0.BeginChild("##spesw", uv0.ImVec2(630, 230), true) then
					if uv0.Checkbox(uv2("##FW"), uv4.CheckBox4) then
						cfg.config.CheckBox4 = uv4.CheckBox4[0]

						uv7.save(cfg, "FBIhelper")
					end

					uv0.Tootlip("Автоматический сбор аммуниции на складе ФБР.\nЕсли на человеке есть бронежилет, то не собирает.\n")
					uv0.SameLine()

					if uv0.Button(uv2("FastWeapon"), uv0.ImVec2(110, 24)) then
						uv0.OpenPopup(uv2("FastWeapon"))
					end

					uv0.Tootlip("Выбор оружия для FastWeapon")
					uv0.SameLine()

					if uv0.Button(uv2("Переместить виджет"), uv0.ImVec2(150, 24)) then
						uv11 = true
					end

					if uv0.BeginPopupModal(uv2("FastWeapon"), nil, uv0.WindowFlags.NoMove + uv0.WindowFlags.NoResize + uv0.WindowFlags.NoCollapse) then
						if uv0.Checkbox(uv2("Щит"), uv4.Gunbox1) then
							cfg.config.Gunbox1 = uv4.Gunbox1[0]

							uv7.save(cfg, "FBIhelper")
						end

						if uv0.Checkbox(uv2("Дубинка"), uv4.Gunbox2) then
							cfg.config.Gunbox2 = uv4.Gunbox2[0]

							uv7.save(cfg, "FBIhelper")
						end

						if uv0.Checkbox(uv2("Desert Eagle"), uv4.Gunbox3) then
							cfg.config.Gunbox3 = uv4.Gunbox3[0]

							uv7.save(cfg, "FBIhelper")
						end

						if uv0.Checkbox(uv2("MP5"), uv4.Gunbox4) then
							cfg.config.Gunbox4 = uv4.Gunbox4[0]

							uv7.save(cfg, "FBIhelper")
						end

						if uv0.Checkbox(uv2("M4"), uv4.Gunbox5) then
							cfg.config.Gunbox5 = uv4.Gunbox5[0]

							uv7.save(cfg, "FBIhelper")
						end

						if uv0.Checkbox(uv2("Дробовик"), uv4.Gunbox6) then
							cfg.config.Gunbox6 = uv4.Gunbox6[0]

							uv7.save(cfg, "FBIhelper")
						end

						if uv0.Checkbox(uv2("Дымовые шашки"), uv4.Gunbox7) then
							cfg.config.Gunbox7 = uv4.Gunbox7[0]

							uv7.save(cfg, "FBIhelper")
						end

						if uv0.Checkbox(uv2("Снайперская винтовка"), uv4.Gunbox8) then
							cfg.config.Gunbox8 = uv4.Gunbox8[0]

							uv7.save(cfg, "FBIhelper")
						end

						if uv0.Checkbox(uv2("АК-47"), uv4.Gunbox9) then
							cfg.config.Gunbox9 = uv4.Gunbox9[0]

							uv7.save(cfg, "FBIhelper")
						end

						if uv0.Button(uv2("Сохранить"), uv0.ImVec2(200, 20)) then
							uv0.CloseCurrentPopup()
						end

						uv0.EndPopup()
					end

					if uv0.Checkbox(uv2("AutoReset"), uv4.CheckBox5) then
						cfg.config.CheckBox5 = uv4.CheckBox5[0]

						uv7.save(cfg, "FBIhelper")
					end

					uv0.Tootlip("Автоматическое /reset после надевания маски")

					if uv0.Checkbox(uv2("FB and FIX"), uv4.fbfix) then
						cfg.config.fbfix = uv4.fbfix[0]

						uv7.save(cfg, "FBIhelper")
					end

					uv0.Tootlip("Если данный параметр включён, то в меню на колёсико\nмыши появятся кнопки FB и FIX для использования\nбыстрого запуска и починки транспорта")

					if uv0.Checkbox(uv2("Круиз контроль"), uv4.CheckBox18) then
						cfg.config.CheckBox18 = uv4.CheckBox18[0]

						uv7.save(cfg, "FBIhelper")
					end

					uv0.Tootlip([[
Если данный параметр включён, то круиз контроль будет активирован
при входе и автоматически сохранять заданную Вами скорость через W,
а нажав S, можно будет сбросить скорость полностью.

Нажатие " = " отключит круиз и не даст сохранять скорость на W.]])
					uv0.EndChild()
				end

				uv0.PopStyleColor(1)
			elseif uv6 == 2 then
				uv0.Text(uv2("Имя"))

				if uv0.InputText(uv2("##1"), uv8.name, uv9(uv8.name)) then
					cfg.config.name = uv2:decode(uv10(uv8.name))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Организация"))

				if uv0.InputText(uv2("##2"), uv8.org, uv9(uv8.org)) then
					cfg.config.org = uv2:decode(uv10(uv8.org))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Управление"))

				if uv0.InputText(uv2("##3"), uv8.management, uv9(uv8.management)) then
					cfg.config.management = uv2:decode(uv10(uv8.management))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Должность"))

				if uv0.InputText(uv2("##4"), uv8.rang, uv9(uv8.rang)) then
					cfg.config.rang = uv2:decode(uv10(uv8.rang))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Тег на волну своего подразделения (/r)"))

				if uv0.InputText(uv2("##6"), uv8.rtag, uv9(uv8.rtag)) then
					cfg.config.rtag = uv2:decode(uv10(uv8.rtag))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Тег на общую волну организации (/f)"))

				if uv0.InputText(uv2("##7"), uv8.ftag, uv9(uv8.ftag)) then
					cfg.config.ftag = uv2:decode(uv10(uv8.ftag))

					uv7.save(cfg, "FBIhelper")
				end
			end
		end

		if uv5[2] then
			if uv0.CollapsingHeader(uv2("Новый биндер (на клавиши)")) then
				if uv0.BeginChild("##inf", uv0.ImVec2(700, 460), true) then
					uv0.TextWrapped(uv2("Биндер предоставляет возможность создавать свои отыгровки на необходимые клавиши с использованием различных тегов на усмотрение пользователя. Минусом данного биндера на данный момент является отсутствие возможности забиндить отыгровки на команду и дальнейший их вывод в меню на колёсико мыши, которое в процессе добавления данного биндера и перехода на новые системы mimgui было вырезано."))
				end

				uv0.Columns(1)

				if uv0.Button(uv2("Новый бинд##newBind"), uv0.ImVec2(uv0.GetWindowSize().x - 20, 30)) then
					uv0.OpenPopup(uv2("Новый бинд"))
				end

				for slot12, slot13 in ipairs(uv12) do
					uv0.Columns(4, uv2("##BIND_" .. slot12), true)
					uv0.Text(uv2("Имя: ") .. uv2(slot13.name or "unknown"))
					uv0.NextColumn()
					uv0.Text(uv2("Задержка: ") .. uv2(tostring(slot13.wait or "-1")))
					uv0.NextColumn()
					uv0.Text(uv2("Сочетание: ") .. getKeysName(slot13.button))
					uv0.NextColumn()

					if uv0.Button(uv2("Удалить##delete_" .. slot12)) then
						table.remove(uv12, slot12)
						uv12()
					end

					uv0.SameLine()

					if uv0.Button(uv2("Изменить##edit_" .. slot12)) then
						uv13 = {
							name = uv14.char[256](uv2(slot13.name)),
							text = uv14.char[10000](uv2(slot13.text)),
							wait = uv14.int(slot13.wait),
							id = slot12
						}
						HOTKEY.List.editButton = {
							keys = slot13.button[1],
							callback = function ()
							end
						}

						uv0.OpenPopup(uv2("Изменить бинд"))
					end

					uv0.Columns(1)
				end

				if uv0.BeginPopupModal(uv2("Новый бинд"), nil, uv0.WindowFlags.NoMove + uv0.WindowFlags.NoResize + uv0.WindowFlags.NoCollapse) then
					uv0.PushItemWidth(400)
					uv0.InputTextWithHint("##newName", uv2("Название.."), uv15.name, 256)
					uv0.PopItemWidth()
					uv0.Text(uv2("Текст:"))
					uv0.InputTextMultiline("##newText", uv15.text, 10000, uv0.ImVec2(400, 200))
					uv0.Tootlip(tagsInfo)
					uv0.PushItemWidth(200)
					uv0.SliderInt(uv2("##задержка1"), uv15.wait, 0, 30000)
					uv0.PopItemWidth()
					uv0.SameLine()
					uv0.SameLine()
					HOTKEY.KeyEditor("newButton", "Button")

					if uv0.Button(uv2("Создать"), uv0.ImVec2(200, 25)) then
						if #uv2:decode(uv16.string(uv15.name)) > 0 and #uv2:decode(uv16.string(uv15.text)) > 0 then
							table.insert(uv12, {
								name = uv2:decode(uv16.string(uv15.name)),
								text = uv2:decode(uv16.string(uv15.text)),
								wait = uv15.wait[0],
								button = HOTKEY.GetHotkeyKeys("newButton")
							})
							uv12()
							uv0.CloseCurrentPopup()
						else
							sampAddChatMessage("Поля пустые", -1)
						end
					end

					uv0.SameLine()

					if uv0.Button(uv2("Отмена"), uv0.ImVec2(200, 25)) then
						uv0.CloseCurrentPopup()

						uv15 = {
							name = uv14.char[256](),
							text = uv14.char[10000](),
							wait = uv14.int(1200)
						}
					end

					uv0.EndPopup()
				end

				if uv0.BeginPopupModal(uv2("Изменить бинд"), nil, uv0.WindowFlags.NoMove + uv0.WindowFlags.NoResize + uv0.WindowFlags.NoCollapse) then
					uv0.PushItemWidth(400)
					uv0.InputTextWithHint("##editName", uv2("Название.."), uv13.name, 256)
					uv0.PopItemWidth()
					uv0.Text(uv2("Текст:"))
					uv0.InputTextMultiline("##editText", uv13.text, 10000, uv0.ImVec2(400, 200))
					uv0.Tootlip(tagsInfo)
					uv0.PushItemWidth(200)
					uv0.SliderInt(uv2("##задержка"), uv13.wait, 0, 30000)
					uv0.PopItemWidth()
					uv0.SameLine()
					uv0.SameLine()
					HOTKEY.KeyEditor("editButton", "Button")

					if uv0.Button(uv2("Изменить"), uv0.ImVec2(200, 25)) then
						if #uv2:decode(uv16.string(uv13.name)) > 0 and #uv2:decode(uv16.string(uv13.text)) > 0 then
							uv12[uv13.id] = {
								name = uv2:decode(uv16.string(uv13.name)),
								text = uv2:decode(uv16.string(uv13.text)),
								wait = uv13.wait[0],
								button = HOTKEY.GetHotkeyKeys("editButton")
							}

							uv12()
							uv0.CloseCurrentPopup()
						else
							sampAddChatMessage("Поля пустые", -1)
						end
					end

					uv0.SameLine()

					if uv0.Button(uv2("Отмена"), uv0.ImVec2(200, 25)) then
						uv0.CloseCurrentPopup()

						uv13 = {
							id = -1,
							name = uv14.char[256](),
							text = uv14.char[10000](),
							wait = uv14.int(1200)
						}
					end

					uv0.EndPopup()
				end
			end

			if uv0.CollapsingHeader(uv2("Команда: /") .. cfg.config.txt1 .. "") then
				uv0.Text(uv2("После регистрации новой команды перезагрузите скрипт CTRL+R!"))
				uv0.SameLine()
				uv0.Text(uv2("     "))
				uv0.SameLine()

				if uv0.Checkbox(uv2("Отображать в меню"), uv4.CheckTxt1) then
					cfg.config.CheckTxt1 = uv4.CheckTxt1[0]

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Tootlip("Если данный параметр включён, то команда с\nбиндером отобразится в меню на колёсико мыши")
				uv0.Text(uv2("Команда:"))
				uv0.PushItemWidth(150)
				uv0.InputText(uv2("##cmd1"), uv8.txt1, uv9(uv8.txt1))
				uv0.Tootlip([[
Введите несуществующую команду (без слеша "/")
В случае использования команды на колёсико мыши, 
рекомендуется создавать короткое название для бинда,
чтобы минимизировать размер кнопки на колёсико мыши]])
				uv0.SameLine()

				if uv0.Button(uv2("Создать"), uv0.ImVec2(100, 25)) then
					cfg.config.txt1 = uv2:decode(uv10(uv8.txt1))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Задержка:"))
				uv0.InputText(uv2("##delay1"), uv8.delay1, uv9(uv8.delay1))

				cfg.config.delay1 = uv2:decode(uv10(uv8.delay1))

				uv7.save(cfg, "FBIhelper")
				uv0.PopItemWidth()
				uv0.InputTextMultiline(uv2("##bind1"), uv8.txt1o1, uv9(uv8.txt1o1), uv0.ImVec2(680, 300))
				uv0.Tootlip(tagsInfo)

				slot12 = uv8.txt1o1
				text = uv2:decode(uv16.string(slot12))
				cfg.txt1 = {}

				for slot12 in text:gmatch("[^\r\n]+") do
					table.insert(cfg.txt1, slot12)
				end

				uv7.save(cfg, "FBIhelper")
			end

			if uv0.CollapsingHeader(uv2("Команда: /") .. cfg.config.txt2 .. "") then
				uv0.Text(uv2("После регистрации новой команды перезагрузите скрипт CTRL+R!"))
				uv0.SameLine()
				uv0.Text(uv2("     "))
				uv0.SameLine()

				if uv0.Checkbox(uv2("Отображать в меню"), uv4.CheckTxt2) then
					cfg.config.CheckTxt2 = uv4.CheckTxt2[0]

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Tootlip("Если данный параметр включён, то команда с\nбиндером отобразится в меню на колёсико мыши")
				uv0.Text(uv2("Команда:"))
				uv0.PushItemWidth(150)
				uv0.InputText(uv2("##cmd2"), uv8.txt2, uv9(uv8.txt2))
				uv0.Tootlip([[
Введите несуществующую команду (без слеша "/")
В случае использования команды на колёсико мыши, 
рекомендуется создавать короткое название для бинда,
чтобы минимизировать размер кнопки на колёсико мыши]])
				uv0.SameLine()

				if uv0.Button(uv2("Создать"), uv0.ImVec2(100, 25)) then
					cfg.config.txt2 = uv2:decode(uv10(uv8.txt2))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Задержка:"))
				uv0.InputText(uv2("##delay2"), uv8.delay2, uv9(uv8.delay2))

				cfg.config.delay2 = uv2:decode(uv10(uv8.delay2))

				uv7.save(cfg, "FBIhelper")
				uv0.PopItemWidth()
				uv0.InputTextMultiline(uv2("##bind2"), uv8.txt2o1, uv9(uv8.txt2o1), uv0.ImVec2(680, 300))
				uv0.Tootlip(tagsInfo)

				slot12 = uv8.txt2o1
				text = uv2:decode(uv16.string(slot12))
				cfg.txt2 = {}

				for slot12 in text:gmatch("[^\r\n]+") do
					table.insert(cfg.txt2, slot12)
				end

				uv7.save(cfg, "FBIhelper")
			end

			if uv0.CollapsingHeader(uv2("Команда: /") .. cfg.config.txt3 .. "") then
				uv0.Text(uv2("После регистрации новой команды перезагрузите скрипт CTRL+R!"))
				uv0.SameLine()
				uv0.Text(uv2("     "))
				uv0.SameLine()

				if uv0.Checkbox(uv2("Отображать в меню"), uv4.CheckTxt3) then
					cfg.config.CheckTxt3 = uv4.CheckTxt3[0]

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Tootlip("Если данный параметр включён, то команда с\nбиндером отобразится в меню на колёсико мыши")
				uv0.Text(uv2("Команда:"))
				uv0.PushItemWidth(150)
				uv0.InputText(uv2("##cmd3"), uv8.txt3, uv9(uv8.txt3))
				uv0.Tootlip([[
Введите несуществующую команду (без слеша "/")
В случае использования команды на колёсико мыши, 
рекомендуется создавать короткое название для бинда,
чтобы минимизировать размер кнопки на колёсико мыши]])
				uv0.SameLine()

				if uv0.Button(uv2("Создать"), uv0.ImVec2(100, 25)) then
					cfg.config.txt3 = uv2:decode(uv10(uv8.txt3))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Задержка:"))
				uv0.InputText(uv2("##delay3"), uv8.delay3, uv9(uv8.delay3))

				cfg.config.delay3 = uv2:decode(uv10(uv8.delay3))

				uv7.save(cfg, "FBIhelper")
				uv0.PopItemWidth()
				uv0.InputTextMultiline(uv2("##bind3"), uv8.txt3o1, uv9(uv8.txt3o1), uv0.ImVec2(680, 300))
				uv0.Tootlip(tagsInfo)

				slot12 = uv8.txt3o1
				text = uv2:decode(uv16.string(slot12))
				cfg.txt3 = {}

				for slot12 in text:gmatch("[^\r\n]+") do
					table.insert(cfg.txt3, slot12)
				end

				uv7.save(cfg, "FBIhelper")
			end

			if uv0.CollapsingHeader(uv2("Команда: /") .. cfg.config.txt4 .. "") then
				uv0.Text(uv2("После регистрации новой команды перезагрузите скрипт CTRL+R!"))
				uv0.SameLine()
				uv0.Text(uv2("     "))
				uv0.SameLine()

				if uv0.Checkbox(uv2("Отображать в меню"), uv4.CheckTxt4) then
					cfg.config.CheckTxt4 = uv4.CheckTxt4[0]

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Tootlip("Если данный параметр включён, то команда с\nбиндером отобразится в меню на колёсико мыши")
				uv0.Text(uv2("Команда:"))
				uv0.PushItemWidth(150)
				uv0.InputText(uv2("##cmd4"), uv8.txt4, uv9(uv8.txt4))
				uv0.Tootlip([[
Введите несуществующую команду (без слеша "/")
В случае использования команды на колёсико мыши, 
рекомендуется создавать короткое название для бинда,
чтобы минимизировать размер кнопки на колёсико мыши]])
				uv0.SameLine()

				if uv0.Button(uv2("Создать"), uv0.ImVec2(100, 25)) then
					cfg.config.txt4 = uv2:decode(uv10(uv8.txt4))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Задержка:"))
				uv0.InputText(uv2("##delay4"), uv8.delay4, uv9(uv8.delay4))

				cfg.config.delay4 = uv2:decode(uv10(uv8.delay4))

				uv7.save(cfg, "FBIhelper")
				uv0.PopItemWidth()
				uv0.InputTextMultiline(uv2("##bind4"), uv8.txt4o1, uv9(uv8.txt4o1), uv0.ImVec2(680, 300))
				uv0.Tootlip(tagsInfo)

				slot12 = uv8.txt4o1
				text = uv2:decode(uv16.string(slot12))
				cfg.txt4 = {}

				for slot12 in text:gmatch("[^\r\n]+") do
					table.insert(cfg.txt4, slot12)
				end

				uv7.save(cfg, "FBIhelper")
			end

			if uv0.CollapsingHeader(uv2("Команда: /") .. cfg.config.txt5 .. "") then
				uv0.Text(uv2("После регистрации новой команды перезагрузите скрипт CTRL+R!"))
				uv0.SameLine()
				uv0.Text(uv2("     "))
				uv0.SameLine()

				if uv0.Checkbox(uv2("Отображать в меню"), uv4.CheckTxt5) then
					cfg.config.CheckTxt5 = uv4.CheckTxt5[0]

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Tootlip("Если данный параметр включён, то команда с\nбиндером отобразится в меню на колёсико мыши")
				uv0.Text(uv2("Команда:"))
				uv0.PushItemWidth(150)
				uv0.InputText(uv2("##cmd5"), uv8.txt5, uv9(uv8.txt5))
				uv0.Tootlip([[
Введите несуществующую команду (без слеша "/")
В случае использования команды на колёсико мыши, 
рекомендуется создавать короткое название для бинда,
чтобы минимизировать размер кнопки на колёсико мыши]])
				uv0.SameLine()

				if uv0.Button(uv2("Создать"), uv0.ImVec2(100, 25)) then
					cfg.config.txt5 = uv2:decode(uv10(uv8.txt5))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Задержка:"))
				uv0.InputText(uv2("##delay5"), uv8.delay5, uv9(uv8.delay5))

				cfg.config.delay5 = uv2:decode(uv10(uv8.delay5))

				uv7.save(cfg, "FBIhelper")
				uv0.PopItemWidth()
				uv0.InputTextMultiline(uv2("##bind5"), uv8.txt5o1, uv9(uv8.txt5o1), uv0.ImVec2(680, 300))
				uv0.Tootlip(tagsInfo)

				slot12 = uv8.txt5o1
				text = uv2:decode(uv16.string(slot12))
				cfg.txt5 = {}

				for slot12 in text:gmatch("[^\r\n]+") do
					table.insert(cfg.txt5, slot12)
				end

				uv7.save(cfg, "FBIhelper")
			end

			if uv0.CollapsingHeader(uv2("Команда: /") .. cfg.config.txt6 .. "") then
				uv0.Text(uv2("После регистрации новой команды перезагрузите скрипт CTRL+R!"))
				uv0.SameLine()
				uv0.Text(uv2("     "))
				uv0.SameLine()

				if uv0.Checkbox(uv2("Отображать в меню"), uv4.CheckTxt6) then
					cfg.config.CheckTxt6 = uv4.CheckTxt6[0]

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Tootlip("Если данный параметр включён, то команда с\nбиндером отобразится в меню на колёсико мыши")
				uv0.Text(uv2("Команда:"))
				uv0.PushItemWidth(150)
				uv0.InputText(uv2("##cmd6"), uv8.txt6, uv9(uv8.txt6))
				uv0.Tootlip([[
Введите несуществующую команду (без слеша "/")
В случае использования команды на колёсико мыши, 
рекомендуется создавать короткое название для бинда,
чтобы минимизировать размер кнопки на колёсико мыши]])
				uv0.SameLine()

				if uv0.Button(uv2("Создать"), uv0.ImVec2(100, 25)) then
					cfg.config.txt6 = uv2:decode(uv10(uv8.txt6))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Задержка:"))
				uv0.InputText(uv2("##delay6"), uv8.delay6, uv9(uv8.delay6))

				cfg.config.delay6 = uv2:decode(uv10(uv8.delay6))

				uv7.save(cfg, "FBIhelper")
				uv0.PopItemWidth()
				uv0.InputTextMultiline(uv2("##bind6"), uv8.txt6o1, uv9(uv8.txt6o1), uv0.ImVec2(680, 300))
				uv0.Tootlip(tagsInfo)

				slot12 = uv8.txt6o1
				text = uv2:decode(uv16.string(slot12))
				cfg.txt6 = {}

				for slot12 in text:gmatch("[^\r\n]+") do
					table.insert(cfg.txt6, slot12)
				end

				uv7.save(cfg, "FBIhelper")
			end

			if uv0.CollapsingHeader(uv2("Команда: /") .. cfg.config.txt7 .. "") then
				uv0.Text(uv2("После регистрации новой команды перезагрузите скрипт CTRL+R!"))
				uv0.SameLine()
				uv0.Text(uv2("     "))
				uv0.SameLine()

				if uv0.Checkbox(uv2("Отображать в меню"), uv4.CheckTxt7) then
					cfg.config.CheckTxt7 = uv4.CheckTxt7[0]

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Tootlip("Если данный параметр включён, то команда с\nбиндером отобразится в меню на колёсико мыши")
				uv0.Text(uv2("Команда:"))
				uv0.PushItemWidth(150)
				uv0.InputText(uv2("##cmd7"), uv8.txt7, uv9(uv8.txt7))
				uv0.Tootlip([[
Введите несуществующую команду (без слеша "/")
В случае использования команды на колёсико мыши, 
рекомендуется создавать короткое название для бинда,
чтобы минимизировать размер кнопки на колёсико мыши]])
				uv0.SameLine()

				if uv0.Button(uv2("Создать"), uv0.ImVec2(100, 25)) then
					cfg.config.txt7 = uv2:decode(uv10(uv8.txt7))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Задержка:"))
				uv0.InputText(uv2("##delay7"), uv8.delay7, uv9(uv8.delay7))

				cfg.config.delay7 = uv2:decode(uv10(uv8.delay7))

				uv7.save(cfg, "FBIhelper")
				uv0.PopItemWidth()
				uv0.InputTextMultiline(uv2("##bind7"), uv8.txt7o1, uv9(uv8.txt7o1), uv0.ImVec2(680, 300))
				uv0.Tootlip(tagsInfo)

				slot12 = uv8.txt7o1
				text = uv2:decode(uv16.string(slot12))
				cfg.txt7 = {}

				for slot12 in text:gmatch("[^\r\n]+") do
					table.insert(cfg.txt7, slot12)
				end

				uv7.save(cfg, "FBIhelper")
			end

			if uv0.CollapsingHeader(uv2("Команда: /") .. cfg.config.txt8 .. "") then
				uv0.Text(uv2("После регистрации новой команды перезагрузите скрипт CTRL+R!"))
				uv0.SameLine()
				uv0.Text(uv2("     "))
				uv0.SameLine()

				if uv0.Checkbox(uv2("Отображать в меню"), uv4.CheckTxt8) then
					cfg.config.CheckTxt8 = uv4.CheckTxt8[0]

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Tootlip("Если данный параметр включён, то команда с\nбиндером отобразится в меню на колёсико мыши")
				uv0.Text(uv2("Команда:"))
				uv0.PushItemWidth(150)
				uv0.InputText(uv2("##cmd8"), uv8.txt8, uv9(uv8.txt8))
				uv0.Tootlip([[
Введите несуществующую команду (без слеша "/")
В случае использования команды на колёсико мыши, 
рекомендуется создавать короткое название для бинда,
чтобы минимизировать размер кнопки на колёсико мыши]])
				uv0.SameLine()

				if uv0.Button(uv2("Создать"), uv0.ImVec2(100, 25)) then
					cfg.config.txt8 = uv2:decode(uv10(uv8.txt8))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Задержка:"))
				uv0.InputText(uv2("##delay8"), uv8.delay8, uv9(uv8.delay8))

				cfg.config.delay8 = uv2:decode(uv10(uv8.delay8))

				uv7.save(cfg, "FBIhelper")
				uv0.PopItemWidth()
				uv0.InputTextMultiline(uv2("##bind8"), uv8.txt8o1, uv9(uv8.txt8o1), uv0.ImVec2(680, 300))
				uv0.Tootlip(tagsInfo)

				slot12 = uv8.txt8o1
				text = uv2:decode(uv16.string(slot12))
				cfg.txt8 = {}

				for slot12 in text:gmatch("[^\r\n]+") do
					table.insert(cfg.txt8, slot12)
				end

				uv7.save(cfg, "FBIhelper")
			end

			if uv0.CollapsingHeader(uv2("Команда: /") .. cfg.config.txt9 .. "") then
				uv0.Text(uv2("После регистрации новой команды перезагрузите скрипт CTRL+R!"))
				uv0.SameLine()
				uv0.Text(uv2("     "))
				uv0.SameLine()

				if uv0.Checkbox(uv2("Отображать в меню"), uv4.CheckTxt9) then
					cfg.config.CheckTxt9 = uv4.CheckTxt9[0]

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Tootlip("Если данный параметр включён, то команда с\nбиндером отобразится в меню на колёсико мыши")
				uv0.Text(uv2("Команда:"))
				uv0.PushItemWidth(150)
				uv0.InputText(uv2("##cmd9"), uv8.txt9, uv9(uv8.txt9))
				uv0.Tootlip([[
Введите несуществующую команду (без слеша "/")
В случае использования команды на колёсико мыши, 
рекомендуется создавать короткое название для бинда,
чтобы минимизировать размер кнопки на колёсико мыши]])
				uv0.SameLine()

				if uv0.Button(uv2("Создать"), uv0.ImVec2(100, 25)) then
					cfg.config.txt9 = uv2:decode(uv10(uv8.txt9))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Задержка:"))
				uv0.InputText(uv2("##delay9"), uv8.delay9, uv9(uv8.delay9))

				cfg.config.delay9 = uv2:decode(uv10(uv8.delay9))

				uv7.save(cfg, "FBIhelper")
				uv0.PopItemWidth()
				uv0.InputTextMultiline(uv2("##bind9"), uv8.txt9o1, uv9(uv8.txt9o1), uv0.ImVec2(680, 300))
				uv0.Tootlip(tagsInfo)

				slot12 = uv8.txt9o1
				text = uv2:decode(uv16.string(slot12))
				cfg.txt9 = {}

				for slot12 in text:gmatch("[^\r\n]+") do
					table.insert(cfg.txt9, slot12)
				end

				uv7.save(cfg, "FBIhelper")
			end

			if uv0.CollapsingHeader(uv2("Команда: /") .. cfg.config.txt10 .. "") then
				uv0.Text(uv2("После регистрации новой команды перезагрузите скрипт CTRL+R!"))
				uv0.SameLine()
				uv0.Text(uv2("     "))
				uv0.SameLine()

				if uv0.Checkbox(uv2("Отображать в меню"), uv4.CheckTxt10) then
					cfg.config.CheckTxt10 = uv4.CheckTxt10[0]

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Tootlip("Если данный параметр включён, то команда с\nбиндером отобразится в меню на колёсико мыши")
				uv0.Text(uv2("Команда:"))
				uv0.PushItemWidth(150)
				uv0.InputText(uv2("##cmd10"), uv8.txt10, uv9(uv8.txt10))
				uv0.Tootlip([[
Введите несуществующую команду (без слеша "/")
В случае использования команды на колёсико мыши, 
рекомендуется создавать короткое название для бинда,
чтобы минимизировать размер кнопки на колёсико мыши]])
				uv0.SameLine()

				if uv0.Button(uv2("Создать"), uv0.ImVec2(100, 25)) then
					cfg.config.txt10 = uv2:decode(uv10(uv8.txt10))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Задержка:"))
				uv0.InputText(uv2("##delay10"), uv8.delay10, uv9(uv8.delay10))

				cfg.config.delay10 = uv2:decode(uv10(uv8.delay10))

				uv7.save(cfg, "FBIhelper")
				uv0.PopItemWidth()
				uv0.InputTextMultiline(uv2("##bind10"), uv8.txt10o1, uv9(uv8.txt10o1), uv0.ImVec2(680, 300))
				uv0.Tootlip(tagsInfo)

				slot12 = uv8.txt10o1
				text = uv2:decode(uv16.string(slot12))
				cfg.txt10 = {}

				for slot12 in text:gmatch("[^\r\n]+") do
					table.insert(cfg.txt10, slot12)
				end

				uv7.save(cfg, "FBIhelper")
			end

			if uv0.CollapsingHeader(uv2("Команда: /") .. cfg.config.txt11 .. "") then
				uv0.Text(uv2("После регистрации новой команды перезагрузите скрипт CTRL+R!"))
				uv0.SameLine()
				uv0.Text(uv2("     "))
				uv0.SameLine()

				if uv0.Checkbox(uv2("Отображать в меню"), uv4.CheckTxt11) then
					cfg.config.CheckTxt11 = uv4.CheckTxt11[0]

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Tootlip("\tЕсли данный параметр включён, то команда с\n\tбиндером отобразится в меню на колёсико мыши")
				uv0.Text(uv2("Команда:"))
				uv0.PushItemWidth(150)
				uv0.InputText(uv2("##cmd11"), uv8.txt11, uv9(uv8.txt11))
				uv0.Tootlip([[
	Введите несуществующую команду (без слеша "/")
	В случае использования команды на колёсико мыши, 
	рекомендуется создавать короткое название для бинда,
	чтобы минимизировать размер кнопки на колёсико мыши]])
				uv0.SameLine()

				if uv0.Button(uv2("Создать"), uv0.ImVec2(100, 25)) then
					cfg.config.txt11 = uv2:decode(uv10(uv8.txt11))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Задержка:"))
				uv0.InputText(uv2("##delay11"), uv8.delay11, uv9(uv8.delay11))

				cfg.config.delay11 = uv2:decode(uv10(uv8.delay11))

				uv7.save(cfg, "FBIhelper")
				uv0.PopItemWidth()
				uv0.InputTextMultiline(uv2("##bind11"), uv8.txt11o1, uv9(uv8.txt11o1), uv0.ImVec2(680, 300))
				uv0.Tootlip(tagsInfo)

				slot12 = uv8.txt11o1
				text = uv2:decode(uv16.string(slot12))
				cfg.txt11 = {}

				for slot12 in text:gmatch("[^\r\n]+") do
					table.insert(cfg.txt11, slot12)
				end

				uv7.save(cfg, "FBIhelper")
			end

			if uv0.CollapsingHeader(uv2("Команда: /") .. cfg.config.txt12 .. "") then
				uv0.Text(uv2("После регистрации новой команды перезагрузите скрипт CTRL+R!"))
				uv0.SameLine()
				uv0.Text(uv2("     "))
				uv0.SameLine()

				if uv0.Checkbox(uv2("Отображать в меню"), uv4.CheckTxt12) then
					cfg.config.CheckTxt12 = uv4.CheckTxt12[0]

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Tootlip("\tЕсли данный параметр включён, то команда с\n\tбиндером отобразится в меню на колёсико мыши")
				uv0.Text(uv2("Команда:"))
				uv0.PushItemWidth(150)
				uv0.InputText(uv2("##cmd12"), uv8.txt12, uv9(uv8.txt12))
				uv0.Tootlip([[
	Введите несуществующую команду (без слеша "/")
	В случае использования команды на колёсико мыши, 
	рекомендуется создавать короткое название для бинда,
	чтобы минимизировать размер кнопки на колёсико мыши]])
				uv0.SameLine()

				if uv0.Button(uv2("Создать"), uv0.ImVec2(100, 25)) then
					cfg.config.txt12 = uv2:decode(uv10(uv8.txt12))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Задержка:"))
				uv0.InputText(uv2("##delay12"), uv8.delay12, uv9(uv8.delay12))

				cfg.config.delay12 = uv2:decode(uv10(uv8.delay12))

				uv7.save(cfg, "FBIhelper")
				uv0.PopItemWidth()
				uv0.InputTextMultiline(uv2("##bind12"), uv8.txt12o1, uv9(uv8.txt12o1), uv0.ImVec2(680, 300))
				uv0.Tootlip(tagsInfo)

				slot12 = uv8.txt12o1
				text = uv2:decode(uv16.string(slot12))
				cfg.txt12 = {}

				for slot12 in text:gmatch("[^\r\n]+") do
					table.insert(cfg.txt12, slot12)
				end

				uv7.save(cfg, "FBIhelper")
			end

			if uv0.CollapsingHeader(uv2("Команда: /") .. cfg.config.txt13 .. "") then
				uv0.Text(uv2("После регистрации новой команды перезагрузите скрипт CTRL+R!"))
				uv0.SameLine()
				uv0.Text(uv2("     "))
				uv0.SameLine()

				if uv0.Checkbox(uv2("Отображать в меню"), uv4.CheckTxt13) then
					cfg.config.CheckTxt13 = uv4.CheckTxt13[0]

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Tootlip("\tЕсли данный параметр включён, то команда с\n\tбиндером отобразится в меню на колёсико мыши")
				uv0.Text(uv2("Команда:"))
				uv0.PushItemWidth(150)
				uv0.InputText(uv2("##cmd13"), uv8.txt13, uv9(uv8.txt13))
				uv0.Tootlip([[
	Введите несуществующую команду (без слеша "/")
	В случае использования команды на колёсико мыши, 
	рекомендуется создавать короткое название для бинда,
	чтобы минимизировать размер кнопки на колёсико мыши]])
				uv0.SameLine()

				if uv0.Button(uv2("Создать"), uv0.ImVec2(100, 25)) then
					cfg.config.txt13 = uv2:decode(uv10(uv8.txt13))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Задержка:"))
				uv0.InputText(uv2("##delay13"), uv8.delay13, uv9(uv8.delay13))

				cfg.config.delay13 = uv2:decode(uv10(uv8.delay13))

				uv7.save(cfg, "FBIhelper")
				uv0.PopItemWidth()
				uv0.InputTextMultiline(uv2("##bind13"), uv8.txt13o1, uv9(uv8.txt13o1), uv0.ImVec2(680, 300))
				uv0.Tootlip(tagsInfo)

				slot12 = uv8.txt13o1
				text = uv2:decode(uv16.string(slot12))
				cfg.txt13 = {}

				for slot12 in text:gmatch("[^\r\n]+") do
					table.insert(cfg.txt13, slot12)
				end

				uv7.save(cfg, "FBIhelper")
			end

			if uv0.CollapsingHeader(uv2("Команда: /") .. cfg.config.txt14 .. "") then
				uv0.Text(uv2("После регистрации новой команды перезагрузите скрипт CTRL+R!"))
				uv0.SameLine()
				uv0.Text(uv2("     "))
				uv0.SameLine()

				if uv0.Checkbox(uv2("Отображать в меню"), uv4.CheckTxt14) then
					cfg.config.CheckTxt14 = uv4.CheckTxt14[0]

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Tootlip("\tЕсли данный параметр включён, то команда с\n\tбиндером отобразится в меню на колёсико мыши")
				uv0.Text(uv2("Команда:"))
				uv0.PushItemWidth(150)
				uv0.InputText(uv2("##cmd14"), uv8.txt14, uv9(uv8.txt14))
				uv0.Tootlip([[
	Введите несуществующую команду (без слеша "/")
	В случае использования команды на колёсико мыши, 
	рекомендуется создавать короткое название для бинда,
	чтобы минимизировать размер кнопки на колёсико мыши]])
				uv0.SameLine()

				if uv0.Button(uv2("Создать"), uv0.ImVec2(100, 25)) then
					cfg.config.txt14 = uv2:decode(uv10(uv8.txt14))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Задержка:"))
				uv0.InputText(uv2("##delay14"), uv8.delay14, uv9(uv8.delay14))

				cfg.config.delay14 = uv2:decode(uv10(uv8.delay14))

				uv7.save(cfg, "FBIhelper")
				uv0.PopItemWidth()
				uv0.InputTextMultiline(uv2("##bind4"), uv8.txt14o1, uv9(uv8.txt14o1), uv0.ImVec2(680, 300))
				uv0.Tootlip(tagsInfo)

				slot12 = uv8.txt14o1
				text = uv2:decode(uv16.string(slot12))
				cfg.txt14 = {}

				for slot12 in text:gmatch("[^\r\n]+") do
					table.insert(cfg.txt14, slot12)
				end

				uv7.save(cfg, "FBIhelper")
			end

			if uv0.CollapsingHeader(uv2("Команда: /") .. cfg.config.txt15 .. "") then
				uv0.Text(uv2("После регистрации новой команды перезагрузите скрипт CTRL+R!"))
				uv0.SameLine()
				uv0.Text(uv2("     "))
				uv0.SameLine()

				if uv0.Checkbox(uv2("Отображать в меню"), uv4.CheckTxt15) then
					cfg.config.CheckTxt15 = uv4.CheckTxt15[0]

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Tootlip("\tЕсли данный параметр включён, то команда с\n\tбиндером отобразится в меню на колёсико мыши")
				uv0.Text(uv2("Команда:"))
				uv0.PushItemWidth(150)
				uv0.InputText(uv2("##cmd15"), uv8.txt15, uv9(uv8.txt15))
				uv0.Tootlip([[
	Введите несуществующую команду (без слеша "/")
	В случае использования команды на колёсико мыши, 
	рекомендуется создавать короткое название для бинда,
	чтобы минимизировать размер кнопки на колёсико мыши]])
				uv0.SameLine()

				if uv0.Button(uv2("Создать"), uv0.ImVec2(100, 25)) then
					cfg.config.txt15 = uv2:decode(uv10(uv8.txt15))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Задержка:"))
				uv0.InputText(uv2("##delay15"), uv8.delay15, uv9(uv8.delay15))

				cfg.config.delay15 = uv2:decode(uv10(uv8.delay15))

				uv7.save(cfg, "FBIhelper")
				uv0.PopItemWidth()
				uv0.InputTextMultiline(uv2("##bind15"), uv8.txt15o1, uv9(uv8.txt15o1), uv0.ImVec2(680, 300))
				uv0.Tootlip(tagsInfo)

				slot12 = uv8.txt15o1
				text = uv2:decode(uv16.string(slot12))
				cfg.txt15 = {}

				for slot12 in text:gmatch("[^\r\n]+") do
					table.insert(cfg.txt15, slot12)
				end

				uv7.save(cfg, "FBIhelper")
			end

			if uv0.CollapsingHeader(uv2("Команда: /") .. cfg.config.txt16 .. "") then
				uv0.Text(uv2("После регистрации новой команды перезагрузите скрипт CTRL+R!"))
				uv0.SameLine()
				uv0.Text(uv2("     "))
				uv0.SameLine()

				if uv0.Checkbox(uv2("Отображать в меню"), uv4.CheckTxt16) then
					cfg.config.CheckTxt16 = uv4.CheckTxt16[0]

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Tootlip("\tЕсли данный параметр включён, то команда с\n\tбиндером отобразится в меню на колёсико мыши")
				uv0.Text(uv2("Команда:"))
				uv0.PushItemWidth(150)
				uv0.InputText(uv2("##cmd16"), uv8.txt16, uv9(uv8.txt16))
				uv0.Tootlip([[
	Введите несуществующую команду (без слеша "/")
	В случае использования команды на колёсико мыши, 
	рекомендуется создавать короткое название для бинда,
	чтобы минимизировать размер кнопки на колёсико мыши]])
				uv0.SameLine()

				if uv0.Button(uv2("Создать"), uv0.ImVec2(100, 25)) then
					cfg.config.txt16 = uv2:decode(uv10(uv8.txt16))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Задержка:"))
				uv0.InputText(uv2("##delay16"), uv8.delay16, uv9(uv8.delay16))

				cfg.config.delay16 = uv2:decode(uv10(uv8.delay16))

				uv7.save(cfg, "FBIhelper")
				uv0.PopItemWidth()
				uv0.InputTextMultiline(uv2("##bind16"), uv8.txt16o1, uv9(uv8.txt16o1), uv0.ImVec2(680, 300))
				uv0.Tootlip(tagsInfo)

				slot12 = uv8.txt16o1
				text = uv2:decode(uv16.string(slot12))
				cfg.txt16 = {}

				for slot12 in text:gmatch("[^\r\n]+") do
					table.insert(cfg.txt16, slot12)
				end

				uv7.save(cfg, "FBIhelper")
			end

			if uv0.CollapsingHeader(uv2("Команда: /") .. cfg.config.txt17 .. "") then
				uv0.Text(uv2("После регистрации новой команды перезагрузите скрипт CTRL+R!"))
				uv0.SameLine()
				uv0.Text(uv2("     "))
				uv0.SameLine()

				if uv0.Checkbox(uv2("Отображать в меню"), uv4.CheckTxt17) then
					cfg.config.CheckTxt17 = uv4.CheckTxt17[0]

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Tootlip("\tЕсли данный параметр включён, то команда с\n\tбиндером отобразится в меню на колёсико мыши")
				uv0.Text(uv2("Команда:"))
				uv0.PushItemWidth(150)
				uv0.InputText(uv2("##cmd17"), uv8.txt17, uv9(uv8.txt17))
				uv0.Tootlip([[
	Введите несуществующую команду (без слеша "/")
	В случае использования команды на колёсико мыши, 
	рекомендуется создавать короткое название для бинда,
	чтобы минимизировать размер кнопки на колёсико мыши]])
				uv0.SameLine()

				if uv0.Button(uv2("Создать"), uv0.ImVec2(100, 25)) then
					cfg.config.txt17 = uv2:decode(uv10(uv8.txt17))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Задержка:"))
				uv0.InputText(uv2("##delay17"), uv8.delay17, uv9(uv8.delay17))

				cfg.config.delay17 = uv2:decode(uv10(uv8.delay17))

				uv7.save(cfg, "FBIhelper")
				uv0.PopItemWidth()
				uv0.InputTextMultiline(uv2("##bind17"), uv8.txt17o1, uv9(uv8.txt17o1), uv0.ImVec2(680, 300))
				uv0.Tootlip(tagsInfo)

				slot12 = uv8.txt17o1
				text = uv2:decode(uv16.string(slot12))
				cfg.txt17 = {}

				for slot12 in text:gmatch("[^\r\n]+") do
					table.insert(cfg.txt17, slot12)
				end

				uv7.save(cfg, "FBIhelper")
			end

			if uv0.CollapsingHeader(uv2("Команда: /") .. cfg.config.txt18 .. "") then
				uv0.Text(uv2("После регистрации новой команды перезагрузите скрипт CTRL+R!"))
				uv0.SameLine()
				uv0.Text(uv2("     "))
				uv0.SameLine()

				if uv0.Checkbox(uv2("Отображать в меню"), uv4.CheckTxt18) then
					cfg.config.CheckTxt18 = uv4.CheckTxt18[0]

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Tootlip("\tЕсли данный параметр включён, то команда с\n\tбиндером отобразится в меню на колёсико мыши")
				uv0.Text(uv2("Команда:"))
				uv0.PushItemWidth(150)
				uv0.InputText(uv2("##cmd18"), uv8.txt18, uv9(uv8.txt18))
				uv0.Tootlip([[
	Введите несуществующую команду (без слеша "/")
	В случае использования команды на колёсико мыши, 
	рекомендуется создавать короткое название для бинда,
	чтобы минимизировать размер кнопки на колёсико мыши]])
				uv0.SameLine()

				if uv0.Button(uv2("Создать"), uv0.ImVec2(100, 25)) then
					cfg.config.txt18 = uv2:decode(uv10(uv8.txt18))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Задержка:"))
				uv0.InputText(uv2("##delay18"), uv8.delay18, uv9(uv8.delay18))

				cfg.config.delay18 = uv2:decode(uv10(uv8.delay18))

				uv7.save(cfg, "FBIhelper")
				uv0.PopItemWidth()
				uv0.InputTextMultiline(uv2("##bind18"), uv8.txt18o1, uv9(uv8.txt18o1), uv0.ImVec2(680, 300))
				uv0.Tootlip(tagsInfo)

				slot12 = uv8.txt18o1
				text = uv2:decode(uv16.string(slot12))
				cfg.txt18 = {}

				for slot12 in text:gmatch("[^\r\n]+") do
					table.insert(cfg.txt18, slot12)
				end

				uv7.save(cfg, "FBIhelper")
			end

			if uv0.CollapsingHeader(uv2("Команда: /") .. cfg.config.txt19 .. "") then
				uv0.Text(uv2("После регистрации новой команды перезагрузите скрипт CTRL+R!"))
				uv0.SameLine()
				uv0.Text(uv2("     "))
				uv0.SameLine()

				if uv0.Checkbox(uv2("Отображать в меню"), uv4.CheckTxt19) then
					cfg.config.CheckTxt19 = uv4.CheckTxt19[0]

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Tootlip("\tЕсли данный параметр включён, то команда с\n\tбиндером отобразится в меню на колёсико мыши")
				uv0.Text(uv2("Команда:"))
				uv0.PushItemWidth(150)
				uv0.InputText(uv2("##cmd19"), uv8.txt19, uv9(uv8.txt19))
				uv0.Tootlip([[
	Введите несуществующую команду (без слеша "/")
	В случае использования команды на колёсико мыши, 
	рекомендуется создавать короткое название для бинда,
	чтобы минимизировать размер кнопки на колёсико мыши]])
				uv0.SameLine()

				if uv0.Button(uv2("Создать"), uv0.ImVec2(100, 25)) then
					cfg.config.txt19 = uv2:decode(uv10(uv8.txt19))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Задержка:"))
				uv0.InputText(uv2("##delay19"), uv8.delay19, uv9(uv8.delay19))

				cfg.config.delay19 = uv2:decode(uv10(uv8.delay19))

				uv7.save(cfg, "FBIhelper")
				uv0.PopItemWidth()
				uv0.InputTextMultiline(uv2("##bind19"), uv8.txt19o1, uv9(uv8.txt19o1), uv0.ImVec2(680, 300))
				uv0.Tootlip(tagsInfo)

				slot12 = uv8.txt19o1
				text = uv2:decode(uv16.string(slot12))
				cfg.txt19 = {}

				for slot12 in text:gmatch("[^\r\n]+") do
					table.insert(cfg.txt19, slot12)
				end

				uv7.save(cfg, "FBIhelper")
			end

			if uv0.CollapsingHeader(uv2("Команда: /") .. cfg.config.txt20 .. "") then
				uv0.Text(uv2("После регистрации новой команды перезагрузите скрипт CTRL+R!"))
				uv0.SameLine()
				uv0.Text(uv2("     "))
				uv0.SameLine()

				if uv0.Checkbox(uv2("Отображать в меню"), uv4.CheckTxt20) then
					cfg.config.CheckTxt20 = uv4.CheckTxt20[0]

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Tootlip("\tЕсли данный параметр включён, то команда с\n\tбиндером отобразится в меню на колёсико мыши")
				uv0.Text(uv2("Команда:"))
				uv0.PushItemWidth(150)
				uv0.InputText(uv2("##cmd20"), uv8.txt20, uv9(uv8.txt20))
				uv0.Tootlip([[
	Введите несуществующую команду (без слеша "/")
	В случае использования команды на колёсико мыши, 
	рекомендуется создавать короткое название для бинда,
	чтобы минимизировать размер кнопки на колёсико мыши]])
				uv0.SameLine()

				if uv0.Button(uv2("Создать"), uv0.ImVec2(100, 25)) then
					cfg.config.txt20 = uv2:decode(uv10(uv8.txt20))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Задержка:"))
				uv0.InputText(uv2("##delay20"), uv8.delay20, uv9(uv8.delay20))

				cfg.config.delay20 = uv2:decode(uv10(uv8.delay20))

				uv7.save(cfg, "FBIhelper")
				uv0.PopItemWidth()
				uv0.InputTextMultiline(uv2("##bind20"), uv8.txt20o1, uv9(uv8.txt20o1), uv0.ImVec2(680, 300))
				uv0.Tootlip(tagsInfo)

				slot12 = uv8.txt20o1
				text = uv2:decode(uv16.string(slot12))
				cfg.txt20 = {}

				for slot12 in text:gmatch("[^\r\n]+") do
					table.insert(cfg.txt20, slot12)
				end

				uv7.save(cfg, "FBIhelper")
			end

			if uv0.CollapsingHeader(uv2("Команда: /") .. cfg.config.txt21 .. "") then
				uv0.Text(uv2("После регистрации новой команды перезагрузите скрипт CTRL+R!"))
				uv0.SameLine()
				uv0.Text(uv2("     "))
				uv0.SameLine()

				if uv0.Checkbox(uv2("Отображать в меню"), uv4.CheckTxt21) then
					cfg.config.CheckTxt21 = uv4.CheckTxt21[0]

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Tootlip("\tЕсли данный параметр включён, то команда с\n\tбиндером отобразится в меню на колёсико мыши")
				uv0.Text(uv2("Команда:"))
				uv0.PushItemWidth(150)
				uv0.InputText(uv2("##cmd21"), uv8.txt21, uv9(uv8.txt21))
				uv0.Tootlip([[
	Введите несуществующую команду (без слеша "/")
	В случае использования команды на колёсико мыши, 
	рекомендуется создавать короткое название для бинда,
	чтобы минимизировать размер кнопки на колёсико мыши]])
				uv0.SameLine()

				if uv0.Button(uv2("Создать"), uv0.ImVec2(100, 25)) then
					cfg.config.txt21 = uv2:decode(uv10(uv8.txt21))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Задержка:"))
				uv0.InputText(uv2("##delay21"), uv8.delay21, uv9(uv8.delay21))

				cfg.config.delay21 = uv2:decode(uv10(uv8.delay21))

				uv7.save(cfg, "FBIhelper")
				uv0.PopItemWidth()
				uv0.InputTextMultiline(uv2("##bind21"), uv8.txt21o1, uv9(uv8.txt21o1), uv0.ImVec2(680, 300))
				uv0.Tootlip(tagsInfo)

				slot12 = uv8.txt21o1
				text = uv2:decode(uv16.string(slot12))
				cfg.txt21 = {}

				for slot12 in text:gmatch("[^\r\n]+") do
					table.insert(cfg.txt21, slot12)
				end

				uv7.save(cfg, "FBIhelper")
			end

			if uv0.CollapsingHeader(uv2("Команда: /") .. cfg.config.txt22 .. "") then
				uv0.Text(uv2("После регистрации новой команды перезагрузите скрипт CTRL+R!"))
				uv0.SameLine()
				uv0.Text(uv2("     "))
				uv0.SameLine()

				if uv0.Checkbox(uv2("Отображать в меню"), uv4.CheckTxt22) then
					cfg.config.CheckTxt22 = uv4.CheckTxt22[0]

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Tootlip("\tЕсли данный параметр включён, то команда с\n\tбиндером отобразится в меню на колёсико мыши")
				uv0.Text(uv2("Команда:"))
				uv0.PushItemWidth(150)
				uv0.InputText(uv2("##cmd22"), uv8.txt22, uv9(uv8.txt22))
				uv0.Tootlip([[
	Введите несуществующую команду (без слеша "/")
	В случае использования команды на колёсико мыши, 
	рекомендуется создавать короткое название для бинда,
	чтобы минимизировать размер кнопки на колёсико мыши]])
				uv0.SameLine()

				if uv0.Button(uv2("Создать"), uv0.ImVec2(100, 25)) then
					cfg.config.txt22 = uv2:decode(uv10(uv8.txt22))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Задержка:"))
				uv0.InputText(uv2("##delay22"), uv8.delay22, uv9(uv8.delay22))

				cfg.config.delay22 = uv2:decode(uv10(uv8.delay22))

				uv7.save(cfg, "FBIhelper")
				uv0.PopItemWidth()
				uv0.InputTextMultiline(uv2("##bind22"), uv8.txt22o1, uv9(uv8.txt22o1), uv0.ImVec2(680, 300))
				uv0.Tootlip(tagsInfo)

				slot12 = uv8.txt22o1
				text = uv2:decode(uv16.string(slot12))
				cfg.txt22 = {}

				for slot12 in text:gmatch("[^\r\n]+") do
					table.insert(cfg.txt22, slot12)
				end

				uv7.save(cfg, "FBIhelper")
			end

			if uv0.CollapsingHeader(uv2("Команда: /") .. cfg.config.txt23 .. "") then
				uv0.Text(uv2("После регистрации новой команды перезагрузите скрипт CTRL+R!"))
				uv0.SameLine()
				uv0.Text(uv2("     "))
				uv0.SameLine()

				if uv0.Checkbox(uv2("Отображать в меню"), uv4.CheckTxt23) then
					cfg.config.CheckTxt23 = uv4.CheckTxt23[0]

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Tootlip("\tЕсли данный параметр включён, то команда с\n\tбиндером отобразится в меню на колёсико мыши")
				uv0.Text(uv2("Команда:"))
				uv0.PushItemWidth(150)
				uv0.InputText(uv2("##cmd23"), uv8.txt23, uv9(uv8.txt23))
				uv0.Tootlip([[
	Введите несуществующую команду (без слеша "/")
	В случае использования команды на колёсико мыши, 
	рекомендуется создавать короткое название для бинда,
	чтобы минимизировать размер кнопки на колёсико мыши]])
				uv0.SameLine()

				if uv0.Button(uv2("Создать"), uv0.ImVec2(100, 25)) then
					cfg.config.txt23 = uv2:decode(uv10(uv8.txt23))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Задержка:"))
				uv0.InputText(uv2("##delay23"), uv8.delay23, uv9(uv8.delay23))

				cfg.config.delay3 = uv2:decode(uv10(uv8.delay23))

				uv7.save(cfg, "FBIhelper")
				uv0.PopItemWidth()
				uv0.InputTextMultiline(uv2("##bind23"), uv8.txt23o1, uv9(uv8.txt23o1), uv0.ImVec2(680, 300))
				uv0.Tootlip(tagsInfo)

				slot12 = uv8.txt23o1
				text = uv2:decode(uv16.string(slot12))
				cfg.txt23 = {}

				for slot12 in text:gmatch("[^\r\n]+") do
					table.insert(cfg.txt23, slot12)
				end

				uv7.save(cfg, "FBIhelper")
			end

			if uv0.CollapsingHeader(uv2("Команда: /") .. cfg.config.txt24 .. "") then
				uv0.Text(uv2("После регистрации новой команды перезагрузите скрипт CTRL+R!"))
				uv0.SameLine()
				uv0.Text(uv2("     "))
				uv0.SameLine()

				if uv0.Checkbox(uv2("Отображать в меню"), uv4.CheckTxt24) then
					cfg.config.CheckTxt24 = uv4.CheckTxt24[0]

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Tootlip("\tЕсли данный параметр включён, то команда с\n\tбиндером отобразится в меню на колёсико мыши")
				uv0.Text(uv2("Команда:"))
				uv0.PushItemWidth(150)
				uv0.InputText(uv2("##cmd24"), uv8.txt24, uv9(uv8.txt24))
				uv0.Tootlip([[
	Введите несуществующую команду (без слеша "/")
	В случае использования команды на колёсико мыши, 
	рекомендуется создавать короткое название для бинда,
	чтобы минимизировать размер кнопки на колёсико мыши]])
				uv0.SameLine()

				if uv0.Button(uv2("Создать"), uv0.ImVec2(100, 25)) then
					cfg.config.txt24 = uv2:decode(uv10(uv8.txt24))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Задержка:"))
				uv0.InputText(uv2("##delay24"), uv8.delay24, uv9(uv8.delay24))

				cfg.config.delay24 = uv2:decode(uv10(uv8.delay24))

				uv7.save(cfg, "FBIhelper")
				uv0.PopItemWidth()
				uv0.InputTextMultiline(uv2("##bind24"), uv8.txt24o1, uv9(uv8.txt24o1), uv0.ImVec2(680, 300))
				uv0.Tootlip(tagsInfo)

				slot12 = uv8.txt24o1
				text = uv2:decode(uv16.string(slot12))
				cfg.txt24 = {}

				for slot12 in text:gmatch("[^\r\n]+") do
					table.insert(cfg.txt24, slot12)
				end

				uv7.save(cfg, "FBIhelper")
			end

			if uv0.CollapsingHeader(uv2("Команда: /") .. cfg.config.txt25 .. "") then
				uv0.Text(uv2("После регистрации новой команды перезагрузите скрипт CTRL+R!"))
				uv0.SameLine()
				uv0.Text(uv2("     "))
				uv0.SameLine()

				if uv0.Checkbox(uv2("Отображать в меню"), uv4.CheckTxt25) then
					cfg.config.CheckTxt25 = uv4.CheckTxt25[0]

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Tootlip("\tЕсли данный параметр включён, то команда с\n\tбиндером отобразится в меню на колёсико мыши")
				uv0.Text(uv2("Команда:"))
				uv0.PushItemWidth(150)
				uv0.InputText(uv2("##cmd25"), uv8.txt25, uv9(uv8.txt25))
				uv0.Tootlip([[
	Введите несуществующую команду (без слеша "/")
	В случае использования команды на колёсико мыши, 
	рекомендуется создавать короткое название для бинда,
	чтобы минимизировать размер кнопки на колёсико мыши]])
				uv0.SameLine()

				if uv0.Button(uv2("Создать"), uv0.ImVec2(100, 25)) then
					cfg.config.txt25 = uv2:decode(uv10(uv8.txt25))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Задержка:"))
				uv0.InputText(uv2("##delay25"), uv8.delay25, uv9(uv8.delay25))

				cfg.config.delay25 = uv2:decode(uv10(uv8.delay25))

				uv7.save(cfg, "FBIhelper")
				uv0.PopItemWidth()
				uv0.InputTextMultiline(uv2("##bind25"), uv8.txt25o1, uv9(uv8.txt25o1), uv0.ImVec2(680, 300))
				uv0.Tootlip(tagsInfo)

				slot12 = uv8.txt25o1
				text = uv2:decode(uv16.string(slot12))
				cfg.txt25 = {}

				for slot12 in text:gmatch("[^\r\n]+") do
					table.insert(cfg.txt25, slot12)
				end

				uv7.save(cfg, "FBIhelper")
			end

			if uv0.CollapsingHeader(uv2("Команда: /") .. cfg.config.txt26 .. "") then
				uv0.Text(uv2("После регистрации новой команды перезагрузите скрипт CTRL+R!"))
				uv0.SameLine()
				uv0.Text(uv2("     "))
				uv0.SameLine()

				if uv0.Checkbox(uv2("Отображать в меню"), uv4.CheckTxt26) then
					cfg.config.CheckTxt26 = uv4.CheckTxt26[0]

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Tootlip("\tЕсли данный параметр включён, то команда с\n\tбиндером отобразится в меню на колёсико мыши")
				uv0.Text(uv2("Команда:"))
				uv0.PushItemWidth(150)
				uv0.InputText(uv2("##cmd26"), uv8.txt26, uv9(uv8.txt26))
				uv0.Tootlip([[
	Введите несуществующую команду (без слеша "/")
	В случае использования команды на колёсико мыши, 
	рекомендуется создавать короткое название для бинда,
	чтобы минимизировать размер кнопки на колёсико мыши]])
				uv0.SameLine()

				if uv0.Button(uv2("Создать"), uv0.ImVec2(100, 25)) then
					cfg.config.txt26 = uv2:decode(uv10(uv8.txt26))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Задержка:"))
				uv0.InputText(uv2("##delay26"), uv8.delay26, uv9(uv8.delay26))

				cfg.config.delay26 = uv2:decode(uv10(uv8.delay26))

				uv7.save(cfg, "FBIhelper")
				uv0.PopItemWidth()
				uv0.InputTextMultiline(uv2("##bind26"), uv8.txt26o1, uv9(uv8.txt26o1), uv0.ImVec2(680, 300))
				uv0.Tootlip(tagsInfo)

				slot12 = uv8.txt26o1
				text = uv2:decode(uv16.string(slot12))
				cfg.txt26 = {}

				for slot12 in text:gmatch("[^\r\n]+") do
					table.insert(cfg.txt26, slot12)
				end

				uv7.save(cfg, "FBIhelper")
			end

			if uv0.CollapsingHeader(uv2("Команда: /") .. cfg.config.txt27 .. "") then
				uv0.Text(uv2("После регистрации новой команды перезагрузите скрипт CTRL+R!"))
				uv0.SameLine()
				uv0.Text(uv2("     "))
				uv0.SameLine()

				if uv0.Checkbox(uv2("Отображать в меню"), uv4.CheckTxt27) then
					cfg.config.CheckTxt27 = uv4.CheckTxt27[0]

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Tootlip("\tЕсли данный параметр включён, то команда с\n\tбиндером отобразится в меню на колёсико мыши")
				uv0.Text(uv2("Команда:"))
				uv0.PushItemWidth(150)
				uv0.InputText(uv2("##cmd27"), uv8.txt27, uv9(uv8.txt27))
				uv0.Tootlip([[
	Введите несуществующую команду (без слеша "/")
	В случае использования команды на колёсико мыши, 
	рекомендуется создавать короткое название для бинда,
	чтобы минимизировать размер кнопки на колёсико мыши]])
				uv0.SameLine()

				if uv0.Button(uv2("Создать"), uv0.ImVec2(100, 25)) then
					cfg.config.txt27 = uv2:decode(uv10(uv8.txt27))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Задержка:"))
				uv0.InputText(uv2("##delay27"), uv8.delay27, uv9(uv8.delay27))

				cfg.config.delay27 = uv2:decode(uv10(uv8.delay27))

				uv7.save(cfg, "FBIhelper")
				uv0.PopItemWidth()
				uv0.InputTextMultiline(uv2("##bind27"), uv8.txt27o1, uv9(uv8.txt27o1), uv0.ImVec2(680, 300))
				uv0.Tootlip(tagsInfo)

				slot12 = uv8.txt27o1
				text = uv2:decode(uv16.string(slot12))
				cfg.txt27 = {}

				for slot12 in text:gmatch("[^\r\n]+") do
					table.insert(cfg.txt27, slot12)
				end

				uv7.save(cfg, "FBIhelper")
			end

			if uv0.CollapsingHeader(uv2("Команда: /") .. cfg.config.txt28 .. "") then
				uv0.Text(uv2("После регистрации новой команды перезагрузите скрипт CTRL+R!"))
				uv0.SameLine()
				uv0.Text(uv2("     "))
				uv0.SameLine()

				if uv0.Checkbox(uv2("Отображать в меню"), uv4.CheckTxt28) then
					cfg.config.CheckTxt28 = uv4.CheckTxt28[0]

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Tootlip("\tЕсли данный параметр включён, то команда с\n\tбиндером отобразится в меню на колёсико мыши")
				uv0.Text(uv2("Команда:"))
				uv0.PushItemWidth(150)
				uv0.InputText(uv2("##cmd28"), uv8.txt28, uv9(uv8.txt28))
				uv0.Tootlip([[
	Введите несуществующую команду (без слеша "/")
	В случае использования команды на колёсико мыши, 
	рекомендуется создавать короткое название для бинда,
	чтобы минимизировать размер кнопки на колёсико мыши]])
				uv0.SameLine()

				if uv0.Button(uv2("Создать"), uv0.ImVec2(100, 25)) then
					cfg.config.txt28 = uv2:decode(uv10(uv8.txt28))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Задержка:"))
				uv0.InputText(uv2("##delay28"), uv8.delay28, uv9(uv8.delay28))

				cfg.config.delay28 = uv2:decode(uv10(uv8.delay28))

				uv7.save(cfg, "FBIhelper")
				uv0.PopItemWidth()
				uv0.InputTextMultiline(uv2("##bind28"), uv8.txt28o1, uv9(uv8.txt28o1), uv0.ImVec2(680, 300))
				uv0.Tootlip(tagsInfo)

				slot12 = uv8.txt28o1
				text = uv2:decode(uv16.string(slot12))
				cfg.txt28 = {}

				for slot12 in text:gmatch("[^\r\n]+") do
					table.insert(cfg.txt28, slot12)
				end

				uv7.save(cfg, "FBIhelper")
			end

			if uv0.CollapsingHeader(uv2("Команда: /") .. cfg.config.txt29 .. "") then
				uv0.Text(uv2("После регистрации новой команды перезагрузите скрипт CTRL+R!"))
				uv0.SameLine()
				uv0.Text(uv2("     "))
				uv0.SameLine()

				if uv0.Checkbox(uv2("Отображать в меню"), uv4.CheckTxt29) then
					cfg.config.CheckTxt29 = uv4.CheckTxt29[0]

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Tootlip("\tЕсли данный параметр включён, то команда с\n\tбиндером отобразится в меню на колёсико мыши")
				uv0.Text(uv2("Команда:"))
				uv0.PushItemWidth(150)
				uv0.InputText(uv2("##cmd29"), uv8.txt29, uv9(uv8.txt29))
				uv0.Tootlip([[
	Введите несуществующую команду (без слеша "/")
	В случае использования команды на колёсико мыши, 
	рекомендуется создавать короткое название для бинда,
	чтобы минимизировать размер кнопки на колёсико мыши]])
				uv0.SameLine()

				if uv0.Button(uv2("Создать"), uv0.ImVec2(100, 25)) then
					cfg.config.txt29 = uv2:decode(uv10(uv8.tx2t9))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Задержка:"))
				uv0.InputText(uv2("##delay29"), uv8.delay29, uv9(uv8.delay29))

				cfg.config.delay29 = uv2:decode(uv10(uv8.delay29))

				uv7.save(cfg, "FBIhelper")
				uv0.PopItemWidth()
				uv0.InputTextMultiline(uv2("##bind29"), uv8.txt29o1, uv9(uv8.txt29o1), uv0.ImVec2(680, 300))
				uv0.Tootlip(tagsInfo)

				slot12 = uv8.txt29o1
				text = uv2:decode(uv16.string(slot12))
				cfg.txt29 = {}

				for slot12 in text:gmatch("[^\r\n]+") do
					table.insert(cfg.txt29, slot12)
				end

				uv7.save(cfg, "FBIhelper")
			end

			if uv0.CollapsingHeader(uv2("Команда: /") .. cfg.config.txt30 .. "") then
				uv0.Text(uv2("После регистрации новой команды перезагрузите скрипт CTRL+R!"))
				uv0.SameLine()
				uv0.Text(uv2("     "))
				uv0.SameLine()

				if uv0.Checkbox(uv2("Отображать в меню"), uv4.CheckTxt30) then
					cfg.config.CheckTxt30 = uv4.CheckTxt30[0]

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Tootlip("\tЕсли данный параметр включён, то команда с\n\tбиндером отобразится в меню на колёсико мыши")
				uv0.Text(uv2("Команда:"))
				uv0.PushItemWidth(150)
				uv0.InputText(uv2("##cmd30"), uv8.txt30, uv9(uv8.txt30))
				uv0.Tootlip([[
	Введите несуществующую команду (без слеша "/")
	В случае использования команды на колёсико мыши, 
	рекомендуется создавать короткое название для бинда,
	чтобы минимизировать размер кнопки на колёсико мыши]])
				uv0.SameLine()

				if uv0.Button(uv2("Создать"), uv0.ImVec2(100, 25)) then
					cfg.config.txt30 = uv2:decode(uv10(uv8.txt30))

					uv7.save(cfg, "FBIhelper")
				end

				uv0.Text(uv2("Задержка:"))
				uv0.InputText(uv2("##delay30"), uv8.delay30, uv9(uv8.delay30))

				cfg.config.delay30 = uv2:decode(uv10(uv8.delay30))

				uv7.save(cfg, "FBIhelper")
				uv0.PopItemWidth()
				uv0.InputTextMultiline(uv2("##bind30"), uv8.txt30o1, uv9(uv8.txt30o1), uv0.ImVec2(680, 300))
				uv0.Tootlip(tagsInfo)

				slot12 = uv8.txt30o1
				text = uv2:decode(uv16.string(slot12))
				cfg.txt30 = {}

				for slot12 in text:gmatch("[^\r\n]+") do
					table.insert(cfg.txt30, slot12)
				end

				uv7.save(cfg, "FBIhelper")
			end
		end

		tagsInfo = "{arg} - аргументы после стандартных команд, к примеру \"/su {arg}\" вернёт вам данные\nвведённые после команды, в нашем случай id, уровень розыска и причину \"232 6 2.1 ПК\"\n{name} - имя игрока из таба (" .. sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub("_.+", "") .. ")\n{surname} - фамилия игрока из таба (" .. sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub(".+_", "") .. ")\n{id} - айди игрока из таба (" .. select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)) .. ")\n{weapon} - оружие, которое находится в руке (" .. uv17.get_name(getCurrentCharWeapon(PLAYER_PED)) .. ")\n{city} - город в котором сейчас нахожусь (" .. getCity(getCharCoordinates(PLAYER_PED)) .. ")\n{zone} - район в котором сейчас нахожусь (" .. calculateZone(getCharCoordinates(PLAYER_PED)) .. ")\n{kvadrat} - квадрат игрока (" .. kvadrat() .. ")\n{time1} - Дата, время с компьютера игрока (" .. getCurrentDateTime() .. ")\n{time2} - Время (" .. getCurrentTime() .. ")\n{dd} - День месяца (" .. getCurrentDayOfMonth() .. ")\n{mm} - Месяц (" .. getCurrentMonth() .. ")\n{YY} - Год (" .. getCurrentYearFull() .. ")\n{yy} - Год (" .. getCurrentYear() .. ")\n{H} - Час (" .. getCurrentHour() .. "))\n{M} - Минута (" .. getCurrentMinutes() .. ")\n{S} - Секунд (" .. getCurrentSecundes() .. ")\n{day} - День недели (" .. getCurrentDayOfWeekString() .. ")\n{month} - Месяц (" .. getCurrentMonthString() .. ")\n{id_marker} - Выделяю игрока - скрипт запоминает последнее выделение игрока (его айди) (" .. uv18 .. ")\n{name_marker} - работает по аналогии, но только с именем (Привет, " .. (sampIsPlayerConnected(uv18) and sampGetPlayerNickname(uv18):gsub("_.+", "") or "Unknown") .. ")\n{surname_marker} - работает по аналогии, но только с фамилией (Привет, " .. (sampIsPlayerConnected(uv18) and sampGetPlayerNickname(uv18):gsub(".+_", "") or "Unknown") .. ")\n{partner_ids} - айди игроков, сидящих с тобой в машине (" .. table.concat(getPassengersIdInCar(), ", ") .. ")\n{partner_nicks} - имена игроков, сидящих с тобой в машине (" .. getPassengersNickInCar() .. ")\n{meg_c_model} - марка автомобиля, за которым ты едешь (выделенный в id_marker) (" .. getMarkerVehicleModel() .. ")\n{color_car} - цвет автомобиля, за которым ты едешь (выделенный в id_marker) (" .. getMarkerVehicleColor() .. [[
)
{F8} - делает скриншот
{} - пробел(его создание)
{wait100} - установить задержку следующей строке на 100мс
{wait500}    ставится между строками в пустую строку (основную задержку нужно ставить на 0)
{wait1000}		можно чередовать для получения задержки 2600 и т.д.

NEW - {sms} - быстрый ответ на смс

]]
	end

	uv0.End()
	uv0.PopStyleColor(1)
end)
slot47 = slot2.OnFrame(function ()
	return uv0.vid[0]
end, function (slot0)
	slot0.HideCursor = true

	uv0.PushStyleColor(uv0.Col.TitleBgActive, uv0.ImVec4(0, 0, 0, 0.55))
	uv0.PushStyleColor(uv0.Col.TitleBg, uv0.ImVec4(0, 0, 0, 0.55))
	uv0.PushStyleColor(uv0.Col.WindowBg, uv0.ImVec4(0, 0, 0, 0.45))

	slot1, slot2 = getScreenResolution()
	resX, resY = getScreenResolution()
	slot3, slot4, slot5 = getCharCoordinates(PLAYER_PED)
	slot6 = sampGetPlayerPing(myid())
	slot7 = {
		", Los Santos",
		", San Fierro",
		", Las Venturas",
		""
	}

	if getCityPlayerIsIn(PLAYER_HANDLE) == 0 then
		slot8 = 4
	end

	a, r, g, b = explode_argb(sampGetPlayerColor(myid()))
	tgds = explode_argb(sampGetPlayerColor(myid()))

	uv0.SetNextWindowPos(uv0.ImVec2(cfg.config.posX, cfg.config.posY), uv0.Cond.Always, uv0.ImVec2(1, 1))
	uv0.Begin(uv1("FBI HELPER"), false, uv0.WindowFlags.NoResize + uv0.WindowFlags.NoCollapse)
	uv0.SameLine()

	if tgds == 0 then
		uv0.CenterText(uv1(" Личность скрыта под маской [") .. myid() .. "]")
	else
		uv0.PushStyleColor(uv0.Col.Text, uv0.ImVec4(r, g, b, a))
		uv0.CenterText(uv1("") .. sampGetPlayerNickname(myid()) .. "")
		uv0.PopStyleColor(1)
		uv0.SameLine()
		uv0.Text(uv1("[" .. myid() .. "]"))
	end

	uv0.CenterText(uv1(" " .. calculateZone(slot3, slot4, slot5) .. "" .. slot7[slot8] .. ""))
	uv0.CenterText(uv1(" Time in OOC: " .. os.date("%H:%M:%S")))
	uv0.CenterText(uv1(" Date: " .. os.date("%d.%m.%Y") .. ""))
	uv0.PushStyleColor(uv0.Col.Button, uv0.ImVec4(0, 0, 0, 0.25))
	uv0.PushStyleColor(uv0.Col.ButtonHovered, uv0.ImVec4(0, 0, 0, 0.8))

	if uv0.Button(uv1("Информация"), uv0.ImVec2(107, 20)) then
		uv2.uk[0] = not uv2.uk[0]
	end

	uv0.SameLine()

	if uv0.Button(uv1("Поиск дома"), uv0.ImVec2(107, 20)) then
		uv2.home[0] = not uv2.home[0]
	end

	if uv0.Button(uv1("Настройка"), uv0.ImVec2(220, 20)) then
		uv2.mainwindow[0] = not uv2.mainwindow[0]
	end

	uv0.PopStyleColor(2)
	uv0.PopStyleColor(3)

	if uv0.IsMouseClicked(2) and cfg.config.CheckBox13 then
		if isCharPlayingAnim(playerPed, "crry_prtial") then
			sampSendChat("/eat")
			uv0.OpenPopup("PieMenu")
		else
			uv0.OpenPopup("PieMenu")
		end
	end

	uv0.PushStyleColor(uv0.Col.ButtonHovered, uv0.ImVec4(0, 0, 0, 0.75))
	uv0.PushStyleColor(uv0.Col.Button, uv0.ImVec4(0.1, 0.1, 0.1, 0.55))

	if uv3.BeginPiePopup("PieMenu", 2) then
		slot0.HideCursor = false

		if cfg.config.CheckTxt1 and uv3.PieMenuItem(uv1("") .. cfg.config.txt1 .. "") then
			bind1()
		end

		if cfg.config.CheckTxt2 and uv3.PieMenuItem(uv1("") .. cfg.config.txt2 .. "") then
			bind2()
		end

		if cfg.config.CheckTxt3 and uv3.PieMenuItem(uv1("") .. cfg.config.txt3 .. "") then
			bind3()
		end

		if cfg.config.CheckTxt4 and uv3.PieMenuItem(uv1("") .. cfg.config.txt4 .. "") then
			bind4()
		end

		if cfg.config.CheckTxt5 and uv3.PieMenuItem(uv1("") .. cfg.config.txt5 .. "") then
			bind5()
		end

		if cfg.config.CheckTxt6 and uv3.PieMenuItem(uv1("") .. cfg.config.txt6 .. "") then
			bind6()
		end

		if cfg.config.CheckTxt7 and uv3.PieMenuItem(uv1("") .. cfg.config.txt7 .. "") then
			bind7()
		end

		if cfg.config.CheckTxt8 and uv3.PieMenuItem(uv1("") .. cfg.config.txt8 .. "") then
			bind8()
		end

		if cfg.config.CheckTxt9 and uv3.PieMenuItem(uv1("") .. cfg.config.txt9 .. "") then
			bind9()
		end

		if cfg.config.CheckTxt10 and uv3.PieMenuItem(uv1("") .. cfg.config.txt10 .. "") then
			bind10()
		end

		if cfg.config.CheckTxt11 and uv3.PieMenuItem(uv1("") .. cfg.config.txt11 .. "") then
			bind11()
		end

		if cfg.config.CheckTxt12 and uv3.PieMenuItem(uv1("") .. cfg.config.txt12 .. "") then
			bind12()
		end

		if cfg.config.CheckTxt13 and uv3.PieMenuItem(uv1("") .. cfg.config.txt13 .. "") then
			bind13()
		end

		if cfg.config.CheckTxt14 and uv3.PieMenuItem(uv1("") .. cfg.config.txt14 .. "") then
			bind14()
		end

		if cfg.config.CheckTxt15 and uv3.PieMenuItem(uv1("") .. cfg.config.txt15 .. "") then
			bind15()
		end

		if cfg.config.CheckTxt16 and uv3.PieMenuItem(uv1("") .. cfg.config.txt16 .. "") then
			bind16()
		end

		if cfg.config.CheckTxt17 and uv3.PieMenuItem(uv1("") .. cfg.config.txt17 .. "") then
			bind17()
		end

		if cfg.config.CheckTxt18 and uv3.PieMenuItem(uv1("") .. cfg.config.txt18 .. "") then
			bind18()
		end

		if cfg.config.CheckTxt19 and uv3.PieMenuItem(uv1("") .. cfg.config.txt19 .. "") then
			bind19()
		end

		if cfg.config.CheckTxt20 and uv3.PieMenuItem(uv1("") .. cfg.config.txt20 .. "") then
			bind20()
		end

		if cfg.config.CheckTxt21 and uv3.PieMenuItem(uv1("") .. cfg.config.txt21 .. "") then
			bind21()
		end

		if cfg.config.CheckTxt22 and uv3.PieMenuItem(uv1("") .. cfg.config.txt22 .. "") then
			bind22()
		end

		if cfg.config.CheckTxt23 and uv3.PieMenuItem(uv1("") .. cfg.config.txt23 .. "") then
			bind23()
		end

		if cfg.config.CheckTxt24 and uv3.PieMenuItem(uv1("") .. cfg.config.txt24 .. "") then
			bind24()
		end

		if cfg.config.CheckTxt25 and uv3.PieMenuItem(uv1("") .. cfg.config.txt25 .. "") then
			bind25()
		end

		if cfg.config.CheckTxt26 and uv3.PieMenuItem(uv1("") .. cfg.config.txt26 .. "") then
			bind26()
		end

		if cfg.config.CheckTxt27 and uv3.PieMenuItem(uv1("") .. cfg.config.txt27 .. "") then
			bind27()
		end

		if cfg.config.CheckTxt28 and uv3.PieMenuItem(uv1("") .. cfg.config.txt28 .. "") then
			bind28()
		end

		if cfg.config.CheckTxt29 and uv3.PieMenuItem(uv1("") .. cfg.config.txt29 .. "") then
			bind29()
		end

		if cfg.config.CheckTxt30 and uv3.PieMenuItem(uv1("") .. cfg.config.txt30 .. "") then
			bind30()
		end

		if cfg.config.fbfix then
			if uv3.PieMenuItem(uv1("FB")) then
				fb()
			end

			if uv3.PieMenuItem(uv1("FIX")) then
				sampSendChat("/fix")
			end
		end

		uv3.EndPiePopup()
	end

	uv0.PopStyleColor(2)
end)
slot48 = {}

loadLaw = function(slot0)
	if not io.open(slot0, "r") then
		return
	end

	slot2 = nil
	slot3 = {}

	for slot7 in slot1.lines(slot1) do
		if slot7 == "" then
			if slot2 then
				table.insert(uv0, {
					title = slot2,
					articles = slot3
				})

				slot2 = nil
				slot3 = {}
			end
		elseif slot7.match(slot7, "^Глава") then
			if slot2 then
				table.insert(uv0, {
					title = slot2,
					articles = slot3
				})

				slot3 = {}
			end

			slot2 = slot7
		elseif slot7.match(slot7, "^[%d%.]+") then
			table.insert(slot3, {
				text = "",
				article = slot7
			})
		elseif #slot3 > 0 then
			slot3[#slot3].text = slot3[#slot3].text .. "\n" .. slot7
		end
	end

	if slot2 then
		table.insert(uv0, {
			title = slot2,
			articles = slot3
		})
	end

	slot1.close(slot1)
end

slot49 = slot2.OnFrame(function ()
	return uv0.sus[0]
end, function (slot0)
	slot1, slot2 = getScreenResolution()
	resX, resY = getScreenResolution()

	uv0.SetNextWindowPos(uv0.ImVec2(slot1 / 2, slot2 / 2), uv0.Cond.FirstUseEver, uv0.ImVec2(0.5, 0.5))
	uv0.SetNextWindowSize(uv0.ImVec2(800, 650), uv0.Cond.FirstUseEver)
	uv0.Begin(uv1("FH: Умная выдача розыска"), uv2.sus, uv0.WindowFlags.NoResize + uv0.WindowFlags.NoCollapse)
	uv0.Text(uv1("\t\t\tЗдесь Вы можете выбрать пункт для выдачи розыска.\n\t\t\t"))
	uv0.SameLine()
	uv0.TextColoredRGB("                          {ffa200}Автор обновлённой умной выдачи: Arseniy Samsonov")
	uv0.PushStyleColor(uv0.Col.WindowBg, uv0.ImVec4(0, 0, 0, 0.2))
	uv0.PushStyleColor(uv0.Col.Button, uv0.ImVec4(0.2, 0.2, 0.5, 0.25))
	uv0.PushStyleColor(uv0.Col.ButtonHovered, uv0.ImVec4(0, 0, 0.5, 0.8))

	if uv0.Button(uv1("GPS-трекер на себя"), uv0.ImVec2(780, 20)) then
		sampProcessChatInput("/su " .. uv3 .. " 6 " .. "GPS-ON")

		uv2.sus[0] = false
	end

	if uv0.Button(uv1("Присвоить 6 звезд по статье 2.1 ПК"), uv0.ImVec2(780, 20)) then
		sampProcessChatInput("/su " .. uv3 .. " 6 " .. "2.1 ПК")

		uv2.sus[0] = false
	end

	uv0.SetCursorPosY(uv0.GetCursorPosY() + 20)

	for slot6, slot7 in ipairs(uv4) do
		if uv0.CollapsingHeader(uv1(slot7.title)) then
			for slot11, slot12 in ipairs(slot7.articles) do
				uv0.TextWrapped(uv1(slot12.article .. " " .. slot12.text))
				uv0.SetNextItemWidth(-1)

				if uv0.Button(uv1("Присвоить статью " .. slot12.article:match("^(%d+%.%d+)")), uv0.ImVec2(780, 20)) then
					slot14 = slot12.article:match("(%d+)%s*степень розыска") or slot12.article:match("(%d+)%s*степени розыска") or slot12.article:match("(%d+)%s*уровень розыска")

					if uv3 then
						sampProcessChatInput("/su " .. uv3 .. " " .. slot14 .. " " .. slot13 .. " УК", 8421504)

						uv2.sus[0] = false
					else
						sampAddChatMessage("{4c4f45}[FBI Helper] {FFFFFF}ID не найден. Убедитесь, что вы указали id и пользователь на сервере", 16711680)
					end
				end
			end
		end
	end

	uv0.PopStyleColor(3)
	uv0.CenterText(uv1("\n\t\t\t"))
	uv0.End()
end)
slot50 = slot2.OnFrame(function ()
	return uv0.click[0]
end, function (slot0)
	slot1, slot2 = getScreenResolution()
	resX, resY = getScreenResolution()

	uv0.SetNextWindowPos(uv0.ImVec2(slot1 / 2, slot2 / 2), uv0.Cond.FirstUseEver, uv0.ImVec2(0.5, 0.5))
	uv0.SetNextWindowSize(uv0.ImVec2(800, 650), uv0.Cond.FirstUseEver)
	uv0.Begin(uv1("FH: Кликер"), uv2.click, uv0.WindowFlags.NoResize + uv0.WindowFlags.NoCollapse + uv0.WindowFlags.NoMove)
	uv0.CenterText(uv1("Баллы: ") .. uv3)
	uv0.PushStyleColor(uv0.Col.WindowBg, uv0.ImVec4(0, 0, 0, 0.2))
	uv0.PushStyleColor(uv0.Col.Button, uv0.ImVec4(0.2, 0.2, 0.5, 0.25))
	uv0.PushStyleColor(uv0.Col.ButtonHovered, uv0.ImVec4(0, 0, 0.5, 0.8))
	uv0.SetCursorPos(uv0.ImVec2(uv4, uv4))

	if uv3 <= 50 then
		if uv0.Button(uv1("НАЖМИ НА МЕНЯ"), uv0.ImVec2(200, 100)) then
			uv3 = uv3 + 1
		end
	elseif uv3 <= 100 then
		if uv0.Button(uv1("НАЖМИ НА МЕНЯ"), uv0.ImVec2(150, 50)) then
			uv3 = uv3 + 1
		end
	elseif uv3 <= 150 then
		if uv0.Button(uv1("НАЖМИ НА МЕНЯ"), uv0.ImVec2(120, 20)) then
			uv3 = uv3 + 1
		end
	elseif uv3 <= 250 then
		if uv0.Button(uv1("НАЖМИ"), uv0.ImVec2(60, 20)) then
			uv3 = uv3 + 1
		end
	elseif uv3 <= 350 then
		if uv0.Button(uv1("##"), uv0.ImVec2(20, 20)) then
			uv3 = uv3 + 1
		end
	elseif uv3 <= 450 and uv0.Button(uv1("##"), uv0.ImVec2(10, 10)) then
		uv3 = uv3 + 1
	end

	uv0.PopStyleColor(3)
	uv0.CenterText(uv1("\n\t\t\t"))
	uv0.End()
end)
slot51 = slot2.OnFrame(function ()
	return uv0.uk[0]
end, function (slot0)
	slot1, slot2 = getScreenResolution()
	resX, resY = getScreenResolution()
	slot3, slot4, slot5 = getCharCoordinates(PLAYER_PED)
	slot6 = sampGetPlayerPing(myid())
	slot7 = {
		", Los Santos",
		", San Fierro",
		", Las Venturas",
		""
	}

	if getCityPlayerIsIn(PLAYER_HANDLE) == 0 then
		slot8 = 4
	end

	a, r, g, b = explode_argb(sampGetPlayerColor(myid()))
	tgds = explode_argb(sampGetPlayerColor(myid()))

	uv0.PushStyleColor(uv0.Col.WindowBg, uv0.ImVec4(0.1, 0.1, 0.1, 0.95))
	uv0.SetNextWindowPos(uv0.ImVec2(slot1 / 2, slot2 / 2), uv0.Cond.FirstUseEver, uv0.ImVec2(0.5, 0.5))
	uv0.SetNextWindowSize(uv0.ImVec2(1100, 650), uv0.Cond.FirstUseEver)
	uv0.Begin(uv1("FH: Информация"), uv2.uk, uv0.WindowFlags.NoResize + uv0.WindowFlags.NoCollapse)

	if uv0.BeginTabBar("Tabs") then
		if uv0.BeginTabItem(uv1("Заметки")) then
			uv0.CenterText(uv1("Здесь Вы можете оставить некоторые записи."))
			uv0.InputTextMultiline(uv1("##zametki"), uv3.bl, uv4(uv3.bl), uv0.ImVec2(1090, 565))

			slot12 = uv3.bl
			text = uv1:decode(uv5.string(slot12))
			cfg.bl = {}

			for slot12 in text:gmatch("[^\r\n]+") do
				table.insert(cfg.bl, slot12)
			end

			uv6.save(cfg, "FBIhelper")
			uv0.EndTabItem()
		end

		if uv0.BeginTabItem(uv1("Кодексы Синей Федерации")) then
			uv0.CenterText(uv1("Кодексы ARP BLUE (от 24.04.25)"))

			for slot12 in uv7:gmatch("[^\n]+") do
				uv0.TextWrapped(uv1(slot12))
			end

			uv0.EndTabItem()
		end

		if uv0.BeginTabItem(uv1("Список команд")) then
			for slot12 in uv8:gmatch("[^\n]+") do
				uv0.TextWrapped(uv1(slot12))
			end

			uv0.EndTabItem()
		end

		if uv0.BeginTabItem(uv1("Информация о скрипте")) then
			uv0.Separator()
			uv0.Text(uv1([[

Скрипт создан для упрощения действий агентов FBI, добавления спец. возможностей и более детальной игры. 

Система не использует браузерные данные, не использует большую часть библиотек и потому слабо нагружает игру, сохраняя FPS. 
Обновления скрипта производятся автоматически, в случае сбоя нажмите CTRL+R - это решение большинства проблем.
Микрообновления и различные фиксы могут происходить по 10 раз за день.

В случае обнаружения технических ошибок следует оповестить о них автора скрипта.

Автор скрипта: Trofim_Shcherbakov (Fernando_Cavalli)

08.03.24:
Обновление от 8 марта может похвастаться возможностью добавить свою
уникальную картинку на фон основного меню /fh.
Установить свою картинку можно, заменив файл fbi.png на свой по пути
moonloader/FBIhelper/im/
Для наилучшего качества необходимо установить размер изображения 900х500.

!Разработчики скрипта за установку вами запрещённых/провакационных/оскорбляющих
изображений ответственности не несут, как и остальные пользователи ФБР хелпера

]]))
			uv0.Separator()
			uv0.Text(uv1("Связь для оповещения об ошибках и приобретении услуг спец. доступа: "))
			uv0.Text(uv1("VK - vk.com/tsidex"))
			uv0.Text(uv1("Discord - tsidex"))
			uv0.EndTabItem()
		end

		if uv0.BeginTabItem(uv1("Лог изменений")) then
			uv0.Text(uv1(uv9))
			uv0.EndTabItem()
		end

		uv0.EndTabBar()
	end

	uv0.PopStyleColor()
	uv0.End()
end)
slot52 = slot2.OnFrame(function ()
	return uv0.home[0]
end, function (slot0)
	slot1, slot2 = getScreenResolution()
	resX, resY = getScreenResolution()
	slot3, slot4, slot5 = getCharCoordinates(PLAYER_PED)
	slot6 = sampGetPlayerPing(myid())
	slot7 = {
		", Los Santos",
		", San Fierro",
		", Las Venturas",
		""
	}

	if getCityPlayerIsIn(PLAYER_HANDLE) == 0 then
		slot8 = 4
	end

	a, r, g, b = explode_argb(sampGetPlayerColor(myid()))
	tgds = explode_argb(sampGetPlayerColor(myid()))

	uv0.PushStyleColor(uv0.Col.WindowBg, uv0.ImVec4(0.1, 0.1, 0.1, 0.95))
	uv0.SetNextWindowPos(uv0.ImVec2(slot1 / 2, slot2 / 2), uv0.Cond.FirstUseEver, uv0.ImVec2(0.5, 0.5))
	uv0.SetNextWindowSize(uv0.ImVec2(300, 120))
	uv0.Begin(uv1("Местоположение дома по его номеру"), uv2.home, uv0.WindowFlags.NoResize + uv0.WindowFlags.NoCollapse)
	uv0.Separator()
	uv0.Text(uv1("Введите номер дома"))
	uv0.SameLine()
	uv0.Tootlip([[
Введите желаемый номер дома для поиска.

- Вводить можно только цифры (до 4-х);
- Оставив поле пустым, окно свернётся;
- В базе данных находится 1051 дом;
- Можно вызывать командой /tsh [номер];
- Можно удалять маркер командой /rb.]])
	uv0.PushItemWidth(50)
	uv0.InputText(uv1("##tsh"), uv3.tsh, uv4(uv3.tsh))

	num = uv1:decode(uv5(uv3.tsh))

	uv0.PopItemWidth()
	uv0.SameLine()

	if uv0.Button(uv1(" Поиск "), uv0.ImVec2(80, 20)) or isKeyDown(uv6.VK_ENTER) then
		if #num == 0 then
			whouse.v = false
		else
			if not tonumber(num) then
				sampAddChatMessage("{4c4f45}[FBI Helper] {FFFFFF}Введите корректный номер дома", 16777215)

				return false
			end

			if not uv7[slot9] then
				sampAddChatMessage("{4c4f45}[FBI Helper] {FFFFFF}Данного дома не имеется в базе.", 16777215)
			else
				if uv8 then
					removeBlip(uv8)
				end

				uv8 = addBlipForCoord(uv7[slot9].x, uv7[slot9].y, uv7[slot9].z)

				sampAddChatMessage("{4c4f45}[FBI Helper] {FFFFFF}Номер дома: " .. slot9 .. ". Местоположение: " .. calculateZone(uv7[slot9].x, uv7[slot9].y, uv7[slot9].z) .. ".", 16777215)
				changeBlipScale(uv8, 3)
				changeBlipColour(uv8, 4294967295.0)

				uv2.home[0] = false
			end
		end
	end

	if uv0.Button(uv1(" Удалить маркер "), uv0.ImVec2(280, 20)) then
		rb()
	end

	uv0.PopStyleColor()
	uv0.End()
end)

setmetatable({
	duration = 1.5,
	state = false
}, {
	__index = function (slot0, slot1)
		if slot1 == "switch" then
			return function ()
				if uv0.process and uv0.process:status() ~= "dead" then
					print("ошибка анимации")
				end

				uv0.timer = os.clock()
				uv0.state = not uv0.state
				uv0.process = lua_thread.create(function ()
					slot0 = function(slot0, slot1, slot2, slot3)
						if os.clock() - slot2 >= 0 and slot4 <= slot3 then
							return slot4 / (slot3 / 100) * (slot1 - slot0) / 100
						end

						return slot3 < slot4 and slot1 or slot0
					end

					while true do
						wait(0)

						slot1 = slot0(0, 1, uv0.timer, uv0.duration)
						uv0.alpha = uv0.state and slot1 or 1 - slot1

						if slot1 == 1 then
							break
						end
					end
				end)

				return true
			end
		end

		if slot1 == "alpha" then
			return slot0.state and 1 or 0
		end
	end
})

main = function()
	os.remove("gtaweap3.saa")

	slot0 = {
		", Los Santos",
		", San Fierro",
		", Las Venturas",
		""
	}

	if getCityPlayerIsIn(PLAYER_HANDLE) == 0 then
		slot1 = 4
	end

	if cfg.config.CheckBox18 then
		uv0 = true
	end

	time = 0

	if not isSampLoaded() or not isSampfuncsLoaded() then
		return
	end

	initializeRender()

	while not isSampAvailable() do
		wait(100)
	end

	vid()

	slot2 = renderCreateFont("Arial", 10, 9)
	cfg.config.da = false
	cfg.config.net = false

	sampRegisterChatCommand("rc", rc)
	sampRegisterChatCommand("r", r)
	sampRegisterChatCommand("ts2", checkname)
	sampRegisterChatCommand("f", f)
	sampRegisterChatCommand("iidd", idd)

	repeat
		wait(0)
	until sampIsLocalPlayerSpawned()

	lua_thread.create(function ()
		forceWeatherNow(1)
		sampAddChatMessage("{4c4f45}[FBI Helper] {FFFFFF}FBI Helper запущен. Версия скрипта от " .. uv0 .. ". Основное меню - /fh..", 16777215)

		if cfg.config.news == true then
			sampAddChatMessage("{FFFF00}[FBI Helper] {FFFFFF}Была обновлена и переделана умная выдача розыска /sus [id]", 16777215)

			cfg.config.news = false

			uv1.save(cfg, "FBIhelper")
		end
	end)
	sampRegisterChatCommand("tsh", tsh)
	sampRegisterChatCommand("fhlog", fhdlog)
	sampRegisterChatCommand("sus", cmd_su)
	sampRegisterChatCommand("clc", function (slot0)
		uv0.click[0] = not uv0.click[0]
	end)
	sampRegisterChatCommand("sust", function (slot0)
		arg, suspt = slot0.match(slot0, "(.+)(.-)")

		if not arg then
			sampAddChatMessage("{4c4f45}[FBI Helper] {FFFFFF}Используйте: /sus [id]", 16777215)

			return false
		end

		uv0.sus[0] = not uv0.sus[0]
	end)
	sampRegisterChatCommand("rb", rb)

	if not doesFileExist("moonloader/config/FBIhouse.ini") then
		sampAddChatMessage("{800000}[FBI Helper] {FFFFFF}Отсутствует компонент {4c4f45}FBIhouse.ini{FFFFFF}. используйте /fhreg для установки.", 16777215)
	else
		uv4 = uv2.load({}, "moonloader/config/FBIhouse.ini")
	end

	if not doesFileExist("moonloader/wanted.txt") then
		sampAddChatMessage("{800000}[FBI Helper] {FFFFFF}Отсутствует компонент {4c4f45}wanted.txt{FFFFFF}. Он будет установлен автоматически.", 16777215)
		wait(1000)
		lua_thread.create(function ()
			sampAddChatMessage("{4c4f45}[FBI Helper] {FFFFFF}" .. "Производится установка компонента wanted.txt", -1)
			wait(250)
			downloadUrlToFile("https://raw.githubusercontent.com/TSIDEX/FBIhelper/main/moonloader/wanted.txt", getWorkingDirectory() .. "/wanted.txt", function (slot0, slot1, slot2, slot3)
				if slot1 == 5 then
					if sampGetChatString(99):find("Загружено") then
						sampSetChatString(99, uv0 .. string.format("Загружено %d KB из %d KB.", slot2 / 1000, slot3 / 1000), nil, -1)
					else
						sampAddChatMessage(uv0 .. string.format("Загружено %d KB из %d KB.", slot2 / 1000, slot3 / 1000), uv1)
					end
				elseif slot1 == 6 then
					print("Загрузка успешно завершена.")
					sampAddChatMessage(uv0 .. "Установка wanted.txt успешно завершена.", uv1)

					goupdatestatus = true
				end

				if slot1 == 58 and goupdatestatus == nil then
					sampAddChatMessage(uv0 .. "Загрузка прошла неудачно. Обратитесь в поддержку.", uv1)
				end
			end)
		end)
	end

	if not doesFileExist("moonloader/FBIhelper/im/fbi.png") then
		sampAddChatMessage("{800000}[FBI Helper] {FFFFFF}Отсутствует компонент {4c4f45}fbi.png{FFFFFF}. Он будет установлен автоматически.", 16777215)
		wait(1000)
		lua_thread.create(function ()
			createDirectory(getWorkingDirectory() .. "\\FBIhelper\\im\\")
			sampAddChatMessage("{4c4f45}[FBI Helper] {FFFFFF}" .. "Производится установка компонента fbi.png", -1)
			wait(250)
			downloadUrlToFile("https://raw.githubusercontent.com/TSIDEX/FBIhelper/main/moonloader/FBIhelper/im/fbi.png", getWorkingDirectory() .. "\\FBIhelper\\im\\fbi.png", function (slot0, slot1, slot2, slot3)
				if slot1 == 5 then
					if sampGetChatString(99):find("Загружено") then
						sampSetChatString(99, uv0 .. string.format("Загружено %d KB из %d KB.", slot2 / 1000, slot3 / 1000), nil, -1)
					else
						sampAddChatMessage(uv0 .. string.format("Загружено %d KB из %d KB.", slot2 / 1000, slot3 / 1000), uv1)
					end
				elseif slot1 == 6 then
					print("Загрузка успешно завершена.")
					sampAddChatMessage(uv0 .. "Установка fbi.png успешно завершена.", uv1)

					goupdatestatus = true
				end

				if slot1 == 58 and goupdatestatus == nil then
					sampAddChatMessage(uv0 .. "Загрузка прошла неудачно. Обратитесь в поддержку.", uv1)
				end
			end)
		end)
	end

	if not doesFileExist("moonloader/lib/imgui_piemenu.lua") or cfg.config.pie2 then
		sampAddChatMessage("{800000}[FBI Helper] {FFFFFF}Отсутствует новый {4c4f45}imgui_piemenu.lua{FFFFFF}. Он будет установлен автоматически.", 16777215)
		wait(1000)
		lua_thread.create(function ()
			createDirectory(getWorkingDirectory() .. "\\lib\\")

			slot0 = getWorkingDirectory() .. "\\lib\\imgui_piemenu.lua"

			os.remove(slot0)
			sampAddChatMessage("{4c4f45}[FBI Helper] {FFFFFF}" .. "Производится установка компонента imgui_piemenu.lua", -1)
			wait(250)
			downloadUrlToFile("https://raw.githubusercontent.com/TSIDEX/FBIhelper/main/moonloader/lib/imgui_piemenu.lua", slot0, function (slot0, slot1, slot2, slot3)
				if slot1 == 5 then
					if sampGetChatString(99):find("Загружено") then
						sampSetChatString(99, uv0 .. string.format("Загружено %d KB из %d KB.", slot2 / 1000, slot3 / 1000), nil, -1)
					else
						sampAddChatMessage(uv0 .. string.format("Загружено %d KB из %d KB.", slot2 / 1000, slot3 / 1000), uv1)
					end
				elseif slot1 == 6 then
					print("Загрузка успешно завершена.")
					sampAddChatMessage(uv0 .. "Установка imgui_piemenu.lua успешно завершена.", uv1)

					goupdatestatus = true
					slot4 = require("imgui_piemenu")
					cfg.config.pie2 = false

					uv2.save(cfg, "FBIhelper")
				end

				if slot1 == 58 and goupdatestatus == nil then
					sampAddChatMessage(uv0 .. "Загрузка imgui_piemenu прошла неудачно. Обратитесь в поддержку.", uv1)
				end
			end)
		end)
	end

	if cfg.config.CheckBox77 then
		sampRegisterChatCommand("su", su)
		sampRegisterChatCommand("cuff", cuff)
		sampRegisterChatCommand("uncuff", uncuff)
		sampRegisterChatCommand("putpl", putpl)
		sampRegisterChatCommand("eject", eject)
		sampRegisterChatCommand("ticket", ticket)
		sampRegisterChatCommand("ticketsp", ticketsp)
		sampRegisterChatCommand("takelic", takelic)
		sampRegisterChatCommand("invite", invite)
		sampRegisterChatCommand("mask", mask)
		sampRegisterChatCommand("healme", healme)
		sampRegisterChatCommand("hack", hack)
		sampRegisterChatCommand("skip", skip)
	end

	sampRegisterChatCommand("cuffsp", cuffsp)
	sampRegisterChatCommand("uncuffsp", uncuffsp)
	sampRegisterChatCommand("putplsp", putplsp)
	sampRegisterChatCommand("ejectsp", ejectsp)
	sampRegisterChatCommand("arrestsp", arrestsp)
	sampRegisterChatCommand("clearsp", clearsp)
	sampRegisterChatCommand("holdsp", holdsp)
	sampRegisterChatCommand("hold", hold)
	sampRegisterChatCommand("searchsp", searchsp)
	sampRegisterChatCommand("sos", sos)
	sampRegisterChatCommand("takelicsp", takelicsp)
	sampRegisterChatCommand("setmarksp", setmarksp)
	sampRegisterChatCommand("rangsp", rangsp)
	sampRegisterChatCommand("invitesp", invitesp)
	sampRegisterChatCommand("healmesp", healmesp)
	sampRegisterChatCommand("masksp", masksp)
	sampRegisterChatCommand("strelba", strelba)
	sampRegisterChatCommand("hacksp", hacksp)
	sampRegisterChatCommand("incar", incar)
	sampRegisterChatCommand("inmoto", inmoto)
	sampRegisterChatCommand("hh", hh)
	sampRegisterChatCommand("pp", pp)
	sampRegisterChatCommand("bl", bl)
	sampRegisterChatCommand("cam", cam)
	sampRegisterChatCommand("cams", cams)
	sampRegisterChatCommand("alp", alp)
	sampRegisterChatCommand("alpt", alpt)
	sampRegisterChatCommand("alps", alps)
	sampRegisterChatCommand("ук", uk)
	sampRegisterChatCommand("vid", vid)
	sampRegisterChatCommand("hist", hist)
	sampRegisterChatCommand("ln", ln)
	sampRegisterChatCommand("hexit", hexit)
	sampRegisterChatCommand("gg", gg)
	sampRegisterChatCommand("mir", mir)
	sampRegisterChatCommand("mon", mon)
	sampRegisterChatCommand("moff", moff)
	sampRegisterChatCommand("biz", biz)
	sampRegisterChatCommand("sm", sm)
	sampRegisterChatCommand("ton", ton)
	sampRegisterChatCommand("nar", nar)
	sampRegisterChatCommand("ot", ot)
	sampRegisterChatCommand("cs", cs)
	sampRegisterChatCommand("css", css)
	sampRegisterChatCommand("pt", pt)
	sampRegisterChatCommand("fo", fo)
	sampRegisterChatCommand("ja", ja)
	sampRegisterChatCommand("foff", foff)
	sampRegisterChatCommand("cf", cf)
	sampRegisterChatCommand("fh", fh)
	sampRegisterChatCommand("pg", pg)
	sampRegisterChatCommand("pn", pn)
	sampRegisterChatCommand("susp", susp)
	sampRegisterChatCommand("skipsp", skipsp)
	sampRegisterChatCommand("meg", meg)
	sampRegisterChatCommand("megsp", megsp)
	sampRegisterChatCommand("krik", krik)
	sampRegisterChatCommand("rhelp", rhelp)
	sampRegisterChatCommand("fhelp", fhelp)
	sampRegisterChatCommand("unc", unc)
	sampRegisterChatCommand("dor", dor)
	sampRegisterChatCommand("pr", pr)
	sampRegisterChatCommand("pk", pk)
	sampRegisterChatCommand("уд", uud)
	sampRegisterChatCommand("jt", jt)
	sampRegisterChatCommand("ii", ii)
	sampRegisterChatCommand("qsm", qsm)
	sampRegisterChatCommand("uninvite", function (slot0)
		arg1, arg2 = slot0:match("(.-) (.+)")
		name = sampGetPlayerNickname(arg1)
		name = name:gsub("_", " ")

		if not arg1 then
			sampAddChatMessage("{4c4f45}[FBI Helper] {FFFFFF}Используйте: /uninvite [id] [причина]", 16777215)

			return false
		end

		lua_thread.create(function ()
			sampSendChat("/me достал смартфон из кармана штанов, открыл список сотрудников...")
			wait(800)
			sampSendChat("/do ..." .. cfg.config.org .. " и аннулировал личное дело " .. name .. ".")
			wait(800)
			sampSendChat("/uninvite " .. arg1 .. " " .. arg2)
		end)
	end)
	sampRegisterChatCommand("uninviteoff", function (slot0)
		arg1, arg2 = slot0.match(slot0, "(.-) (.+)")

		if not arg1 then
			sampAddChatMessage("{4c4f45}[FBI Helper] {FFFFFF}Используйте: /uninviteoff [nick] [причина]", 16777215)

			return false
		end

		name = arg1
		slot1 = name
		name = slot1:gsub("_", " ")

		lua_thread.create(function ()
			sampSendChat("/me достал смартфон из кармана штанов, открыл список сотрудников...")
			wait(800)
			sampSendChat("/do ..." .. cfg.config.org .. " и аннулировал личное дело " .. name .. ".")
			wait(800)
			sampSendChat("/uninviteoff " .. arg1 .. " " .. arg2)
		end)
	end)
	sampRegisterChatCommand("rang", function (slot0)
		arg1, arg2 = slot0:match("(.-) (.+)")
		name = sampGetPlayerNickname(arg1)
		name = name:gsub("_", " ")

		if not arg1 then
			sampAddChatMessage("{4c4f45}[FBI Helper] {FFFFFF}Используйте: /rang [id] [+/-]", 16777215)

			return false
		end

		lua_thread.create(function ()
			sampProcessChatInput("/rangsp " .. arg1 .. " " .. arg2)
			wait(800)
			sampSendChat("/me достал смартфон из кармана штанов, открыл список сотрудников...")
			wait(800)
			sampSendChat("/do ..." .. cfg.config.org .. " и обновил уровень доступа сотруднику " .. name .. ".")
		end)
	end)
	sampRegisterChatCommand("offrang", function (slot0)
		arg1, arg2 = slot0.match(slot0, "(.-) (.+)")

		if not arg1 then
			sampAddChatMessage("{4c4f45}[FBI Helper] {FFFFFF}Используйте: /offrang [nick] [+/-]", 16777215)

			return false
		end

		name = arg1
		slot1 = name
		name = slot1:gsub("_", " ")

		lua_thread.create(function ()
			sampSendChat("/me достал смартфон из кармана штанов, открыл список сотрудников...")
			wait(800)
			sampSendChat("/do ..." .. cfg.config.org .. " и обновил уровень доступа сотруднику " .. name .. ".")
			wait(800)
			sampSendChat("/offrang " .. arg1 .. " " .. arg2)
		end)
	end)
	sampRegisterChatCommand("ud", function (slot0)
		if slot0 ~= "" then
			lua_thread.create(function ()
				sampSendChat("/do В заднем кармане штанов лежит удостоверение.")
				wait(500)
				sampSendChat("/me вытащил удостоверение из кармана штанов и показал его.")
				wait(500)
				sampSendChat("/anim 21")
				wait(500)
				sampSendChat("/do На удостоверении единого типа указана информация о сотруднике.")
				wait(1200)
				sampSendChat("/do | " .. uv0 .. ".")
			end)
		else
			sampAddChatMessage("{4c4f45}[FBI Helper] {FFFFFF}Используйте: /ud [имя] [организация] [управление] [должность] или автоматическое /уд", 16777215)
		end
	end)
	sampRegisterChatCommand("fhreg", function ()
		lua_thread.create(function ()
			createDirectory(getWorkingDirectory() .. "\\config\\")
			createDirectory(getWorkingDirectory() .. "\\FBIHelper\\im\\")

			slot0 = getWorkingDirectory() .. "\\FBIHelper\\im\\"

			sampAddChatMessage("{4c4f45}[FBI Helper] {FFFFFF}" .. "Производится установка компонента FBIhouse.ini", -1)
			wait(250)
			downloadUrlToFile("https://raw.githubusercontent.com/TSIDEX/FBIhelper/main/moonloader/config/FBIhouse.ini", getWorkingDirectory() .. "\\config\\FBIhouse.ini", function (slot0, slot1, slot2, slot3)
				if slot1 == 5 then
					if sampGetChatString(99):find("Загружено") then
						sampSetChatString(99, uv0 .. string.format("Загружено %d KB из %d KB.", slot2 / 1000, slot3 / 1000), nil, -1)
					else
						sampAddChatMessage(uv0 .. string.format("Загружено %d KB из %d KB.", slot2 / 1000, slot3 / 1000), uv1)
					end
				elseif slot1 == 6 then
					print("Загрузка успешно завершена.")
					sampAddChatMessage(uv0 .. "Установка FBIhouse.ini успешно завершена.", uv1)

					goupdatestatus = true

					thisScript():reload()
				end

				if slot1 == 58 and goupdatestatus == nil then
					sampAddChatMessage(uv0 .. "Загрузка прошла неудачно. Обратитесь в поддержку.", uv1)
				end
			end)
		end)
	end)
	loadLaw(getWorkingDirectory() .. "/wanted.txt")
	sampRegisterChatCommand("search", function (slot0)
		arg1, arg2 = slot0.match(slot0, "(.-) (.+)")

		if not arg1 then
			sampAddChatMessage("{4c4f45}[FBI Helper] {FFFFFF}Используйте: /search [id] [причина]", 16777215)

			return false
		end

		name = sampGetPlayerNickname(myid())
		slot1 = name
		name = slot1:gsub("_", " ")

		lua_thread.create(function ()
			sampSendChat("/do На руках " .. name .. " перчатки.")
			wait(500)
			sampSendChat("/anim 45")
			wait(1000)
			sampSendChat("/me тщательно обыскал каждый элемент одежды человека.")
			wait(800)
			sampSendChat("/anim 14")
			wait(800)
			sampProcessChatInput("/searchsp " .. uv0 .. "", main_color)
		end)
	end)
	sampRegisterChatCommand("clear", function (slot0)
		arg1, arg2 = slot0.match(slot0, "(.-) (.+)")

		if not arg1 then
			sampAddChatMessage("{4c4f45}[FBI Helper] {FFFFFF}Используйте: /clear [id] [причина]", 16777215)

			return false
		end

		lua_thread.create(function ()
			sampSendChat("/me потянувшись в карман штанов, достал оттуда КПК, включил его и...")
			wait(800)
			sampSendChat("/do ...зашёл в раздел Уголовный розыск, обнаружил дело и закрыл его.")
			wait(800)
			sampSendChat("/clear " .. uv0 .. "", main_color)
		end)
	end)
	sampRegisterChatCommand("arrest", function (slot0)
		arg1, arg2 = slot0.match(slot0, "(.-) (.+)")

		if not arg1 then
			sampAddChatMessage("{4c4f45}[FBI Helper] {FFFFFF}Используйте: /arrest [id] [причина]", 16777215)

			return false
		end

		lua_thread.create(function ()
			sampSendChat("/me потянулся к бардачку и открыл его, перебрал дела, затем...")
			wait(1200)
			sampSendChat("/do ...взял подходящее из них, вытащил авторучку из штанов, заполняет дело.")
			wait(1200)
			sampSendChat("/me заполнил дело и передал его в участок.")
			wait(1200)
			sampSendChat("/arrest " .. uv0 .. "", main_color)
		end)
	end)
	sampRegisterChatCommand(cfg.config.txt1, bind1)
	sampRegisterChatCommand(cfg.config.txt2, bind2)
	sampRegisterChatCommand(cfg.config.txt3, bind3)
	sampRegisterChatCommand(cfg.config.txt4, bind4)
	sampRegisterChatCommand(cfg.config.txt5, bind5)
	sampRegisterChatCommand(cfg.config.txt6, bind6)
	sampRegisterChatCommand(cfg.config.txt7, bind7)
	sampRegisterChatCommand(cfg.config.txt8, bind8)
	sampRegisterChatCommand(cfg.config.txt9, bind9)
	sampRegisterChatCommand(cfg.config.txt10, bind10)
	sampRegisterChatCommand(cfg.config.txt11, bind11)
	sampRegisterChatCommand(cfg.config.txt12, bind12)
	sampRegisterChatCommand(cfg.config.txt13, bind13)
	sampRegisterChatCommand(cfg.config.txt14, bind14)
	sampRegisterChatCommand(cfg.config.txt15, bind15)
	sampRegisterChatCommand(cfg.config.txt16, bind16)
	sampRegisterChatCommand(cfg.config.txt17, bind17)
	sampRegisterChatCommand(cfg.config.txt18, bind18)
	sampRegisterChatCommand(cfg.config.txt19, bind19)
	sampRegisterChatCommand(cfg.config.txt20, bind20)
	sampRegisterChatCommand(cfg.config.txt21, bind21)
	sampRegisterChatCommand(cfg.config.txt22, bind22)
	sampRegisterChatCommand(cfg.config.txt23, bind23)
	sampRegisterChatCommand(cfg.config.txt24, bind24)
	sampRegisterChatCommand(cfg.config.txt25, bind25)
	sampRegisterChatCommand(cfg.config.txt26, bind26)
	sampRegisterChatCommand(cfg.config.txt27, bind27)
	sampRegisterChatCommand(cfg.config.txt28, bind28)
	sampRegisterChatCommand(cfg.config.txt29, bind29)
	sampRegisterChatCommand(cfg.config.txt30, bind30)
	sampRegisterChatCommand("kk", function ()
		for slot3 = 1, 50 do
			sampSendChat("/..")
		end
	end)
	sampRegisterChatCommand("cc", function ()
		for slot3 = 1, 150 do
			sampAddChatMessage("{ffffff} ", 16777215)
		end
	end)
	sampRegisterChatCommand("fb", fb)

	while true do
		if uv5 then
			cfg.config.posX, cfg.config.posY = getCursorPos()

			if isKeyJustPressed(1) then
				uv5 = false

				uv2.save(cfg, "FBIhelper")
			end
		end

		cped = getCharPointer(PLAYER_PED)

		if isCharDead(PLAYER_PED) then
			reason = uv6.read(cped + 1888, 4)
			killer_ptr = uv6.read(cped + 1892, 4)
			killer_ped = getCharPointerHandle(killer_ptr)
			_, killer_id = sampGetPlayerIdByCharHandle(killer_ped)
			_, player_id = sampGetPlayerIdByCharHandle(PLAYER_PED)

			if killer_id ~= -1 and reason ~= nil and killer_id ~= nil and reason <= 46 and reason >= 0 and killer_id ~= player_id then
				killer_name = sampGetPlayerNickname(killer_id)
				uv7 = killer_id
			end

			wait(4444)
		end

		if uv3.click[0] == true then
			wait(1000 - uv8 * 2)

			uv9 = math.random(20, 600)
		end

		if isKeyDown(89) and cfg.config.da and not sampIsChatInputActive() and not isSampfuncsConsoleActive() and not sampIsDialogActive() then
			cfg.config.da = false
			cfg.config.net = false

			uv2.save(cfg, "FBIhelper")
			sampSendChat("/me тянется левой рукой в карман штанов, после чего достаёт из него телефон.")
			wait(1000)
			sampSendChat("/p")
			wait(300)
			sampSendChat("[Автоответчик] Все входящие и исходящие звонки прослушиваются и записываются.")
			wait(800)
			sampSendChat("*Звуковой сигнал*")
			wait(500)
		end

		if isKeyDown(78) and cfg.config.net and not sampIsChatInputActive() and not isSampfuncsConsoleActive() and not sampIsDialogActive() then
			cfg.config.da = false
			cfg.config.net = false

			uv2.save(cfg, "FBIhelper")
			sampSendChat("/me тянется левой рукой в карман штанов, после чего достаёт из него телефон.")
			wait(800)
			sampSendChat("/h")
			wait(800)
			sampSendChat("/sms " .. cfg.config.mobile .. " [Автоответчик] Абонент находится вне зоны действия сети")
			wait(800)
			sampSendChat("/sms " .. cfg.config.mobile .. " [Автоответчик] Повторите попытку немного позже.")
			wait(800)
			sampSendChat("/sms " .. cfg.config.mobile .. " [Автоответчик] The subscriber is out of coverage area.")
			wait(800)
			sampSendChat("/me выключив телефон, убирает его обратно в карман штанов.")
		end

		if isKeyDown(78) and isCharPlayingAnim(playerPed, "PHONE_TALK") and not sampIsChatInputActive() and not isSampfuncsConsoleActive() and not sampIsDialogActive() then
			sampSendChat("/h")
			wait(300)
			sampSendChat("/me убирает телефон обратно.")
		end

		HOTKEY.List = {
			newButton = {
				keys = HOTKEY.List.newButton and HOTKEY.List.newButton.keys or {
					78
				},
				callback = function ()
				end
			},
			editButton = {
				keys = HOTKEY.List.editButton and HOTKEY.List.editButton.keys or {},
				callback = function ()
				end
			}
		}

		for slot6, slot7 in ipairs(uv10) do
			HOTKEY.List["bind_" .. slot6] = {
				keys = slot7.button[1],
				callback = function ()
					lua_thread.create(function ()
						for slot3 in uv0.text:gmatch("[^\n]+") do
							slot4 = {
								["{name}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub("_.+", ""),
								["{surname}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub(".+_", ""),
								["{id}"] = select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)),
								["{weapon}"] = uv1.get_name(getCurrentCharWeapon(PLAYER_PED)),
								["{city}"] = getCity(getCharCoordinates(PLAYER_PED)),
								["{zone}"] = calculateZone(getCharCoordinates(PLAYER_PED)),
								["{kvadrat}"] = kvadrat(),
								["{time1}"] = getCurrentDateTime(),
								["{time2}"] = getCurrentTime(),
								["{dd}"] = getCurrentDayOfMonth(),
								["{mm}"] = getCurrentMonth(),
								["{YY}"] = getCurrentYearFull(),
								["{yy}"] = getCurrentYear(),
								["{H}"] = getCurrentHour(),
								["{M}"] = getCurrentMinutes(),
								["{S}"] = getCurrentSecundes(),
								["{day}"] = getCurrentDayOfWeekString(),
								["{month}"] = getCurrentMonthString(),
								["{id_marker}"] = uv2,
								["{name_marker}"] = sampIsPlayerConnected(uv2) and sampGetPlayerNickname(uv2):gsub("_.+", "") or "Unknown",
								["{surname_marker}"] = sampIsPlayerConnected(uv2) and sampGetPlayerNickname(uv2):gsub(".+_", "") or "Unknown",
								["{partner_ids}"] = table.concat(getPassengersIdInCar(), ", "),
								["{partner_nicks}"] = getPassengersNickInCar(),
								["{meg_c_model}"] = getMarkerVehicleModel(),
								["{color_car}"] = getMarkerVehicleColor()
							}

							if slot3 == "{F8}" then
								setVirtualKeyDown(119, true)
								wait(50)
								setVirtualKeyDown(119, false)
							elseif slot3 == "{wait100}" then
								wait(100)
							elseif slot3 == "{wait500}" then
								wait(500)
							elseif slot3 == "{wait1000}" then
								wait(1000)
							elseif slot3 == "{sms}" then
								sampSetChatInputEnabled(true)
								sampSetChatInputText("/sms " .. cfg.config.sms .. " ")
							elseif slot3 == "{ii}" then
								sampSetChatInputEnabled(true)
								sampProcessChatInput("/ii")
							elseif slot3 == "{edit}" then
								if not sampIsChatInputActive() and not isSampfuncsConsoleActive() and not sampIsDialogActive() then
									sampSendChat("/edit")
								end
							elseif slot3 == "{}" then
								setVirtualKeyDown(32, true)
								wait(50)
								setVirtualKeyDown(32, false)
							else
								sampProcessChatInput(slot3.gsub(slot3, "{.-}", slot4))
								wait(uv0.wait)
							end
						end
					end)
				end
			}
		end

		if getNearCharToCenter(200) and isKeyDown(2) and not processLineOfSight(getCharCoordinates(PLAYER_PED), getCharCoordinates(slot3), true, false, false, true, true, true, true, true) then
			slot4, slot5 = sampGetPlayerIdByCharHandle(slot3)

			if slot4 and slot5 ~= uv7 then
				uv7 = slot5
			end
		end

		while isPauseMenuActive() do
			wait(100)
		end

		if isCharInAnyCar(playerPed) and uv3.CheckBox18[0] then
			slot4, slot5 = getScreenResolution()
			slot6 = ("Press {FF00CC00}={FFFFFFFF}  FH Cruise Control %s {FFCCCCCC}Speed: {FFFFFF00}%.0f"):format(uv0 and "{FF00CC00}ON" or "{FFCC0000}OFF", uv12 * 2)

			renderDrawBox(0, slot5 - 15, renderGetFontDrawTextLength(slot2, slot6) + 10, 15, 4281479730.0)
			renderFontDrawText(slot2, slot6, 5, slot5 - 15, 4291611852.0)

			if ccts and getCarSpeed(storeCarCharIsInNoSave(playerPed)) < uv12 then
				writeMemory(12006520, 1, 255, false)
			end

			if isKeyJustPressed(187) and not sampIsChatInputActive() and not isSampfuncsConsoleActive() and not sampIsDialogActive() then
				uv0 = not uv0
				ccts = false
			end

			if isKeyJustPressed(VK_S) and uv0 and not sampIsChatInputActive() and not isSampfuncsConsoleActive() then
				ccts = false
			end

			if isKeyDown(VK_W) and uv0 and not sampIsChatInputActive() and not isSampfuncsConsoleActive() then
				uv12 = getCarSpeed(storeCarCharIsInNoSave(playerPed))
				ccts = true
			end
		end

		if isKeyJustPressed(51) and isCharInAnyCar(playerPed) and not sampIsChatInputActive() and not sampIsDialogActive() then
			sampSendChat("/setmark " .. cfg.config.smark .. "")
		end

		if isKeyDown(uv13.VK_F7) then
			sampSetChatDisplayMode(0)
		end

		if sampGetChatDisplayMode() == 1 then
			sampSetChatDisplayMode(0)
		end

		wait(0)
		removePointMarker()
	end
end

fh = function()
	uv0.mainwindow[0] = not uv0.mainwindow[0]
end

uk = function()
	uv0.uk[0] = not uv0.uk[0]
end

fhdlog = function()
	uv0.uk[0] = not uv0.uk[0]
end

vid = function()
	uv0.vid[0] = not uv0.vid[0]
end

healmesp = function()
	sampSendChat("/healme")
end

masksp = function()
	sampSendChat("/mask")
end

tsc = function()
	sampAddChatMessage("{4c4f45}[FBI Helper] {ffffff}Транспорт: " .. getClosestCarId() .. " " .. getClosestCar2Id() .. "", 16777215)
end

tax = function()
	sampAddChatMessage("{4c4f45}[FBI Helper] {ffffff}Доп. функций №1 прекрасно работает", 16777215)
end

hist = function(slot0)
	if not sampIsPlayerConnected(slot0) then
		return false
	end

	sampSendChat("/history " .. sampGetPlayerNickname(slot0) .. "")
end

tsver = function(slot0)
	sampSendChat("/sms " .. slot0 .. " tasks")
end

biz = function()
	sampSendChat("/business")
end

sm = function(slot0)
	sampSendChat("/setmark " .. slot0 .. "")
end

tf = function()
	sampSendChat("/togphone")
end

ja = function()
	sampSendChat("/jaildoor")
end

hacksp = function(slot0)
	sampSendChat("/hack " .. slot0 .. "")
end

ln = function(slot0)
	sampSendChat("/l (( " .. slot0 .. " ))")
end

a = function(slot0)
	lua_thread.create(function ()
		sampSendChat("/ticket " .. uv0 .. "")
		wait(100)
		sampSendChat("/cancel")
	end)
end

fsp = function(slot0)
	if cfg.config.CheckBox20 then
		sampSendChat("/f 2 " .. slot0 .. "")
	end
end

skipsp = function(slot0)
	sampSendChat("/skip " .. slot0 .. "")
end

susp = function(slot0)
	sampSendChat("/su " .. slot0 .. "")
end

clearsp = function(slot0)
	sampSendChat("/clear " .. slot0 .. "")
end

cuffsp = function(slot0)
	sampSendChat("/cuff " .. slot0 .. "")
end

uncuffsp = function(slot0)
	sampSendChat("/uncuff " .. slot0 .. "")
end

putplsp = function(slot0)
	sampSendChat("/putpl " .. slot0 .. "")
end

ejectsp = function(slot0)
	sampSendChat("/eject " .. slot0 .. "")
end

arrestsp = function(slot0)
	sampSendChat("/arrest " .. slot0 .. "")
end

holdsp = function(slot0)
	sampSendChat("/hold " .. slot0 .. "")
end

searchsp = function(slot0)
	sampSendChat("/search " .. slot0 .. "")
end

ticketsp = function(slot0)
	sampSendChat("/ticket " .. slot0 .. "")
end

takelicsp = function(slot0)
	sampSendChat("/takelic " .. slot0 .. "")
end

setmarksp = function(slot0)
	sampSendChat("/setmark " .. slot0 .. "")
end

rangsp = function(slot0)
	sampSendChat("/rang " .. slot0 .. "")
end

invitesp = function(slot0)
	sampSendChat("/invite " .. slot0 .. "")
end

skipsp = function(slot0)
	sampSendChat("/skip " .. slot0 .. "")
end

ii = function()
	sampSendChat("/i")
	sampSendClickTextdraw(2096)
	sampSendClickTextdraw(2100)
	sampSendClickTextdraw(2117)
end

rc = function()
	sampDisconnectWithReason()
	sampSetGamestate(1)
end

uu = function()
	for slot3 = 0, 7 do
		uv0[slot3] = false
	end
end

initializeRender = function()
	fontcw = renderCreateFont("Tahoma", 10, FCR_BOLD + FCR_BORDER)
	fontcw2 = renderCreateFont("Arial", 8, FCR_ITALICS + FCR_BORDER)
end

readFloatArray = function(slot0, slot1)
	return representIntAsFloat(readMemory(slot0 + slot1 * 4, 4, false))
end

writeFloatArray = function(slot0, slot1, slot2)
	writeMemory(slot0 + slot1 * 4, 4, representFloatAsInt(slot2), false)
end

createPointMarker = function(slot0, slot1, slot2)
	pointMarker = createUser3dMarker(slot0, slot1, slot2 + 0.3, 4)
end

removePointMarker = function()
	if pointMarker then
		removeUser3dMarker(pointMarker)

		pointMarker = nil
	end
end

onExitScript = function()
	if bubbleBox then
		bubbleBox:free()
	end
end

bgra_to_argb = function(slot0)
	slot1, slot2, slot3, slot4 = explode_argb(slot0)

	return join_argb(slot4, slot3, slot2, slot1)
end

set_argb_alpha = function(slot0, slot1)
	slot2, slot3, slot4, slot5 = explode_argb(slot0)

	return join_argb(slot1, slot3, slot4, slot5)
end

get_argb_alpha = function(slot0)
	return explode_argb(slot0)
end

argb_to_rgb = function(slot0)
	return bit.band(slot0, 16777215)
end

rb = function()
	removeBlip(uv0)
end

onScriptTerminate = function(slot0, slot1)
	if slot0 == thisScript() and uv0 then
		removeBlip(uv0)
	end
end

stm = function()
	sampAddChatMessage("{4c4f45}[FBI Helper] {FFFFFF}Не выбран ID", 16777215)
end

tsh = function()
	tshname = "{4c4f45}[TSH]{FFFFFF}"

	return tshname
end

myid = function()
	_, id = sampGetPlayerIdByCharHandle(PLAYER_PED)

	return id
end

mynick = function()
	nick = sampGetPlayerNickname(myid())

	return nick
end

nickforid = function(slot0)
	nick = sampGetPlayerNickname(slot0)

	return nick
end

unc = function()
	lua_thread.create(function ()
		sampSendChat("/do Наручники на руках человека. В заднем кармане штанов лежит отмычка.")
		wait(800)
		sampSendChat("/me залез руками в задний карман штанов, вытащил отмычку...")
		wait(800)
		sampSendChat("/do ...методом тыка обнаружил замочную скважину наручников.")
		wait(800)
		sampSendChat("/me просунул отмычку замочную скважину наручников, провернул отмычку несколько раз против часовой стрелки.")
		wait(800)
		sampSendChat("/uncuff " .. myid() .. "", main_color)
		wait(800)
		sampSendChat("/do Произошёл щелчок, после чего наручники расстягнулись и упали на землю.")
	end)
end

dor = function()
	lua_thread.create(function ()
		sampSendChat("/m Немедленно уступите дорогу автомобилю!")
	end)
end

cmd_su = function(slot0)
	if slot0 ~= nil then
		if slot0.match(slot0, "^%s*(.-)%s*$") ~= "" and not slot0.find(slot0, " ") then
			uv0 = slot0
			uv1.sus[0] = true

			sampAddChatMessage("{4c4f45}[FBI Helper] {FFFFFF}Цель выбрана. ID: " .. uv0, 5001029)

			uv2 = uv0
		elseif slot0.find(slot0, " ") then
			slot1, slot2, slot3 = slot0.match(slot0, "^(%S+)%s+(%S+)%s+(%S+)$")

			if slot1 and slot2 and slot3 then
				sampProcessChatInput("/su " .. slot1 .. " " .. slot2 .. " " .. slot3, -1)

				uv1.sus[0] = false
			end
		else
			sampAddChatMessage("{4c4f45}[FH] {FFFFFF}Используйте: {808080}/sus [id] {ffffff}для умного розыска. {808080}/su [id] [уровень] [причина] {ffffff}для обычного", 5001029)
		end
	end
end

pr = function()
	lua_thread.create(function ()
		sampSendChat("/m Водитель автомобиля, немедленно прекратите преследование!")
		wait(800)
		sampSendChat("/m Неподчинение буду рассматривать как помеху работе следственных органов.")
	end)
end

hexit = function()
	lua_thread.create(function ()
		sampAddChatMessage("{800000}[FBI Helper] {FFFFFF}Скрипт FBI Helper отключён.", 16777215)
		file:close()
	end)
end

pk = function()
	slot0, slot1, slot2 = getCharCoordinates(PLAYER_PED)

	lua_thread.create(function ()
		sampSendChat("/m Медленно выходите с высокоподнятыми руками...")
		wait(500)
		sampSendChat("/m ... подойдите к капоту своего автомобиля и сложите на него руки...")
	end)
end

pn = function()
	slot0, slot1, slot2 = getCharCoordinates(PLAYER_PED)

	lua_thread.create(function ()
		sampSendChat("/m Не выходите из своего транспортного средства...")
		wait(500)
		sampSendChat("/m ... заглушите двигатель и выбросите ключи из окна.")
	end)
end

rhelp = function()
	slot0 = {
		", Los Santos",
		", San Fierro",
		", Las Venturas",
		""
	}

	if getCityPlayerIsIn(PLAYER_HANDLE) == 0 then
		slot1 = 4
	end

	slot2, slot3, slot4 = getCharCoordinates(PLAYER_PED)

	lua_thread.create(function ()
		sampSendChat("/r Требуется подкрепление на мой трекер. 10-20: " .. calculateZone(uv0, uv1, uv2) .. "" .. uv3[uv4] .. "")
		wait(100)
		sampSendChat("/su " .. myid() .. " 2 GPS-трекер")
	end)
end

fhelp = function()
	slot0 = {
		", Los Santos",
		", San Fierro",
		", Las Venturas",
		""
	}

	if getCityPlayerIsIn(PLAYER_HANDLE) == 0 then
		slot1 = 4
	end

	slot2, slot3, slot4 = getCharCoordinates(PLAYER_PED)

	lua_thread.create(function ()
		if cfg.config.CheckBox20 then
			sampSendChat("/f 1 Требуется подкрепление на мой трекер. 10-20: " .. calculateZone(uv0, uv1, uv2) .. "" .. uv3[uv4] .. "")
		else
			sampSendChat("/f Требуется подкрепление на мой трекер. 10-20: " .. calculateZone(uv0, uv1, uv2) .. "" .. uv3[uv4] .. "")
		end

		wait(100)
		sampSendChat("/su " .. myid() .. " 2 GPS-трекер")
	end)
end

meg = function()
	lua_thread.create(function ()
		sampSendChat("/m Водитель транспортного средства, немедленно остановитесь...")
		wait(800)
		sampSendChat("/m ...прижмитесь к обочине и заглушите двигатель, руки оставьте на руле.")
		wait(800)
		sampSendChat("/m В случае неподчинения будут предприняты суровые меры по остановке.")
	end)
end

krik = function()
	lua_thread.create(function ()
		sampSendChat("Всем оставаться на своих местах, без лишних движений!")
		wait(800)
		sampSendChat("Руки за голову, лицом на землю. Не дёргайтесь, иначе я открою огонь на поражение.")
	end)
end

megsp = function()
	lua_thread.create(function ()
		sampSendChat("/s Водитель транспортного средства, немедленно остановитесь...")
		wait(1000)
		sampSendChat("/s ...прижмитесь к обочине и заглушите двигатель, руки оставьте на руле.")
	end)
end

alp = function()
	lua_thread.create(function ()
		sampSendChat("/do На плече сумка с альпинистским снаряжением.")
		wait(800)
		sampSendChat("/me снял сумку с плеча, после чего открыл её.")
		wait(800)
		sampSendChat("/do В сумке находятся пистолет и тросс с крюком.")
		wait(800)
		sampSendChat("/me закрепив тросс с крюком в пистолете, произвёл прицельный выстрел.")
		wait(500)
		sampSendChat("/break 1")
		wait(500)
		sampSendChat("/object")
		wait(500)
		sampSendChat("/me убедившись что крюк надёжно закреплён, полез наверх.")
	end)
end

alpt = function()
	lua_thread.create(function ()
		sampSendChat("/break 1")
		wait(500)
		sampSendChat("/object")
		wait(500)
		sampSendChat("/me зацепился крюком за объект, перезарядил пистолет с крюком, после...")
		wait(500)
		sampSendChat("/do ...чего совершил повторный выстрел и полез наверх.")
	end)
end

uud = function()
	slot0 = uv0.load(nil, uv1)

	math.randomseed(os.clock())
	lua_thread.create(function ()
		sampSendChat("/do В заднем кармане штанов лежит удостоверение.")
		wait(500)
		sampSendChat("/me вытащил удостоверение из кармана штанов и показал его.")
		wait(500)
		sampSendChat("/anim 21")
		wait(500)
		sampSendChat("/do На удостоверении единого типа указана информация о сотруднике.")
		wait(1200)
		sampSendChat("/do " .. uv0.config.rang .. " " .. uv0.config.org .. " | " .. uv0.config.name .. " | [№" .. math.random(10000, 999999) .. "].")
	end)
end

skip = function(slot0)
	lua_thread.create(function ()
		sampProcessChatInput("/skipsp " .. uv0 .. "")
		wait(800)
		sampSendChat("/do В заднем кармане штанов лежит пропуск.")
		wait(800)
		sampSendChat("/me потянувшись левой рукой в карман штанов, вытащил пропуск...")
		wait(800)
		sampSendChat("/do ...после чего заполнил его и передал человеку напротив.")
	end)
end

cam = function()
	lua_thread.create(function ()
		sampSendChat("/me нажатием кнопки на BODY-камере, запустил запись.")
		wait(500)
		sampSendChat("/do Камера записывает звук и видео в отличном качестве.")
	end)
end

cams = function()
	lua_thread.create(function ()
		sampSendChat("/do Камера записывает звук и видео в отличном качестве.")
		wait(500)
		sampSendChat("/me нажатием кнопки на BODY-камере, выключил запись.")
	end)
end

alps = function()
	lua_thread.create(function ()
		sampSendChat("/do Крюк прицеплен к поверхности.")
		wait(800)
		sampSendChat("/me отцепил крюк от поверхности, после чего принялся выполнять разборку пистолета.")
		wait(800)
		sampSendChat("/break 0")
		wait(800)
		sampSendChat("/me разобрав пистолет, сложил снаряжение в сумку и закрыл её...")
		wait(800)
		sampSendChat("/do ...закинул сумку с альпинистским снаряжением на плечо.")
	end)
end

dragunoff = function()
	slot0 = 163
	slot2, slot3, slot4 = getCharCoordinates(PLAYER_PED)

	requestModel(slot0)
	loadAllModelsNow()

	Dragunov = createChar(6, slot0, 1709.5700683594, 928.288, 1030)

	setCharHealth(Dragunov, 1)
	markModelAsNoLongerNeeded(slot0)
end

ton = function()
	lua_thread.create(function ()
		sampSendChat("/do Стёкла транспортного средства затонированы.")
		wait(800)
		sampSendChat("/do Двери транспортного средства заблокированы.")
		wait(800)
		sampSendChat("/do Звукопропускаемость внутри транспортного средства минимальная.")
		wait(800)
		sampSendChat("/do Микроантенна на капоте транспортного средства записывает звук.")
		wait(800)
		sampSendChat("/do Микрофон на приборной панели передаёт звук снаружи.")
		wait(1000)
		sampSendChat("/do На транспортном средстве отсутствую опозновательные знаки и гос. номер.")
	end)
end

hh = function(slot0)
	lua_thread.create(function ()
		sampSendChat("/me потянулся левой рукой в карман штанов, после чего достал из него телефон.")
		wait(800)
		sampSendChat("/h")
		wait(800)
		sampSendChat("/sms " .. uv0 .. " [Автоответчик] Абонент находится вне зоны действия сети")
		wait(800)
		sampSendChat("/sms " .. uv0 .. " [Автоответчик] Повторите попытку немного позже.")
		wait(800)
		sampSendChat("/sms " .. uv0 .. " [Автоответчик] The subscriber is out of coverage area.")
		wait(800)
		sampSendChat("/togphone")
		wait(800)
		sampSendChat("/me выключив телефон, убрал его обратно в карман штанов.")
	end)
end

pp = function()
	lua_thread.create(function ()
		sampSendChat("/me потянулся левой рукой в карман штанов, после чего достал из него телефон.")
		wait(1000)
		sampSendChat("/p")
		wait(300)
		sampSendChat("[Автоответчик] Все входящие и исходящие звонки прослушиваются и записываются.")
		wait(800)
		sampSendChat("*Звуковой сигнал*")
	end)
end

incar = function(slot0)
	lua_thread.create(function ()
		sampSendChat("/pull " .. uv0 .. "")
		wait(800)
		sampSendChat("/me со всего размаха ударил локтём по стеклу автомобиля, разбил его...")
		wait(800)
		sampSendChat("/do ...сунул руку в салон автомобиля, потянулся к ручке...")
		wait(800)
		sampSendChat("/do ... и дёрнул её, тем самым открыв дверь автомобиля.")
		wait(800)
		sampSendChat("/me схватил человека за шкирку и попытался вытащить его из автомобиля.")
	end)
end

inmoto = function(slot0)
	lua_thread.create(function ()
		sampSendChat("/me ухватился за руку водителя, после чего попытался спустить его.")
		wait(500)
		sampSendChat("/pull " .. uv0 .. "")
	end)
end

fo = function()
	lua_thread.create(function ()
		sampSendChat("/do На плече сумка с аппаратурой.")
		wait(800)
		sampSendChat("/me снял сумку с плеча, после чего открыл её и залез рукой...")
		wait(800)
		sampSendChat("/do ...вытащил наушники и радиочастотный перехватчик.")
		wait(800)
		sampSendChat("/me надел наушники и принялся обнаруживать нужную радиоволну...")
		wait(800)
		sampSendChat("/do ...и обнаружил подходящую радиоволну и подключился к ней.")
		wait(800)
		sampSendChat("/r Перехожу на другую радиочастоту, связь с агентом по номеру.")
		wait(800)
		sampSendChat("/r *Отключение рации*")
		wait(800)
		sampSendChat("/follow")
	end)
end

foff = function()
	lua_thread.create(function ()
		sampSendChat("/me отключился от волны, после чего снял наушники.")
		wait(800)
		sampSendChat("/follow")
		wait(800)
		sampSendChat("/r *Включение рации*")
	end)
end

nar = function()
	lua_thread.create(function ()
		sampSendChat("/do У гражданина был найден свёрток с неизвестными веществом.")
		wait(500)
		sampAddChatMessage("{800000}[Диспетчер Анна] {FFFFFF}Сейчас необходимо изъять наркотики вручную. И узнать тип вещества в /do.", 16777215)
		wait(300)
		sampSendChat("/me потянулся в левый карман штанов, после чего вытащил из него пакет...")
		wait(800)
		sampSendChat("/do ...вытащил свёрток с неизвестным веществом из кармана гражданина.")
		wait(800)
		sampSendChat("/me открыл пакетик для улик и сложил в него свёрток с неизвестным веществом.")
	end)
end

mask = function()
	lua_thread.create(function ()
		sampSendChat("/do В заднем кармане штанов маска.")
		wait(500)
		sampSendChat("/me потянувшись в карман штанов, вытащил маску, затем натянул её на лицо.")
		wait(500)
		sampSendChat("/mask")
	end)
end

healme = function()
	lua_thread.create(function ()
		sampSendChat("/do В заднем кармане штанов шприц с обезбаливающим.")
		wait(500)
		sampSendChat("/me потянувшись в карман штанов, вытащил шприц и кольнул шприцом в рану.")
		wait(500)
		sampSendChat("/healme")
	end)
end

pt = function()
	lua_thread.create(function ()
		sampSendChat("/do У гражданина было найдено определённое количество патронов.")
		wait(500)
		sampAddChatMessage("{800000}[Диспетчер Анна] {FFFFFF}Сейчас необходимо изъять патроны вручную.", 16777215)
		wait(300)
		sampSendChat("/me потянулся в левый карман штанов, после чего вытащил из него пакетик...")
		wait(800)
		sampSendChat("/do ...вытащил все патроны из кармана гражданина.")
		wait(800)
		sampSendChat("/me открыл пакетик для улик и сложил в него патроны.")
	end)
end

ot = function()
	lua_thread.create(function ()
		sampSendChat("/me обнаружил в руках у человека отмычку, затем, резким движением...")
		wait(100)
		sampSendChat("/do ...руки, выхватил отмычку из рук человека и убрал в карман.")
		wait(1000)
		sampSendChat("/jaildoor")
		wait(500)
		sampSendChat("/jaildoor")
	end)
end

hack = function(slot0)
	lua_thread.create(function ()
		sampSendChat("/do В заднем кармане штанов отмычка.")
		wait(800)
		sampSendChat("/me потянулся в карман и вытащил отмычку, затем сунул её в замочную...")
		wait(800)
		sampSendChat("/do ...скважину и провернул её.")
		wait(800)
		sampSendChat("/hack " .. uv0 .. "", main_color)
	end)
end

cs = function()
	slot0 = uv0.load(nil, uv1)

	lua_thread.create(function ()
		sampSendChat("/changeskin " .. myid() .. "")
		wait(500)
		sampSendChat("/do В руке пакет с формой сотрудников " .. uv0.config.org .. "")
		wait(500)
		sampSendChat("/me открыл пакет с формой, после чего вытащил новую форму и переоделся, затем...")
		wait(500)
		sampSendChat("/do ...сложил старую форму в пакет и закрыл его.")
	end)
end

css = function(slot0)
	slot1 = uv0.load(nil, uv1)

	lua_thread.create(function ()
		sampAddChatMessage("{800000}[Диспетчер Анна] {FFFFFF}Подождите, агент должен взять пакет с формой.", 16777215)
		sampSendChat("/changeskin " .. uv0 .. "")
		wait(500)
		sampSendChat("/do В руке пакет с формой сотрудников " .. uv1.config.org .. "")
		wait(500)
		sampSendChat("/me передал пакет с формой человеку напротив.")
	end)
end

invite = function(slot0)
	slot1 = uv0.load(nil, uv1)

	lua_thread.create(function ()
		sampSendChat("/do В левой руке пакет с рацией и комплектом формы.")
		wait(800)
		sampSendChat("/me передал пакет человеку напротив.")
		wait(800)
		sampSendChat("/invite " .. uv0 .. "", main_color)
	end)
end

gg = function()
	lua_thread.create(function ()
		sampSendChat("/me вытащив документы из кармана штанов, предъявил их человеку напротив.")
		wait(1000)
		sampSendChat("/anim 21")
		wait(1000)
		sampSendChat("Вы вынуждены проехать с нами, не оказывайте излишнего сопротивления.")
	end)
end

mir = function()
	lua_thread.create(function ()
		sampSendChat("Вы имеете право хранить молчание. Всё, что вы скажете, может и будет...")
		wait(1200)
		sampSendChat("...использовано против Вас. Имеете право на один телефонный звонок.")
		wait(1200)
		sampSendChat("Также Вы имеете право на адвоката. Если вам необходим адвокат, он будет...")
		wait(1000)
		sampSendChat("...для Вас запрошен. Вы понимаете свои права?")
	end)
end

su = function(slot0)
	slot1 = uv0.load(nil, uv1)

	lua_thread.create(function ()
		sampProcessChatInput("/susp " .. uv0 .. "", main_color)
		wait(400)
		sampSendChat("/do В левом ухе гарнитура настроенная на волну " .. uv1.config.org .. ".")
		wait(800)
		sampSendChat("/me зажав кнопку на гарнитуре, сообщил диспетчеру данные нарушителя и объявил в розыск")
	end)
end

f = function(slot0)
	if cfg.config.CheckBox20 then
		sampSendChat("/f 1 " .. cfg.config.ftag .. " " .. slot0 .. "")
	else
		sampSendChat("/f " .. cfg.config.ftag .. " " .. slot0 .. "")
	end
end

r = function(slot0)
	sampSendChat("/r " .. cfg.config.rtag .. " " .. slot0 .. "")
end

checkname = function()
	slot6 = 10

	renderFontDrawText(renderCreateFont("Arial", 10, 9), "{4c4f45} Контакты онлайн:\n", slot6, getScreenResolution() / 2 - 600 - 10, 4294967295.0)

	for slot6 = 0, 1004 do
		if sampIsPlayerConnected(slot6) then
			playername = sampGetPlayerNickname(slot6)
			playername = playername:gsub("_", " ")
			a, r, g, b = explode_argb(sampGetPlayerColor(slot6))
			tgds = explode_argb(sampGetPlayerColor(slot6))

			if sampGetPlayerColor(slot6) == 4278190335.0 and sampGetPlayerScore(slot6) ~= 0 then
				renderFontDrawText(slot0, "{0000fe} " .. playername .. "(" .. slot6 .. ")\n", 10, slot2 + 18, 4294967295.0)
			end

			if tgds == 0 and sampGetPlayerScore(slot6) ~= 0 then
				renderFontDrawText(slot0, "{FFFFFF} " .. playername .. "(" .. slot6 .. ")\n", 10, slot2 + 18, 4294967295.0)
			end

			uv0 = uv0 + 1
		end
	end
end

uncuff = function(slot0)
	lua_thread.create(function ()
		sampSendChat("/me вытащил из кармана штанов ключ, просунул ключ в замок и провернул...")
		wait(800)
		sampSendChat("/do ...расстегнул наручники, после чего снял их и убрал в левый карман штанов.")
		wait(800)
		sampSendChat("/uncuff " .. uv0 .. "", main_color)
	end)
end

cf = function(slot0)
	lua_thread.create(function ()
		sampSendChat("/uncuff " .. uv0 .. "", main_color)
		wait(100)
		sampSendChat("/cuff " .. uv0 .. "", main_color)
		wait(500)
		sampSendChat("/n откат снятия наручников")
	end)
end

cuff = function(slot0)
	lua_thread.create(function ()
		sampSendChat("/me потянулся в левый карман, затем резким движением руки вытащил наручники...")
		wait(800)
		sampSendChat("/cuff " .. uv0 .. "", main_color)
		wait(800)
		sampSendChat("/do ...заломав руки человека, застегнул наручники.")
	end)
end

hold = function(slot0)
	lua_thread.create(function ()
		sampSendChat("/hold " .. uv0 .. "", main_color)
		wait(100)
		sampSendChat("/me заломал руки человека и повёл его вперёд.")
	end)
end

require("samp.events").onServerMessage = function (slot0, slot1)
	chname = sampGetPlayerNickname(myid())
	kname = sampGetPlayerNickname(myid())
	chname = chname:gsub("_", " ")

	if slot1:match("%w+_%w+ ужинает") then
		return false
	end

	if slot1.match(slot1, "%w+_%w+ ужинает") then
		return false
	end

	if slot1.match(slot1, "%w+_%w+ обедает") then
		return false
	end

	if slot1.match(slot1, "%w+_%w+ завтракает") then
		return false
	end

	if slot1.match(slot1, "Используйте {6699FF}/eat {CECECE}чтобы поесть или {6699FF}/put {CECECE}чтобы положить поднос с едой") then
		return false
	end

	if slot1.match(slot1, "%w+_%w+ взял шоколадный торт с какао") then
		return false
	end

	if slot1.match(slot1, "Не удается отправить сообщение. Телефон абонента недоступен") then
		return false
	end

	if slot1.match(slot1, "%w+_%w+ взял крендель с корицей и чай") then
		return false
	end

	if slot1.match(slot1, "Чтобы зачесть прогресс по этому заданию в /tasks, повторите действие с") then
		return false
	end

	if slot1.match(slot1, "%w+_%w+ взял слойку с творогом и кофе") then
		return false
	end

	if slot1.match(slot1, "%w+_%w+ взял булочку с компотом") then
		return false
	end

	if slot1.match(slot1, "%w+_%w+ взял пирожок со сгущёнкой и колу") then
		return false
	end

	if slot1.match(slot1, "%w+_%w+ взял бутерброд с яблочным соком") then
		return false
	end

	if slot1.match(slot1, "%w+_%w+ взял пирожное с чаем") then
		return false
	end

	if slot1.match(slot1, "%w+_%w+ взял пончик с кофе") then
		return false
	end

	if slot1.match(slot1, "В данный момент Вам ничего не предлагают") then
		return false
	end

	if slot1.match(slot1, "%w+_%w+ взял печенье с капучино") then
		return false
	end

	if slot1.match(slot1, "%w+_%w+ взяла шоколадный торт с какао") then
		return false
	end

	if slot1.match(slot1, "%w+_%w+ взяла крендель с корицей и чай") then
		return false
	end

	if slot1.match(slot1, "%w+_%w+ взяла слойку с творогом и кофе") then
		return false
	end

	if slot1.match(slot1, "%w+_%w+ взяла булочку с компотом") then
		return false
	end

	if slot1.match(slot1, "%w+_%w+ взяла пирожок со сгущёнкой и колу") then
		return false
	end

	if slot1.match(slot1, "%w+_%w+ взяла бутерброд с яблочным соком") then
		return false
	end

	if slot1.match(slot1, "%w+_%w+ взяла пирожное с чаем") then
		return false
	end

	if slot1.match(slot1, "%w+_%w+ взяла пончик с кофе") then
		return false
	end

	if slot1.match(slot1, "%w+_%w+ взяла печенье с капучино") then
		return false
	end

	if slot1.match(slot1, "Чтобы убрать наушники, введите {FF9900}/head") then
		sampSendChat("/head")
	end

	if slot1.match(slot1, "спaвн романчика") then
		dragunoff()
	end

	if slot1.match(slot1, "%[F] Таксист") and cfg.config.CheckBox20 then
		return false
	end

	if slot1.match(slot1, "%[F] Водитель автобуса") and cfg.config.CheckBox20 then
		return false
	end

	if slot1.match(slot1, "%[F] Машинист") and cfg.config.CheckBox20 then
		return false
	end

	if slot1.match(slot1, "%[F] Водитель трамвая") and cfg.config.CheckBox20 then
		return false
	end

	if slot1.match(slot1, "%[F] Автомеханик") and cfg.config.CheckBox20 then
		return false
	end

	if slot1.match(slot1, "%[F] Уличный торговец") and cfg.config.CheckBox20 then
		return false
	end

	if slot1.match(slot1, "%[F] Пожарный") and cfg.config.CheckBox20 then
		return false
	end

	if slot1.match(slot1, "%[F] Пилот") and cfg.config.CheckBox20 then
		return false
	end

	if slot1.match(slot1, "%Ваше объявление было добавлено в очередь для публикации") then
		return false
	end

	if slot1.match(slot1, "%Оставайтесь на связи, в противном случае объявление будет удалено из очереди") then
		return false
	end

	if slot1.match(slot1, "%Вы можете ускорить его публикацию") then
		return false
	end

	if slot1.match(slot1, "Сейчас у Вас аптечек: {33cc33}0 шт.") then
		sampSendDialogResponse(373, 1, 4)
		sampSendChat("/buy")
	end

	if slot1.match(slot1, "Сейчас у Вас аптечек: {33cc33}1 шт.") then
		sampSendDialogResponse(373, 1, 3)
		sampSendChat("/buy")
	end

	if slot1.match(slot1, "Сейчас у Вас аптечек: {33cc33}2 шт.") then
		sampSendDialogResponse(373, 1, 2)
		sampSendChat("/buy")
	end

	if slot1.match(slot1, "Сейчас у Вас аптечек: {33cc33}3 шт.") then
		sampSendDialogResponse(373, 1, 1)
		sampSendChat("/buy")
	end

	if slot1.match(slot1, "Сейчас у Вас аптечек: {33cc33}4 шт.") then
		sampSendDialogResponse(373, 1, 0)
		sampSendChat("/buy")
	end

	if slot1.match(slot1, "Сейчас у Вас аптечек: {33cc33}5 шт.") then
		sampSendDialogResponse(373, 1, 4)
		sampSendChat("/buy")
	end

	if slot1.match(slot1, "Сейчас у Вас аптечек: {33cc33}6 шт.") then
		sampSendDialogResponse(373, 1, 3)
		sampSendChat("/buy")
	end

	if slot1.match(slot1, "Сейчас у Вас аптечек: {33cc33}7 шт.") then
		sampSendDialogResponse(373, 1, 2)
		sampSendChat("/buy")
	end

	if slot1.match(slot1, "Сейчас у Вас аптечек: {33cc33}8 шт.") then
		sampSendDialogResponse(373, 1, 1)
		sampSendChat("/buy")
	end

	if slot1.match(slot1, "Сейчас у Вас аптечек: {33cc33}9 шт.") then
		sampSendDialogResponse(373, 1, 0)
		sampSendChat("/buy")
	end

	if slot1.match(slot1, "Сейчас у Вас аптечек: {33cc33}10 шт.") then
		sampSendDialogResponse(373, 1, 0)
		sampSendChat("/buy")
	end

	if slot1.match(slot1, "Сейчас у Вас масок: {33cc33}0 шт.") then
		sampSendDialogResponse(374, 1, 2)
		sampSendChat("/buy")
	end

	if slot1.match(slot1, "Сейчас у Вас масок: {33cc33}1 шт.") then
		sampSendDialogResponse(374, 1, 1)
		sampSendChat("/buy")
	end

	if slot1.match(slot1, "Сейчас у Вас масок: {33cc33}2 шт.") then
		sampSendDialogResponse(374, 1, 0)
		sampSendChat("/buy")
	end

	if slot1.match(slot1, "Сейчас у Вас масок: {33cc33}3 шт.") then
		sampSendDialogResponse(374, 1, 2)
		sampSendChat("/buy")
	end

	if slot1.match(slot1, "Сейчас у Вас масок: {33cc33}4 шт.") then
		sampSendDialogResponse(374, 1, 1)
		sampSendChat("/buy")
	end

	if slot1.match(slot1, "Сейчас у Вас масок: {33cc33}5 шт.") then
		sampSendDialogResponse(374, 1, 0)
		sampSendChat("/buy")
	end

	if slot1.match(slot1, "Сейчас у Вас масок: {33cc33}6 шт.") then
		sampSendDialogResponse(374, 1, 0)
		sampSendChat("/buy")
	end

	if slot1.match(slot1, "Вы купили ремкомплект") then
		sampSendChat("/buy")
		sampSendDialogResponse(101, 1, 12)
	end

	if slot1.match(slot1, "Вы можете проверить номер в очереди командой {FFCD00}/ad") and cfg.config.smiup then
		sampSendChat("/up")
	end

	if string.match(slot1, "  Объявление проверил сотрудник СМИ") and cfg.config.CheckBox8 then
		return false
	end

	if string.match(slot1, "| Отправил ") and cfg.config.CheckBox8 then
		return false
	end

	if string.match(slot1, "[F]") and cfg.config.CheckBox9 then
		return false
	end

	if string.match(slot1, "[G]") and cfg.config.CheckBox10 then
		return false
	end

	if string.match(slot1, " Агитатор ") and cfg.config.CheckBox11 then
		return false
	end

	if string.match(slot1, " Волонтёр ") and cfg.config.CheckBox11 then
		return false
	end

	if slot1.match(slot1, "Trofim_Shcherbakov смотрит на часы марки «FH Dev» с гравировкой «Tsidex System».") then
		math.randomseed(os.clock())

		return {
			slot0,
			"Trofim_Shcherbakov смотрит на часы марки {" .. math.random(55, 99) .. "" .. math.random(10, 99) .. "" .. math.random(10, 99) .. "}«FH Dev»{dd90ff} с гравировкой «" .. chname .. "»."
		}
	end

	if slot1.match(slot1, "Mark_Travmatov смотрит на часы марки «Rolex» с гравировкой «Riley System».") or slot1.match(slot1, "Mark_Travmatov смотрит на часы") then
		math.randomseed(os.clock())

		return {
			slot0,
			"Mark_Travmatov смотрит на часы марки {" .. math.random(55, 99) .. "" .. math.random(10, 99) .. "" .. math.random(10, 99) .. "}«Rolex»{dd90ff} с гравировкой «Riley System»."
		}
	end

	if slot1.match(slot1, "Используйте {00CC00}/p {FFFFFF}чтобы ответить или {FF6600}/h {FFFFFF}чтобы отклонить вызов") then
		return {
			slot0,
			"Используйте {00CC00}Y {FFFFFF}чтобы ответить или {FF6600}N {FFFFFF}чтобы отклонить вызов"
		}
	end

	slot2, slot3, slot4, slot5, slot6 = slot1.match(slot1, "(.-)%s(.*)%s%|%sОтправил%s(%w+_%w+)%[(%d+)%]%s%(тел%.%s(%d+)%)")

	if slot3 and slot4 == "" .. sampGetPlayerNickname(myid()) .. "" and cfg.config.CheckBox29 and not cfg.config.CheckBox8 then
		sampAddChatMessage("{01cc00}" .. slot2 .. " " .. slot3 .. " | Отправил {FFFFFF}" .. slot4 .. "[" .. slot5 .. "] (тел. " .. slot6 .. ")", 117760)
		sampProcessChatInput("/ad " .. slot2 .. " " .. slot3 .. "")
	end

	slot7, slot8, slot9 = slot1.match(slot1, "SMS%:%s(.*)%s|%sОтправитель%:%s(%w+_%w+)%s%[т%.(%d+)%]")

	if slot8 and slot9 then
		cfg.config.sms = uv0:decode(slot9)

		uv1.save(cfg, "FBIhelper")
	end

	slot10, slot11, slot12 = slot1.match(slot1, "%На дисплее данные и координаты дела №(%d+) - (.+) (.+)")

	if slot10 and isCharInAnyCar(playerPed) then
		if slot12 == "(" .. sampGetPlayerNickname(myid()) .. ")" then
			return false
		else
			lua_thread.create(function ()
				wait(100)
				sampAddChatMessage("{4c4f45}[FBI Helper] {FFFFFF} Напарник получил данные о №" .. uv0 .. " " .. uv1 .. " Нажмите \"3\" для получения данных.", 16777215)

				cfg.config.smark = uv2:decode(uv0)

				uv3.save(cfg, "FBIhelper")
			end)
		end
	end

	if slot1.match(slot1, "%[(%d+)] был обнаружен в районе") then
		if not sampIsPlayerConnected(slot13) then
			return false
		end

		sampSendChat("/me вносит данные в бортовой компьютер, получает результат на дисплей.")
		sampSendChat("/do На дисплее данные и координаты дела №" .. slot13 .. " - " .. sampGetPlayerNickname(slot13):gsub("_", " ") .. ".")
	end

	if slot1.find(slot1, "Ваше месторасположение на GPS скрыто на {cc99ff}10 минут") and cfg.config.CheckBox5 then
		sampSendChat("/reset")
	end
end

if cfg.config.CheckBox6 then
	slot8.onSendCommand = function(slot0)
		if bi then
			bi = false

			return
		end

		slot1, slot2 = slot0.match(slot0, "/(%S*) (.*)")

		if slot2 == nil then
			return
		end

		if (slot1.lower(slot1) == "me" or slot1 == "do") and slot2.len(slot2) > 75 then
			divide(slot2, "/" .. slot1 .. " ", "", "ext")

			return false
		end

		if slot1 == "sms" then
			slot3 = "{}" .. slot2
			slot4, slot5 = slot3:match("{}(%d+) (.*)")
			slot6 = slot3:sub(3)

			if slot5 == nil then
				for slot10 = 1, 99 do
					if sampGetChatString(slot10):match("SMS: .* | .*: (.*)") ~= nil then
						slot4 = string.match(slot11, ".* %[.*%.(%d+)%]")
					end
				end
			else
				slot6 = slot5
			end

			if slot4 == nil then
				return
			end

			if slot6.len(slot6) > 66 then
				divide(slot6, "/sms " .. slot4 .. " ", "", "sms")

				return false
			end

			if slot7 < 66 then
				bi = true

				sampSendChat("/sms " .. slot4 .. " " .. slot6)

				return false
			end
		end
	end

	slot8.onSendChat = function(slot0)
		if bi then
			bi = false

			return
		end

		if slot0.len(slot0) > 90 then
			divide(slot0, "", "")

			return false
		end
	end

	divide = function(slot0, slot1, slot2, slot3)
		if slot3 == "sms" then
			limit = 57
		else
			limit = 72
		end

		slot4, slot5 = string.match(slot0.sub(slot0, 1, limit), "(.*) (.*)")

		if slot5 == nil then
			slot5 = ""
		end

		slot7 = "..." .. slot5 .. slot0.sub(slot0, limit + 1, slot0.len(slot0))
		bi = true

		sampSendChat(slot1 .. (slot4 .. "...") .. slot2)

		if slot3 == "ext" then
			slot1 = "/do "

			if slot7.sub(slot7, -1) ~= "." then
				slot7 = slot7 .. "."
			end
		end

		bi = true

		sampSendChat(slot1 .. slot7 .. slot2)
	end
end

putpl = function(slot0)
	lua_thread.create(function ()
		sampSendChat("/me потянулся к дверной ручке автомобиля и открыл дверь, усадил человека...")
		wait(800)
		sampSendChat("/putpl " .. uv0 .. "", main_color)
		wait(800)
		sampSendChat("/do ...затем, захлопнул за ним дверь.")
	end)
end

mon = function()
	lua_thread.create(function ()
		sampSendChat("" .. GetLettersFromName(tonumber(myid())) .. "")
		wait(500)
		sampSendChat("/do GPS-трекер в часах агента определил голосовую команду и активировался.")
		wait(500)
		sampSendChat("/su " .. myid() .. " 2 GPS-трекер", main_color)
	end)
end

pg = function(slot0)
	lua_thread.create(function ()
		sampSendChat("/me зажав кнопку на гарнитуре, сообщил диспетчеру данные нарушителя.")
		wait(100)
		sampProcessChatInput("/susp " .. uv0 .. " 3 9.1 УК")
	end)
end

moff = function()
	lua_thread.create(function ()
		sampSendChat("/do В правом кармане штанов лежит активированный GPS-трекер.")
		wait(500)
		sampSendChat("/me залез рукой в карман и деактивировал GPS-трекер нажатием кнопки.")
		wait(500)
		sampSendChat("/clear " .. myid() .. " GPS-OFF", main_color)
	end)
end

eject = function(slot0)
	lua_thread.create(function ()
		sampSendChat("/me потянулся к дверной ручке транспортного средства и открыл дверь...")
		wait(500)
		sampSendChat("/do ...вышел из транспортного средства и помог человеку из него, сел обратно.")
		wait(500)
		sampSendChat("/eject " .. uv0 .. "", main_color)
		wait(1000)
		sampAddChatMessage("{800000}[FBI Helper] {FFFFFF}Если Вы вытащили человека в наручниках, следует /cf id, иначе человек застрянет!", 16777215)
	end)
end

ticket = function(slot0)
	lua_thread.create(function ()
		sampSendChat("/do В кармане штанов лежит блокнот для записей и авторучка.")
		wait(1000)
		sampSendChat("/me потянулся в карман штанов и вытащил блокнот с авторучкой...")
		wait(1000)
		sampSendChat("/do ...заполнил бланк на выдачу штрафа, вырвал бланк из блокнота.")
		wait(1000)
		sampSendChat("/me протянул бланк человеку напротив.")
		wait(1000)
		sampSendChat("/ticket " .. uv0 .. "", main_color)
		wait(1000)
		sampSendChat("/todo Передав бланк человеку и, указав поле для ввода*Вот здесь распишитесь.")
	end)
end

takelic = function(slot0)
	lua_thread.create(function ()
		sampSendChat("/me достал КПК, после чего включил его и зашёл в базу данных, затем...")
		wait(1000)
		sampSendChat("/do ...получил результат и зафиксировал предупреждение в личном деле.")
		wait(1000)
		sampSendChat("/takelic " .. uv0 .. "", main_color)
	end)
end

sos = function()
	lua_thread.create(function ()
		sampShowDialog(234242, "Красная кнопка", [[
Данная функция активирует оповещение всего МВД
подтвердите тревогу

 (будет зафлужен чат)]], "Верно", "Отмена", 0)

		while sampIsDialogActive(234242) do
			wait(100)
		end

		slot0, slot1, slot2, slot3 = sampHasDialogRespond(234242)

		if slot1 == 1 then
			slot4 = {
				", Los Santos",
				", San Fierro",
				", Las Venturas",
				""
			}

			if getCityPlayerIsIn(PLAYER_HANDLE) == 0 then
				slot5 = 4
			end

			slot6, slot7, slot8 = getCharCoordinates(PLAYER_PED)

			sampSendChat("/do В правом кармане штанов лежит неактивированный жучок на случай похищения.")
			wait(1000)
			sampSendChat("/me залез рукой в карман и активировал жучок нажатием кнопки.")
			wait(1000)
			sampSendChat("/su " .. myid() .. " 2 SOS (Похищение/Теракт)", main_color)
			wait(1200)
			sampSendChat("/do Система QSM активирована.")
			wait(1200)

			if cfg.config.CheckBox20 then
				sampSendChat("/f 1 [Система QSM] 10-20: " .. calculateZone(slot6, slot7, slot8) .. "" .. slot4[slot5] .. "")
				wait(1200)
				sampSendChat("/f 1 [Система QSM] Уровень угрозы: Красный (Критический)")
				wait(1200)
				sampSendChat("/f 1 [Система QSM] У ближайшей группы реагирования есть две минуты.")
				wait(1200)
				sampSendChat("/r [Система QSM] Осуществляется похищение/теракт!")
				wait(1200)
				sampSendChat("/r [Система QSM] 10-20: " .. calculateZone(slot6, slot7, slot8) .. "" .. slot4[slot5] .. "")
				wait(1200)
				sampSendChat("/r [Система QSM] У ближайшей группы реагирования есть две минуты.")
			else
				sampSendChat("/f [Система QSM] 10-20: " .. calculateZone(slot6, slot7, slot8) .. "" .. slot4[slot5] .. "")
				wait(1200)
				sampSendChat("/f [Система QSM] Уровень угрозы: Красный (Критический)")
				wait(1200)
				sampSendChat("/f [Система QSM] У ближайшей группы реагирования есть две минуты.")
				wait(1200)
				sampSendChat("/r [Система QSM] Осуществляется похищение/теракт!")
				wait(1200)
				sampSendChat("/r [Система QSM] 10-20: " .. calculateZone(slot6, slot7, slot8) .. "" .. slot4[slot5] .. "")
				wait(1200)
				sampSendChat("/r [Система QSM] У ближайшей группы реагирования есть две минуты.")
			end

			wait(1200)
			sampSendChat("/su " .. myid() .. " 2 SOS (Похищение/Теракт)", main_color)
		end
	end)
end

qsm = function()
	lua_thread.create(function ()
		sampShowDialog(234242, "Красная кнопка", [[
Данная функция активирует оповещение всего МВД
подтвердите тревогу

 (будет зафлужен чат)]], "Верно", "Отмена", 0)

		while sampIsDialogActive(234242) do
			wait(100)
		end

		slot0, slot1, slot2, slot3 = sampHasDialogRespond(234242)

		if slot1 == 1 then
			slot4 = {
				", Los Santos",
				", San Fierro",
				", Las Venturas",
				""
			}

			if getCityPlayerIsIn(PLAYER_HANDLE) == 0 then
				slot5 = 4
			end

			slot6, slot7, slot8 = getCharCoordinates(PLAYER_PED)

			sampSendChat("/do В передней панели автомобиля установлена зелёная кнопка.")
			wait(1200)
			sampSendChat("/me резким движением нажал на кнопку, после чего пошёл сигнал.")
			wait(1200)
			sampSendChat("/su " .. myid() .. " 2 SOS (Похищение/Теракт)", main_color)
			wait(1200)
			sampSendChat("/do Система QSM активирована, автомобиль заблокирован.")
			wait(1200)

			if cfg.config.CheckBox20 then
				sampSendChat("/f 1 [Система QSM] 10-20: " .. calculateZone(slot6, slot7, slot8) .. "" .. slot4[slot5] .. "")
				wait(1200)
				sampSendChat("/f 1 [Система QSM] Уровень угрозы: Красный (Критический)")
				wait(1200)
				sampSendChat("/f 1 [Система QSM] У ближайшей группы реагирования есть две минуты.")
				wait(1200)
				sampSendChat("/r [Система QSM] Осуществляется похищение/теракт!")
				wait(1200)
				sampSendChat("/r [Система QSM] 10-20: " .. calculateZone(slot6, slot7, slot8) .. "" .. slot4[slot5] .. "")
				wait(1200)
				sampSendChat("/r [Система QSM] У ближайшей группы реагирования есть две минуты.")
			else
				sampSendChat("/f [Система QSM] 10-20: " .. calculateZone(slot6, slot7, slot8) .. "" .. slot4[slot5] .. "")
				wait(1200)
				sampSendChat("/f [Система QSM] Уровень угрозы: Красный (Критический)")
				wait(1200)
				sampSendChat("/f [Система QSM] У ближайшей группы реагирования есть две минуты.")
				wait(1200)
				sampSendChat("/r [Система QSM] Осуществляется похищение/теракт!")
				wait(1200)
				sampSendChat("/r [Система QSM] 10-20: " .. calculateZone(slot6, slot7, slot8) .. "" .. slot4[slot5] .. "")
				wait(1200)
				sampSendChat("/r [Система QSM] У ближайшей группы реагирования есть две минуты.")
			end

			wait(1200)
			sampSendChat("/su " .. myid() .. " 2 SOS (Похищение/Теракт)", main_color)
		end
	end)
end

fb = function()
	lua_thread.create(function ()
		sampSendChat("/buy")
		sampSendDialogResponse(101, 1, 3)
		wait(800)
		sampSendDialogResponse(101, 1, 10)
		wait(800)
		sampSendDialogResponse(101, 1, 12)
		wait(800)
		sampSendDialogResponse(101, 1, 12)
	end)
end

jt = function()
	lua_thread.create(function ()
		sampSendChat("/jaildoor")
		wait(50)
		sampSendDialogResponse(467, 1, 0)
		wait(250)
		sampSendChat("/jaildoor")
		wait(50)
		sampSendDialogResponse(467, 1, 1)
		wait(500)
		setVirtualKeyDown(27, true)
		wait(20)
		setVirtualKeyDown(27, false)
	end)
end

getClosestPlayerId = function()
	slot0 = -1
	mydist = 30
	slot1, slot2, slot3 = getCharCoordinates(PLAYER_PED)

	for slot7 = 0, 999 do
		slot8, slot9 = sampGetCharHandleBySampPlayerId(slot7)

		if slot8 and getCharHealth(slot9) > 0 and not sampIsPlayerPaused(slot9) then
			slot10, slot11, slot12 = getCharCoordinates(slot9)

			if getDistanceBetweenCoords3d(slot1, slot2, slot3, slot10, slot11, slot12) <= mydist then
				mydist = slot13
				slot0 = slot7
			end
		end
	end

	return slot0
end

getClosestCarId = function()
	slot0 = 9999
	slot1 = -1
	slot2, slot3, slot4 = getCharCoordinates(PLAYER_PED)

	for slot8, slot9 in ipairs(getAllVehicles()) do
		slot10, slot11, slot12 = getCarCoordinates(slot9)

		if math.sqrt((slot10 - slot2)^2 + (slot11 - slot3)^2 + (slot12 - slot4)^2) < slot0 then
			slot0 = slot13
			slot1 = getCarModel(slot9)
		end
	end

	return slot1
end

getClosestCar2Id = function()
	slot0 = 9999
	slot1 = -1
	slot2, slot3, slot4 = getCharCoordinates(PLAYER_PED)

	for slot8 = 0, 1800 do
		slot9, slot10 = sampGetCarHandleBySampVehicleId(slot8)

		if slot9 then
			slot11, slot12, slot13 = getCarCoordinates(slot10)

			if math.sqrt((slot11 - slot2)^2 + (slot12 - slot3)^2 + (slot13 - slot4)^2) < slot0 then
				slot0 = slot14
				slot1 = slot8
			end
		end
	end

	return slot1
end

slot8.onShowDialog = function(slot0, slot1, slot2, slot3, slot4, slot5)
	sampfuncsLog("Dialogid - " .. slot0)

	slot6 = uv0.load(nil, uv1)

	if slot5.match(slot5, "Ваше объявление находится на (%d+) месте в очереди") then
		lua_thread.create(function ()
			wait(30)
			sampCloseCurrentDialogWithButton(0)
			printStringNow("~y~ Not /up. Num /ad - " .. uv0 .. "", 2000)
		end)
	end

	if slot5.match(slot5, "Вы повысили приоритет своего объявления") then
		lua_thread.create(function ()
			wait(30)
			sampCloseCurrentDialogWithButton(0)
			sampAddChatMessage("{4c4f45}[FBI Helper] {FFFFFF}Вы повысили приоритет своего объявления с помощью Auto /up", 16777215)
		end)
	end

	slot9, slot10 = slot5.match(slot5, "Время в игре сегодня:\t\t{ffcc00}(%d+) ч (%d+) мин")
	slot11, slot12 = slot5.match(slot5, "AFK за сегодня:\t\t{FF7000}(%d+) ч (%d+) мин")

	if slot9 and slot12 then
		slot15 = slot9 * 60 + slot10 - (slot11 * 60 + slot12)

		sampAddChatMessage("{4c4f45}[FBI Helper] {FFFFFF}Чистый онлайн за сегодня: " .. math.floor(slot15 / 60) .. " ч " .. slot15 % 60 .. " мин.", 16777215)
	end

	if slot0 == 175 and sampGetPlayerArmor(myid()) == 0 and slot6.config.CheckBox4 then
		sampSendDialogResponse(175, 1, 3)
		sampSendDialogResponse(175, 1, 4)

		if slot6.config.Gunbox1 then
			sampSendDialogResponse(175, 1, 0)
		end

		if slot6.config.Gunbox2 then
			sampSendDialogResponse(175, 1, 1)
		end

		if slot6.config.Gunbox3 then
			sampSendDialogResponse(175, 1, 5)
		end

		if slot6.config.Gunbox4 then
			sampSendDialogResponse(175, 1, 6)
		end

		if slot6.config.Gunbox5 then
			sampSendDialogResponse(175, 1, 7)
		end

		if slot6.config.Gunbox6 then
			sampSendDialogResponse(175, 1, 8)
		end

		if slot6.config.Gunbox7 then
			sampSendDialogResponse(175, 1, 9)
		end

		if slot6.config.Gunbox8 then
			sampSendDialogResponse(175, 1, 10)
		end

		if slot6.config.Gunbox9 then
			sampSendDialogResponse(175, 1, 11)
		end
	end

	if slot0 == 586 and slot6.config.CheckBox20 then
		sampSendDialogResponse(586, 1, 0)
	end

	if slot0 == 1 and slot6.config.pw then
		lua_thread.create(function ()
			sampSendDialogResponse(1, 1, 65535, uv0.config.password)
			wait(30)
			sampCloseCurrentDialogWithButton(0)
			wait(3000)
		end)
	end

	if slot5.match(slot5, "В ваш транспорт поместится ещё {80aaff}(%d+) л") and slot6.config.autobenz then
		lua_thread.create(function ()
			sampSendDialogResponse(121, 1, 65535, uv0)
			wait(30)
			sampCloseCurrentDialogWithButton(0)
		end)
	end
end

calculateZone = function(slot0, slot1, slot2)
	for slot7, slot8 in ipairs({
		{
			"Avispa Country Club",
			-2667.81,
			-302.135,
			-28.831,
			-2646.4,
			-262.32,
			71.169
		},
		{
			"Easter Bay Airport",
			-1315.42,
			-405.388,
			15.406,
			-1264.4,
			-209.543,
			25.406
		},
		{
			"Avispa Country Club",
			-2550.04,
			-355.493,
			0,
			-2470.04,
			-318.493,
			39.7
		},
		{
			"Easter Bay Airport",
			-1490.33,
			-209.543,
			15.406,
			-1264.4,
			-148.388,
			25.406
		},
		{
			"Garcia",
			-2395.14,
			-222.589,
			-5.3,
			-2354.09,
			-204.792,
			200
		},
		{
			"Shady Cabin",
			-1632.83,
			-2263.44,
			-3,
			-1601.33,
			-2231.79,
			200
		},
		{
			"East Los Santos",
			2381.68,
			-1494.03,
			-89.084,
			2421.03,
			-1454.35,
			110.916
		},
		{
			"LVA Freight Depot",
			1236.63,
			1163.41,
			-89.084,
			1277.05,
			1203.28,
			110.916
		},
		{
			"Blackfield Intersection",
			1277.05,
			1044.69,
			-89.084,
			1315.35,
			1087.63,
			110.916
		},
		{
			"Avispa Country Club",
			-2470.04,
			-355.493,
			0,
			-2270.04,
			-318.493,
			46.1
		},
		{
			"Temple",
			1252.33,
			-926.999,
			-89.084,
			1357,
			-910.17,
			110.916
		},
		{
			"Unity Station",
			1692.62,
			-1971.8,
			-20.492,
			1812.62,
			-1932.8,
			79.508
		},
		{
			"LVA Freight Depot",
			1315.35,
			1044.69,
			-89.084,
			1375.6,
			1087.63,
			110.916
		},
		{
			"Los Flores",
			2581.73,
			-1454.35,
			-89.084,
			2632.83,
			-1393.42,
			110.916
		},
		{
			"Starfish Casino",
			2437.39,
			1858.1,
			-39.084,
			2495.09,
			1970.85,
			60.916
		},
		{
			"Easter Bay Chemicals",
			-1132.82,
			-787.391,
			0,
			-956.476,
			-768.027,
			200
		},
		{
			"Downtown Los Santos",
			1370.85,
			-1170.87,
			-89.084,
			1463.9,
			-1130.85,
			110.916
		},
		{
			"Esplanade East",
			-1620.3,
			1176.52,
			-4.5,
			-1580.01,
			1274.26,
			200
		},
		{
			"Market Station",
			787.461,
			-1410.93,
			-34.126,
			866.009,
			-1310.21,
			65.874
		},
		{
			"Linden Station",
			2811.25,
			1229.59,
			-39.594,
			2861.25,
			1407.59,
			60.406
		},
		{
			"Montgomery Intersection",
			1582.44,
			347.457,
			0,
			1664.62,
			401.75,
			200
		},
		{
			"Frederick Bridge",
			2759.25,
			296.501,
			0,
			2774.25,
			594.757,
			200
		},
		{
			"Yellow Bell Station",
			1377.48,
			2600.43,
			-21.926,
			1492.45,
			2687.36,
			78.074
		},
		{
			"Downtown Los Santos",
			1507.51,
			-1385.21,
			110.916,
			1582.55,
			-1325.31,
			335.916
		},
		{
			"Jefferson",
			2185.33,
			-1210.74,
			-89.084,
			2281.45,
			-1154.59,
			110.916
		},
		{
			"Mulholland",
			1318.13,
			-910.17,
			-89.084,
			1357,
			-768.027,
			110.916
		},
		{
			"Avispa Country Club",
			-2361.51,
			-417.199,
			0,
			-2270.04,
			-355.493,
			200
		},
		{
			"Jefferson",
			1996.91,
			-1449.67,
			-89.084,
			2056.86,
			-1350.72,
			110.916
		},
		{
			"Julius Thruway West",
			1236.63,
			2142.86,
			-89.084,
			1297.47,
			2243.23,
			110.916
		},
		{
			"Jefferson",
			2124.66,
			-1494.03,
			-89.084,
			2266.21,
			-1449.67,
			110.916
		},
		{
			"Julius Thruway North",
			1848.4,
			2478.49,
			-89.084,
			1938.8,
			2553.49,
			110.916
		},
		{
			"Rodeo",
			422.68,
			-1570.2,
			-89.084,
			466.223,
			-1406.05,
			110.916
		},
		{
			"Cranberry Station",
			-2007.83,
			56.306,
			0,
			-1922,
			224.782,
			100
		},
		{
			"Downtown Los Santos",
			1391.05,
			-1026.33,
			-89.084,
			1463.9,
			-926.999,
			110.916
		},
		{
			"Redsands West",
			1704.59,
			2243.23,
			-89.084,
			1777.39,
			2342.83,
			110.916
		},
		{
			"Little Mexico",
			1758.9,
			-1722.26,
			-89.084,
			1812.62,
			-1577.59,
			110.916
		},
		{
			"Blackfield Intersection",
			1375.6,
			823.228,
			-89.084,
			1457.39,
			919.447,
			110.916
		},
		{
			"Los Santos International",
			1974.63,
			-2394.33,
			-39.084,
			2089,
			-2256.59,
			60.916
		},
		{
			"Beacon Hill",
			-399.633,
			-1075.52,
			-1.489,
			-319.033,
			-977.516,
			198.511
		},
		{
			"Rodeo",
			334.503,
			-1501.95,
			-89.084,
			422.68,
			-1406.05,
			110.916
		},
		{
			"Richman",
			225.165,
			-1369.62,
			-89.084,
			334.503,
			-1292.07,
			110.916
		},
		{
			"Downtown Los Santos",
			1724.76,
			-1250.9,
			-89.084,
			1812.62,
			-1150.87,
			110.916
		},
		{
			"The Strip",
			2027.4,
			1703.23,
			-89.084,
			2137.4,
			1783.23,
			110.916
		},
		{
			"Downtown Los Santos",
			1378.33,
			-1130.85,
			-89.084,
			1463.9,
			-1026.33,
			110.916
		},
		{
			"Blackfield Intersection",
			1197.39,
			1044.69,
			-89.084,
			1277.05,
			1163.39,
			110.916
		},
		{
			"Conference Center",
			1073.22,
			-1842.27,
			-89.084,
			1323.9,
			-1804.21,
			110.916
		},
		{
			"Montgomery",
			1451.4,
			347.457,
			-6.1,
			1582.44,
			420.802,
			200
		},
		{
			"Foster Valley",
			-2270.04,
			-430.276,
			-1.2,
			-2178.69,
			-324.114,
			200
		},
		{
			"Blackfield Chapel",
			1325.6,
			596.349,
			-89.084,
			1375.6,
			795.01,
			110.916
		},
		{
			"Los Santos International",
			2051.63,
			-2597.26,
			-39.084,
			2152.45,
			-2394.33,
			60.916
		},
		{
			"Mulholland",
			1096.47,
			-910.17,
			-89.084,
			1169.13,
			-768.027,
			110.916
		},
		{
			"Yellow Bell Gol Course",
			1457.46,
			2723.23,
			-89.084,
			1534.56,
			2863.23,
			110.916
		},
		{
			"The Strip",
			2027.4,
			1783.23,
			-89.084,
			2162.39,
			1863.23,
			110.916
		},
		{
			"Jefferson",
			2056.86,
			-1210.74,
			-89.084,
			2185.33,
			-1126.32,
			110.916
		},
		{
			"Mulholland",
			952.604,
			-937.184,
			-89.084,
			1096.47,
			-860.619,
			110.916
		},
		{
			"Aldea Malvada",
			-1372.14,
			2498.52,
			0,
			-1277.59,
			2615.35,
			200
		},
		{
			"Las Colinas",
			2126.86,
			-1126.32,
			-89.084,
			2185.33,
			-934.489,
			110.916
		},
		{
			"Las Colinas",
			1994.33,
			-1100.82,
			-89.084,
			2056.86,
			-920.815,
			110.916
		},
		{
			"Richman",
			647.557,
			-954.662,
			-89.084,
			768.694,
			-860.619,
			110.916
		},
		{
			"LVA Freight Depot",
			1277.05,
			1087.63,
			-89.084,
			1375.6,
			1203.28,
			110.916
		},
		{
			"Julius Thruway North",
			1377.39,
			2433.23,
			-89.084,
			1534.56,
			2507.23,
			110.916
		},
		{
			"Willowfield",
			2201.82,
			-2095,
			-89.084,
			2324,
			-1989.9,
			110.916
		},
		{
			"Julius Thruway North",
			1704.59,
			2342.83,
			-89.084,
			1848.4,
			2433.23,
			110.916
		},
		{
			"Temple",
			1252.33,
			-1130.85,
			-89.084,
			1378.33,
			-1026.33,
			110.916
		},
		{
			"Little Mexico",
			1701.9,
			-1842.27,
			-89.084,
			1812.62,
			-1722.26,
			110.916
		},
		{
			"Queens",
			-2411.22,
			373.539,
			0,
			-2253.54,
			458.411,
			200
		},
		{
			"Las Venturas Airport",
			1515.81,
			1586.4,
			-12.5,
			1729.95,
			1714.56,
			87.5
		},
		{
			"Richman",
			225.165,
			-1292.07,
			-89.084,
			466.223,
			-1235.07,
			110.916
		},
		{
			"Temple",
			1252.33,
			-1026.33,
			-89.084,
			1391.05,
			-926.999,
			110.916
		},
		{
			"East Los Santos",
			2266.26,
			-1494.03,
			-89.084,
			2381.68,
			-1372.04,
			110.916
		},
		{
			"Julius Thruway East",
			2623.18,
			943.235,
			-89.084,
			2749.9,
			1055.96,
			110.916
		},
		{
			"Willowfield",
			2541.7,
			-1941.4,
			-89.084,
			2703.58,
			-1852.87,
			110.916
		},
		{
			"Las Colinas",
			2056.86,
			-1126.32,
			-89.084,
			2126.86,
			-920.815,
			110.916
		},
		{
			"Julius Thruway East",
			2625.16,
			2202.76,
			-89.084,
			2685.16,
			2442.55,
			110.916
		},
		{
			"Rodeo",
			225.165,
			-1501.95,
			-89.084,
			334.503,
			-1369.62,
			110.916
		},
		{
			"Las Brujas",
			-365.167,
			2123.01,
			-3,
			-208.57,
			2217.68,
			200
		},
		{
			"Julius Thruway East",
			2536.43,
			2442.55,
			-89.084,
			2685.16,
			2542.55,
			110.916
		},
		{
			"Rodeo",
			334.503,
			-1406.05,
			-89.084,
			466.223,
			-1292.07,
			110.916
		},
		{
			"Vinewood",
			647.557,
			-1227.28,
			-89.084,
			787.461,
			-1118.28,
			110.916
		},
		{
			"Rodeo",
			422.68,
			-1684.65,
			-89.084,
			558.099,
			-1570.2,
			110.916
		},
		{
			"Julius Thruway North",
			2498.21,
			2542.55,
			-89.084,
			2685.16,
			2626.55,
			110.916
		},
		{
			"Downtown Los Santos",
			1724.76,
			-1430.87,
			-89.084,
			1812.62,
			-1250.9,
			110.916
		},
		{
			"Rodeo",
			225.165,
			-1684.65,
			-89.084,
			312.803,
			-1501.95,
			110.916
		},
		{
			"Jefferson",
			2056.86,
			-1449.67,
			-89.084,
			2266.21,
			-1372.04,
			110.916
		},
		{
			"Hampton Barns",
			603.035,
			264.312,
			0,
			761.994,
			366.572,
			200
		},
		{
			"Temple",
			1096.47,
			-1130.84,
			-89.084,
			1252.33,
			-1026.33,
			110.916
		},
		{
			"Kincaid Bridge",
			-1087.93,
			855.37,
			-89.084,
			-961.95,
			986.281,
			110.916
		},
		{
			"Verona Beach",
			1046.15,
			-1722.26,
			-89.084,
			1161.52,
			-1577.59,
			110.916
		},
		{
			"Commerce",
			1323.9,
			-1722.26,
			-89.084,
			1440.9,
			-1577.59,
			110.916
		},
		{
			"Mulholland",
			1357,
			-926.999,
			-89.084,
			1463.9,
			-768.027,
			110.916
		},
		{
			"Rodeo",
			466.223,
			-1570.2,
			-89.084,
			558.099,
			-1385.07,
			110.916
		},
		{
			"Mulholland",
			911.802,
			-860.619,
			-89.084,
			1096.47,
			-768.027,
			110.916
		},
		{
			"Mulholland",
			768.694,
			-954.662,
			-89.084,
			952.604,
			-860.619,
			110.916
		},
		{
			"Julius Thruway South",
			2377.39,
			788.894,
			-89.084,
			2537.39,
			897.901,
			110.916
		},
		{
			"Idlewood",
			1812.62,
			-1852.87,
			-89.084,
			1971.66,
			-1742.31,
			110.916
		},
		{
			"Ocean Docks",
			2089,
			-2394.33,
			-89.084,
			2201.82,
			-2235.84,
			110.916
		},
		{
			"Commerce",
			1370.85,
			-1577.59,
			-89.084,
			1463.9,
			-1384.95,
			110.916
		},
		{
			"Julius Thruway North",
			2121.4,
			2508.23,
			-89.084,
			2237.4,
			2663.17,
			110.916
		},
		{
			"Temple",
			1096.47,
			-1026.33,
			-89.084,
			1252.33,
			-910.17,
			110.916
		},
		{
			"Glen Park",
			1812.62,
			-1449.67,
			-89.084,
			1996.91,
			-1350.72,
			110.916
		},
		{
			"Easter Bay Airport",
			-1242.98,
			-50.096,
			0,
			-1213.91,
			578.396,
			200
		},
		{
			"Martin Bridge",
			-222.179,
			293.324,
			0,
			-122.126,
			476.465,
			200
		},
		{
			"The Strip",
			2106.7,
			1863.23,
			-89.084,
			2162.39,
			2202.76,
			110.916
		},
		{
			"Willowfield",
			2541.7,
			-2059.23,
			-89.084,
			2703.58,
			-1941.4,
			110.916
		},
		{
			"Marina",
			807.922,
			-1577.59,
			-89.084,
			926.922,
			-1416.25,
			110.916
		},
		{
			"Las Venturas Airport",
			1457.37,
			1143.21,
			-89.084,
			1777.4,
			1203.28,
			110.916
		},
		{
			"Idlewood",
			1812.62,
			-1742.31,
			-89.084,
			1951.66,
			-1602.31,
			110.916
		},
		{
			"Esplanade East",
			-1580.01,
			1025.98,
			-6.1,
			-1499.89,
			1274.26,
			200
		},
		{
			"Downtown Los Santos",
			1370.85,
			-1384.95,
			-89.084,
			1463.9,
			-1170.87,
			110.916
		},
		{
			"The Mako Span",
			1664.62,
			401.75,
			0,
			1785.14,
			567.203,
			200
		},
		{
			"Rodeo",
			312.803,
			-1684.65,
			-89.084,
			422.68,
			-1501.95,
			110.916
		},
		{
			"Pershing Square",
			1440.9,
			-1722.26,
			-89.084,
			1583.5,
			-1577.59,
			110.916
		},
		{
			"Mulholland",
			687.802,
			-860.619,
			-89.084,
			911.802,
			-768.027,
			110.916
		},
		{
			"Gant Bridge",
			-2741.07,
			1490.47,
			-6.1,
			-2616.4,
			1659.68,
			200
		},
		{
			"Las Colinas",
			2185.33,
			-1154.59,
			-89.084,
			2281.45,
			-934.489,
			110.916
		},
		{
			"Mulholland",
			1169.13,
			-910.17,
			-89.084,
			1318.13,
			-768.027,
			110.916
		},
		{
			"Julius Thruway North",
			1938.8,
			2508.23,
			-89.084,
			2121.4,
			2624.23,
			110.916
		},
		{
			"Commerce",
			1667.96,
			-1577.59,
			-89.084,
			1812.62,
			-1430.87,
			110.916
		},
		{
			"Rodeo",
			72.648,
			-1544.17,
			-89.084,
			225.165,
			-1404.97,
			110.916
		},
		{
			"Roca Escalante",
			2536.43,
			2202.76,
			-89.084,
			2625.16,
			2442.55,
			110.916
		},
		{
			"Rodeo",
			72.648,
			-1684.65,
			-89.084,
			225.165,
			-1544.17,
			110.916
		},
		{
			"Market",
			952.663,
			-1310.21,
			-89.084,
			1072.66,
			-1130.85,
			110.916
		},
		{
			"Las Colinas",
			2632.74,
			-1135.04,
			-89.084,
			2747.74,
			-945.035,
			110.916
		},
		{
			"Mulholland",
			861.085,
			-674.885,
			-89.084,
			1156.55,
			-600.896,
			110.916
		},
		{
			"King's",
			-2253.54,
			373.539,
			-9.1,
			-1993.28,
			458.411,
			200
		},
		{
			"Redsands East",
			1848.4,
			2342.83,
			-89.084,
			2011.94,
			2478.49,
			110.916
		},
		{
			"Downtown",
			-1580.01,
			744.267,
			-6.1,
			-1499.89,
			1025.98,
			200
		},
		{
			"Conference Center",
			1046.15,
			-1804.21,
			-89.084,
			1323.9,
			-1722.26,
			110.916
		},
		{
			"Richman",
			647.557,
			-1118.28,
			-89.084,
			787.461,
			-954.662,
			110.916
		},
		{
			"Ocean Flats",
			-2994.49,
			277.411,
			-9.1,
			-2867.85,
			458.411,
			200
		},
		{
			"Greenglass College",
			964.391,
			930.89,
			-89.084,
			1166.53,
			1044.69,
			110.916
		},
		{
			"Glen Park",
			1812.62,
			-1100.82,
			-89.084,
			1994.33,
			-973.38,
			110.916
		},
		{
			"LVA Freight Depot",
			1375.6,
			919.447,
			-89.084,
			1457.37,
			1203.28,
			110.916
		},
		{
			"Regular Tom",
			-405.77,
			1712.86,
			-3,
			-276.719,
			1892.75,
			200
		},
		{
			"Verona Beach",
			1161.52,
			-1722.26,
			-89.084,
			1323.9,
			-1577.59,
			110.916
		},
		{
			"East Los Santos",
			2281.45,
			-1372.04,
			-89.084,
			2381.68,
			-1135.04,
			110.916
		},
		{
			"Caligula's Palace",
			2137.4,
			1703.23,
			-89.084,
			2437.39,
			1783.23,
			110.916
		},
		{
			"Idlewood",
			1951.66,
			-1742.31,
			-89.084,
			2124.66,
			-1602.31,
			110.916
		},
		{
			"Pilgrim",
			2624.4,
			1383.23,
			-89.084,
			2685.16,
			1783.23,
			110.916
		},
		{
			"Idlewood",
			2124.66,
			-1742.31,
			-89.084,
			2222.56,
			-1494.03,
			110.916
		},
		{
			"Queens",
			-2533.04,
			458.411,
			0,
			-2329.31,
			578.396,
			200
		},
		{
			"Downtown",
			-1871.72,
			1176.42,
			-4.5,
			-1620.3,
			1274.26,
			200
		},
		{
			"Commerce",
			1583.5,
			-1722.26,
			-89.084,
			1758.9,
			-1577.59,
			110.916
		},
		{
			"East Los Santos",
			2381.68,
			-1454.35,
			-89.084,
			2462.13,
			-1135.04,
			110.916
		},
		{
			"Marina",
			647.712,
			-1577.59,
			-89.084,
			807.922,
			-1416.25,
			110.916
		},
		{
			"Richman",
			72.648,
			-1404.97,
			-89.084,
			225.165,
			-1235.07,
			110.916
		},
		{
			"Vinewood",
			647.712,
			-1416.25,
			-89.084,
			787.461,
			-1227.28,
			110.916
		},
		{
			"East Los Santos",
			2222.56,
			-1628.53,
			-89.084,
			2421.03,
			-1494.03,
			110.916
		},
		{
			"Rodeo",
			558.099,
			-1684.65,
			-89.084,
			647.522,
			-1384.93,
			110.916
		},
		{
			"Easter Tunnel",
			-1709.71,
			-833.034,
			-1.5,
			-1446.01,
			-730.118,
			200
		},
		{
			"Rodeo",
			466.223,
			-1385.07,
			-89.084,
			647.522,
			-1235.07,
			110.916
		},
		{
			"Redsands East",
			1817.39,
			2202.76,
			-89.084,
			2011.94,
			2342.83,
			110.916
		},
		{
			"The Clown's Pocket",
			2162.39,
			1783.23,
			-89.084,
			2437.39,
			1883.23,
			110.916
		},
		{
			"Idlewood",
			1971.66,
			-1852.87,
			-89.084,
			2222.56,
			-1742.31,
			110.916
		},
		{
			"Montgomery Intersection",
			1546.65,
			208.164,
			0,
			1745.83,
			347.457,
			200
		},
		{
			"Willowfield",
			2089,
			-2235.84,
			-89.084,
			2201.82,
			-1989.9,
			110.916
		},
		{
			"Temple",
			952.663,
			-1130.84,
			-89.084,
			1096.47,
			-937.184,
			110.916
		},
		{
			"Prickle Pine",
			1848.4,
			2553.49,
			-89.084,
			1938.8,
			2863.23,
			110.916
		},
		{
			"Los Santos International",
			1400.97,
			-2669.26,
			-39.084,
			2189.82,
			-2597.26,
			60.916
		},
		{
			"Garver Bridge",
			-1213.91,
			950.022,
			-89.084,
			-1087.93,
			1178.93,
			110.916
		},
		{
			"Garver Bridge",
			-1339.89,
			828.129,
			-89.084,
			-1213.91,
			1057.04,
			110.916
		},
		{
			"Kincaid Bridge",
			-1339.89,
			599.218,
			-89.084,
			-1213.91,
			828.129,
			110.916
		},
		{
			"Kincaid Bridge",
			-1213.91,
			721.111,
			-89.084,
			-1087.93,
			950.022,
			110.916
		},
		{
			"Verona Beach",
			930.221,
			-2006.78,
			-89.084,
			1073.22,
			-1804.21,
			110.916
		},
		{
			"Verdant Bluffs",
			1073.22,
			-2006.78,
			-89.084,
			1249.62,
			-1842.27,
			110.916
		},
		{
			"Vinewood",
			787.461,
			-1130.84,
			-89.084,
			952.604,
			-954.662,
			110.916
		},
		{
			"Vinewood",
			787.461,
			-1310.21,
			-89.084,
			952.663,
			-1130.84,
			110.916
		},
		{
			"Commerce",
			1463.9,
			-1577.59,
			-89.084,
			1667.96,
			-1430.87,
			110.916
		},
		{
			"Market",
			787.461,
			-1416.25,
			-89.084,
			1072.66,
			-1310.21,
			110.916
		},
		{
			"Rockshore West",
			2377.39,
			596.349,
			-89.084,
			2537.39,
			788.894,
			110.916
		},
		{
			"Julius Thruway North",
			2237.4,
			2542.55,
			-89.084,
			2498.21,
			2663.17,
			110.916
		},
		{
			"East Beach",
			2632.83,
			-1668.13,
			-89.084,
			2747.74,
			-1393.42,
			110.916
		},
		{
			"Fallow Bridge",
			434.341,
			366.572,
			0,
			603.035,
			555.68,
			200
		},
		{
			"Willowfield",
			2089,
			-1989.9,
			-89.084,
			2324,
			-1852.87,
			110.916
		},
		{
			"Chinatown",
			-2274.17,
			578.396,
			-7.6,
			-2078.67,
			744.17,
			200
		},
		{
			"El Castillo del Diablo",
			-208.57,
			2337.18,
			0,
			8.43,
			2487.18,
			200
		},
		{
			"Ocean Docks",
			2324,
			-2145.1,
			-89.084,
			2703.58,
			-2059.23,
			110.916
		},
		{
			"Easter Bay Chemicals",
			-1132.82,
			-768.027,
			0,
			-956.476,
			-578.118,
			200
		},
		{
			"The Visage",
			1817.39,
			1703.23,
			-89.084,
			2027.4,
			1863.23,
			110.916
		},
		{
			"Ocean Flats",
			-2994.49,
			-430.276,
			-1.2,
			-2831.89,
			-222.589,
			200
		},
		{
			"Richman",
			321.356,
			-860.619,
			-89.084,
			687.802,
			-768.027,
			110.916
		},
		{
			"Green Palms",
			176.581,
			1305.45,
			-3,
			338.658,
			1520.72,
			200
		},
		{
			"Richman",
			321.356,
			-768.027,
			-89.084,
			700.794,
			-674.885,
			110.916
		},
		{
			"Starfish Casino",
			2162.39,
			1883.23,
			-89.084,
			2437.39,
			2012.18,
			110.916
		},
		{
			"East Beach",
			2747.74,
			-1668.13,
			-89.084,
			2959.35,
			-1498.62,
			110.916
		},
		{
			"Jefferson",
			2056.86,
			-1372.04,
			-89.084,
			2281.45,
			-1210.74,
			110.916
		},
		{
			"Downtown Los Santos",
			1463.9,
			-1290.87,
			-89.084,
			1724.76,
			-1150.87,
			110.916
		},
		{
			"Downtown Los Santos",
			1463.9,
			-1430.87,
			-89.084,
			1724.76,
			-1290.87,
			110.916
		},
		{
			"Garver Bridge",
			-1499.89,
			696.442,
			-179.615,
			-1339.89,
			925.353,
			20.385
		},
		{
			"Julius Thruway South",
			1457.39,
			823.228,
			-89.084,
			2377.39,
			863.229,
			110.916
		},
		{
			"East Los Santos",
			2421.03,
			-1628.53,
			-89.084,
			2632.83,
			-1454.35,
			110.916
		},
		{
			"Greenglass College",
			964.391,
			1044.69,
			-89.084,
			1197.39,
			1203.22,
			110.916
		},
		{
			"Las Colinas",
			2747.74,
			-1120.04,
			-89.084,
			2959.35,
			-945.035,
			110.916
		},
		{
			"Mulholland",
			737.573,
			-768.027,
			-89.084,
			1142.29,
			-674.885,
			110.916
		},
		{
			"Ocean Docks",
			2201.82,
			-2730.88,
			-89.084,
			2324,
			-2418.33,
			110.916
		},
		{
			"East Los Santos",
			2462.13,
			-1454.35,
			-89.084,
			2581.73,
			-1135.04,
			110.916
		},
		{
			"Ganton",
			2222.56,
			-1722.33,
			-89.084,
			2632.83,
			-1628.53,
			110.916
		},
		{
			"Avispa Country Club",
			-2831.89,
			-430.276,
			-6.1,
			-2646.4,
			-222.589,
			200
		},
		{
			"Willowfield",
			1970.62,
			-2179.25,
			-89.084,
			2089,
			-1852.87,
			110.916
		},
		{
			"Esplanade North",
			-1982.32,
			1274.26,
			-4.5,
			-1524.24,
			1358.9,
			200
		},
		{
			"The High Roller",
			1817.39,
			1283.23,
			-89.084,
			2027.39,
			1469.23,
			110.916
		},
		{
			"Ocean Docks",
			2201.82,
			-2418.33,
			-89.084,
			2324,
			-2095,
			110.916
		},
		{
			"Last Dime Motel",
			1823.08,
			596.349,
			-89.084,
			1997.22,
			823.228,
			110.916
		},
		{
			"Bayside Marina",
			-2353.17,
			2275.79,
			0,
			-2153.17,
			2475.79,
			200
		},
		{
			"King's",
			-2329.31,
			458.411,
			-7.6,
			-1993.28,
			578.396,
			200
		},
		{
			"El Corona",
			1692.62,
			-2179.25,
			-89.084,
			1812.62,
			-1842.27,
			110.916
		},
		{
			"Blackfield Chapel",
			1375.6,
			596.349,
			-89.084,
			1558.09,
			823.228,
			110.916
		},
		{
			"The Pink Swan",
			1817.39,
			1083.23,
			-89.084,
			2027.39,
			1283.23,
			110.916
		},
		{
			"Julius Thruway West",
			1197.39,
			1163.39,
			-89.084,
			1236.63,
			2243.23,
			110.916
		},
		{
			"Los Flores",
			2581.73,
			-1393.42,
			-89.084,
			2747.74,
			-1135.04,
			110.916
		},
		{
			"The Visage",
			1817.39,
			1863.23,
			-89.084,
			2106.7,
			2011.83,
			110.916
		},
		{
			"Prickle Pine",
			1938.8,
			2624.23,
			-89.084,
			2121.4,
			2861.55,
			110.916
		},
		{
			"Verona Beach",
			851.449,
			-1804.21,
			-89.084,
			1046.15,
			-1577.59,
			110.916
		},
		{
			"Robada Intersection",
			-1119.01,
			1178.93,
			-89.084,
			-862.025,
			1351.45,
			110.916
		},
		{
			"Linden Side",
			2749.9,
			943.235,
			-89.084,
			2923.39,
			1198.99,
			110.916
		},
		{
			"Ocean Docks",
			2703.58,
			-2302.33,
			-89.084,
			2959.35,
			-2126.9,
			110.916
		},
		{
			"Willowfield",
			2324,
			-2059.23,
			-89.084,
			2541.7,
			-1852.87,
			110.916
		},
		{
			"King's",
			-2411.22,
			265.243,
			-9.1,
			-1993.28,
			373.539,
			200
		},
		{
			"Commerce",
			1323.9,
			-1842.27,
			-89.084,
			1701.9,
			-1722.26,
			110.916
		},
		{
			"Mulholland",
			1269.13,
			-768.027,
			-89.084,
			1414.07,
			-452.425,
			110.916
		},
		{
			"Marina",
			647.712,
			-1804.21,
			-89.084,
			851.449,
			-1577.59,
			110.916
		},
		{
			"Battery Point",
			-2741.07,
			1268.41,
			-4.5,
			-2533.04,
			1490.47,
			200
		},
		{
			"The Four Dragons Casino",
			1817.39,
			863.232,
			-89.084,
			2027.39,
			1083.23,
			110.916
		},
		{
			"Blackfield",
			964.391,
			1203.22,
			-89.084,
			1197.39,
			1403.22,
			110.916
		},
		{
			"Julius Thruway North",
			1534.56,
			2433.23,
			-89.084,
			1848.4,
			2583.23,
			110.916
		},
		{
			"Yellow Bell Gol Course",
			1117.4,
			2723.23,
			-89.084,
			1457.46,
			2863.23,
			110.916
		},
		{
			"Idlewood",
			1812.62,
			-1602.31,
			-89.084,
			2124.66,
			-1449.67,
			110.916
		},
		{
			"Redsands West",
			1297.47,
			2142.86,
			-89.084,
			1777.39,
			2243.23,
			110.916
		},
		{
			"Doherty",
			-2270.04,
			-324.114,
			-1.2,
			-1794.92,
			-222.589,
			200
		},
		{
			"Hilltop Farm",
			967.383,
			-450.39,
			-3,
			1176.78,
			-217.9,
			200
		},
		{
			"Las Barrancas",
			-926.13,
			1398.73,
			-3,
			-719.234,
			1634.69,
			200
		},
		{
			"Pirates in Men's Pants",
			1817.39,
			1469.23,
			-89.084,
			2027.4,
			1703.23,
			110.916
		},
		{
			"City Hall",
			-2867.85,
			277.411,
			-9.1,
			-2593.44,
			458.411,
			200
		},
		{
			"Avispa Country Club",
			-2646.4,
			-355.493,
			0,
			-2270.04,
			-222.589,
			200
		},
		{
			"The Strip",
			2027.4,
			863.229,
			-89.084,
			2087.39,
			1703.23,
			110.916
		},
		{
			"Hashbury",
			-2593.44,
			-222.589,
			-1,
			-2411.22,
			54.722,
			200
		},
		{
			"Los Santos International",
			1852,
			-2394.33,
			-89.084,
			2089,
			-2179.25,
			110.916
		},
		{
			"Whitewood Estates",
			1098.31,
			1726.22,
			-89.084,
			1197.39,
			2243.23,
			110.916
		},
		{
			"Sherman Reservoir",
			-789.737,
			1659.68,
			-89.084,
			-599.505,
			1929.41,
			110.916
		},
		{
			"El Corona",
			1812.62,
			-2179.25,
			-89.084,
			1970.62,
			-1852.87,
			110.916
		},
		{
			"Downtown",
			-1700.01,
			744.267,
			-6.1,
			-1580.01,
			1176.52,
			200
		},
		{
			"Foster Valley",
			-2178.69,
			-1250.97,
			0,
			-1794.92,
			-1115.58,
			200
		},
		{
			"Las Payasadas",
			-354.332,
			2580.36,
			2,
			-133.625,
			2816.82,
			200
		},
		{
			"Valle Ocultado",
			-936.668,
			2611.44,
			2,
			-715.961,
			2847.9,
			200
		},
		{
			"Blackfield Intersection",
			1166.53,
			795.01,
			-89.084,
			1375.6,
			1044.69,
			110.916
		},
		{
			"Ganton",
			2222.56,
			-1852.87,
			-89.084,
			2632.83,
			-1722.33,
			110.916
		},
		{
			"Easter Bay Airport",
			-1213.91,
			-730.118,
			0,
			-1132.82,
			-50.096,
			200
		},
		{
			"Redsands East",
			1817.39,
			2011.83,
			-89.084,
			2106.7,
			2202.76,
			110.916
		},
		{
			"Esplanade East",
			-1499.89,
			578.396,
			-79.615,
			-1339.89,
			1274.26,
			20.385
		},
		{
			"Caligula's Palace",
			2087.39,
			1543.23,
			-89.084,
			2437.39,
			1703.23,
			110.916
		},
		{
			"Royal Casino",
			2087.39,
			1383.23,
			-89.084,
			2437.39,
			1543.23,
			110.916
		},
		{
			"Richman",
			72.648,
			-1235.07,
			-89.084,
			321.356,
			-1008.15,
			110.916
		},
		{
			"Starfish Casino",
			2437.39,
			1783.23,
			-89.084,
			2685.16,
			2012.18,
			110.916
		},
		{
			"Mulholland",
			1281.13,
			-452.425,
			-89.084,
			1641.13,
			-290.913,
			110.916
		},
		{
			"Downtown",
			-1982.32,
			744.17,
			-6.1,
			-1871.72,
			1274.26,
			200
		},
		{
			"Hankypanky Point",
			2576.92,
			62.158,
			0,
			2759.25,
			385.503,
			200
		},
		{
			"K.A.C.C. Military Fuels",
			2498.21,
			2626.55,
			-89.084,
			2749.9,
			2861.55,
			110.916
		},
		{
			"Harry Gold Parkway",
			1777.39,
			863.232,
			-89.084,
			1817.39,
			2342.83,
			110.916
		},
		{
			"Bayside Tunnel",
			-2290.19,
			2548.29,
			-89.084,
			-1950.19,
			2723.29,
			110.916
		},
		{
			"Ocean Docks",
			2324,
			-2302.33,
			-89.084,
			2703.58,
			-2145.1,
			110.916
		},
		{
			"Richman",
			321.356,
			-1044.07,
			-89.084,
			647.557,
			-860.619,
			110.916
		},
		{
			"Randolph Industrial Estate",
			1558.09,
			596.349,
			-89.084,
			1823.08,
			823.235,
			110.916
		},
		{
			"East Beach",
			2632.83,
			-1852.87,
			-89.084,
			2959.35,
			-1668.13,
			110.916
		},
		{
			"Flint Water",
			-314.426,
			-753.874,
			-89.084,
			-106.339,
			-463.073,
			110.916
		},
		{
			"Blueberry",
			19.607,
			-404.136,
			3.8,
			349.607,
			-220.137,
			200
		},
		{
			"Linden Station",
			2749.9,
			1198.99,
			-89.084,
			2923.39,
			1548.99,
			110.916
		},
		{
			"Glen Park",
			1812.62,
			-1350.72,
			-89.084,
			2056.86,
			-1100.82,
			110.916
		},
		{
			"Downtown",
			-1993.28,
			265.243,
			-9.1,
			-1794.92,
			578.396,
			200
		},
		{
			"Redsands West",
			1377.39,
			2243.23,
			-89.084,
			1704.59,
			2433.23,
			110.916
		},
		{
			"Richman",
			321.356,
			-1235.07,
			-89.084,
			647.522,
			-1044.07,
			110.916
		},
		{
			"Gant Bridge",
			-2741.45,
			1659.68,
			-6.1,
			-2616.4,
			2175.15,
			200
		},
		{
			"Lil' Probe Inn",
			-90.218,
			1286.85,
			-3,
			153.859,
			1554.12,
			200
		},
		{
			"Flint Intersection",
			-187.7,
			-1596.76,
			-89.084,
			17.063,
			-1276.6,
			110.916
		},
		{
			"Las Colinas",
			2281.45,
			-1135.04,
			-89.084,
			2632.74,
			-945.035,
			110.916
		},
		{
			"Sobell Rail Yards",
			2749.9,
			1548.99,
			-89.084,
			2923.39,
			1937.25,
			110.916
		},
		{
			"The Emerald Isle",
			2011.94,
			2202.76,
			-89.084,
			2237.4,
			2508.23,
			110.916
		},
		{
			"El Castillo del Diablo",
			-208.57,
			2123.01,
			-7.6,
			114.033,
			2337.18,
			200
		},
		{
			"Santa Flora",
			-2741.07,
			458.411,
			-7.6,
			-2533.04,
			793.411,
			200
		},
		{
			"Playa del Seville",
			2703.58,
			-2126.9,
			-89.084,
			2959.35,
			-1852.87,
			110.916
		},
		{
			"Market",
			926.922,
			-1577.59,
			-89.084,
			1370.85,
			-1416.25,
			110.916
		},
		{
			"Queens",
			-2593.44,
			54.722,
			0,
			-2411.22,
			458.411,
			200
		},
		{
			"Pilson Intersection",
			1098.39,
			2243.23,
			-89.084,
			1377.39,
			2507.23,
			110.916
		},
		{
			"Spinybed",
			2121.4,
			2663.17,
			-89.084,
			2498.21,
			2861.55,
			110.916
		},
		{
			"Pilgrim",
			2437.39,
			1383.23,
			-89.084,
			2624.4,
			1783.23,
			110.916
		},
		{
			"Blackfield",
			964.391,
			1403.22,
			-89.084,
			1197.39,
			1726.22,
			110.916
		},
		{
			"'The Big Ear'",
			-410.02,
			1403.34,
			-3,
			-137.969,
			1681.23,
			200
		},
		{
			"Dillimore",
			580.794,
			-674.885,
			-9.5,
			861.085,
			-404.79,
			200
		},
		{
			"El Quebrados",
			-1645.23,
			2498.52,
			0,
			-1372.14,
			2777.85,
			200
		},
		{
			"Esplanade North",
			-2533.04,
			1358.9,
			-4.5,
			-1996.66,
			1501.21,
			200
		},
		{
			"Easter Bay Airport",
			-1499.89,
			-50.096,
			-1,
			-1242.98,
			249.904,
			200
		},
		{
			"Fisher's Lagoon",
			1916.99,
			-233.323,
			-100,
			2131.72,
			13.8,
			200
		},
		{
			"Mulholland",
			1414.07,
			-768.027,
			-89.084,
			1667.61,
			-452.425,
			110.916
		},
		{
			"East Beach",
			2747.74,
			-1498.62,
			-89.084,
			2959.35,
			-1120.04,
			110.916
		},
		{
			"San Andreas Sound",
			2450.39,
			385.503,
			-100,
			2759.25,
			562.349,
			200
		},
		{
			"Shady Creeks",
			-2030.12,
			-2174.89,
			-6.1,
			-1820.64,
			-1771.66,
			200
		},
		{
			"Market",
			1072.66,
			-1416.25,
			-89.084,
			1370.85,
			-1130.85,
			110.916
		},
		{
			"Rockshore West",
			1997.22,
			596.349,
			-89.084,
			2377.39,
			823.228,
			110.916
		},
		{
			"Prickle Pine",
			1534.56,
			2583.23,
			-89.084,
			1848.4,
			2863.23,
			110.916
		},
		{
			"Easter Basin",
			-1794.92,
			-50.096,
			-1.04,
			-1499.89,
			249.904,
			200
		},
		{
			"Leafy Hollow",
			-1166.97,
			-1856.03,
			0,
			-815.624,
			-1602.07,
			200
		},
		{
			"LVA Freight Depot",
			1457.39,
			863.229,
			-89.084,
			1777.4,
			1143.21,
			110.916
		},
		{
			"Prickle Pine",
			1117.4,
			2507.23,
			-89.084,
			1534.56,
			2723.23,
			110.916
		},
		{
			"Blueberry",
			104.534,
			-220.137,
			2.3,
			349.607,
			152.236,
			200
		},
		{
			"El Castillo del Diablo",
			-464.515,
			2217.68,
			0,
			-208.57,
			2580.36,
			200
		},
		{
			"Downtown",
			-2078.67,
			578.396,
			-7.6,
			-1499.89,
			744.267,
			200
		},
		{
			"Rockshore East",
			2537.39,
			676.549,
			-89.084,
			2902.35,
			943.235,
			110.916
		},
		{
			"San Fierro Bay",
			-2616.4,
			1501.21,
			-3,
			-1996.66,
			1659.68,
			200
		},
		{
			"Paradiso",
			-2741.07,
			793.411,
			-6.1,
			-2533.04,
			1268.41,
			200
		},
		{
			"The Camel's Toe",
			2087.39,
			1203.23,
			-89.084,
			2640.4,
			1383.23,
			110.916
		},
		{
			"Old Venturas Strip",
			2162.39,
			2012.18,
			-89.084,
			2685.16,
			2202.76,
			110.916
		},
		{
			"Juniper Hill",
			-2533.04,
			578.396,
			-7.6,
			-2274.17,
			968.369,
			200
		},
		{
			"Juniper Hollow",
			-2533.04,
			968.369,
			-6.1,
			-2274.17,
			1358.9,
			200
		},
		{
			"Roca Escalante",
			2237.4,
			2202.76,
			-89.084,
			2536.43,
			2542.55,
			110.916
		},
		{
			"Julius Thruway East",
			2685.16,
			1055.96,
			-89.084,
			2749.9,
			2626.55,
			110.916
		},
		{
			"Verona Beach",
			647.712,
			-2173.29,
			-89.084,
			930.221,
			-1804.21,
			110.916
		},
		{
			"Foster Valley",
			-2178.69,
			-599.884,
			-1.2,
			-1794.92,
			-324.114,
			200
		},
		{
			"Arco del Oeste",
			-901.129,
			2221.86,
			0,
			-592.09,
			2571.97,
			200
		},
		{
			"Fallen Tree",
			-792.254,
			-698.555,
			-5.3,
			-452.404,
			-380.043,
			200
		},
		{
			"The Farm",
			-1209.67,
			-1317.1,
			114.981,
			-908.161,
			-787.391,
			251.981
		},
		{
			"The Sherman Dam",
			-968.772,
			1929.41,
			-3,
			-481.126,
			2155.26,
			200
		},
		{
			"Esplanade North",
			-1996.66,
			1358.9,
			-4.5,
			-1524.24,
			1592.51,
			200
		},
		{
			"Financial",
			-1871.72,
			744.17,
			-6.1,
			-1701.3,
			1176.42,
			300
		},
		{
			"Garcia",
			-2411.22,
			-222.589,
			-1.14,
			-2173.04,
			265.243,
			200
		},
		{
			"Montgomery",
			1119.51,
			119.526,
			-3,
			1451.4,
			493.323,
			200
		},
		{
			"Creek",
			2749.9,
			1937.25,
			-89.084,
			2921.62,
			2669.79,
			110.916
		},
		{
			"Los Santos International",
			1249.62,
			-2394.33,
			-89.084,
			1852,
			-2179.25,
			110.916
		},
		{
			"Santa Maria Beach",
			72.648,
			-2173.29,
			-89.084,
			342.648,
			-1684.65,
			110.916
		},
		{
			"Mulholland Intersection",
			1463.9,
			-1150.87,
			-89.084,
			1812.62,
			-768.027,
			110.916
		},
		{
			"Angel Pine",
			-2324.94,
			-2584.29,
			-6.1,
			-1964.22,
			-2212.11,
			200
		},
		{
			"Verdant Meadows",
			37.032,
			2337.18,
			-3,
			435.988,
			2677.9,
			200
		},
		{
			"Octane Springs",
			338.658,
			1228.51,
			0,
			664.308,
			1655.05,
			200
		},
		{
			"Come-A-Lot",
			2087.39,
			943.235,
			-89.084,
			2623.18,
			1203.23,
			110.916
		},
		{
			"Redsands West",
			1236.63,
			1883.11,
			-89.084,
			1777.39,
			2142.86,
			110.916
		},
		{
			"Santa Maria Beach",
			342.648,
			-2173.29,
			-89.084,
			647.712,
			-1684.65,
			110.916
		},
		{
			"Verdant Bluffs",
			1249.62,
			-2179.25,
			-89.084,
			1692.62,
			-1842.27,
			110.916
		},
		{
			"Las Venturas Airport",
			1236.63,
			1203.28,
			-89.084,
			1457.37,
			1883.11,
			110.916
		},
		{
			"Flint Range",
			-594.191,
			-1648.55,
			0,
			-187.7,
			-1276.6,
			200
		},
		{
			"Verdant Bluffs",
			930.221,
			-2488.42,
			-89.084,
			1249.62,
			-2006.78,
			110.916
		},
		{
			"Palomino Creek",
			2160.22,
			-149.004,
			0,
			2576.92,
			228.322,
			200
		},
		{
			"Ocean Docks",
			2373.77,
			-2697.09,
			-89.084,
			2809.22,
			-2330.46,
			110.916
		},
		{
			"Easter Bay Airport",
			-1213.91,
			-50.096,
			-4.5,
			-947.98,
			578.396,
			200
		},
		{
			"Whitewood Estates",
			883.308,
			1726.22,
			-89.084,
			1098.31,
			2507.23,
			110.916
		},
		{
			"Calton Heights",
			-2274.17,
			744.17,
			-6.1,
			-1982.32,
			1358.9,
			200
		},
		{
			"Easter Basin",
			-1794.92,
			249.904,
			-9.1,
			-1242.98,
			578.396,
			200
		},
		{
			"Los Santos Inlet",
			-321.744,
			-2224.43,
			-89.084,
			44.615,
			-1724.43,
			110.916
		},
		{
			"Doherty",
			-2173.04,
			-222.589,
			-1,
			-1794.92,
			265.243,
			200
		},
		{
			"Mount Chiliad",
			-2178.69,
			-2189.91,
			-47.917,
			-2030.12,
			-1771.66,
			576.083
		},
		{
			"Fort Carson",
			-376.233,
			826.326,
			-3,
			123.717,
			1220.44,
			200
		},
		{
			"Foster Valley",
			-2178.69,
			-1115.58,
			0,
			-1794.92,
			-599.884,
			200
		},
		{
			"Ocean Flats",
			-2994.49,
			-222.589,
			-1,
			-2593.44,
			277.411,
			200
		},
		{
			"Fern Ridge",
			508.189,
			-139.259,
			0,
			1306.66,
			119.526,
			200
		},
		{
			"Bayside",
			-2741.07,
			2175.15,
			0,
			-2353.17,
			2722.79,
			200
		},
		{
			"Las Venturas Airport",
			1457.37,
			1203.28,
			-89.084,
			1777.39,
			1883.11,
			110.916
		},
		{
			"Blueberry Acres",
			-319.676,
			-220.137,
			0,
			104.534,
			293.324,
			200
		},
		{
			"Palisades",
			-2994.49,
			458.411,
			-6.1,
			-2741.07,
			1339.61,
			200
		},
		{
			"North Rock",
			2285.37,
			-768.027,
			0,
			2770.59,
			-269.74,
			200
		},
		{
			"Hunter Quarry",
			337.244,
			710.84,
			-115.239,
			860.554,
			1031.71,
			203.761
		},
		{
			"Los Santos International",
			1382.73,
			-2730.88,
			-89.084,
			2201.82,
			-2394.33,
			110.916
		},
		{
			"Missionary Hill",
			-2994.49,
			-811.276,
			0,
			-2178.69,
			-430.276,
			200
		},
		{
			"San Fierro Bay",
			-2616.4,
			1659.68,
			-3,
			-1996.66,
			2175.15,
			200
		},
		{
			"Restricted Area",
			-91.586,
			1655.05,
			-50,
			421.234,
			2123.01,
			250
		},
		{
			"Mount Chiliad",
			-2997.47,
			-1115.58,
			-47.917,
			-2178.69,
			-971.913,
			576.083
		},
		{
			"Mount Chiliad",
			-2178.69,
			-1771.66,
			-47.917,
			-1936.12,
			-1250.97,
			576.083
		},
		{
			"Easter Bay Airport",
			-1794.92,
			-730.118,
			-3,
			-1213.91,
			-50.096,
			200
		},
		{
			"The Panopticon",
			-947.98,
			-304.32,
			-1.1,
			-319.676,
			327.071,
			200
		},
		{
			"Shady Creeks",
			-1820.64,
			-2643.68,
			-8,
			-1226.78,
			-1771.66,
			200
		},
		{
			"Back o Beyond",
			-1166.97,
			-2641.19,
			0,
			-321.744,
			-1856.03,
			200
		},
		{
			"Mount Chiliad",
			-2994.49,
			-2189.91,
			-47.917,
			-2178.69,
			-1115.58,
			576.083
		},
		{
			"Tierra Robada",
			-1213.91,
			596.349,
			-242.99,
			-480.539,
			1659.68,
			900
		},
		{
			"Flint County",
			-1213.91,
			-2892.97,
			-242.99,
			44.615,
			-768.027,
			900
		},
		{
			"Whetstone",
			-2997.47,
			-2892.97,
			-242.99,
			-1213.91,
			-1115.58,
			900
		},
		{
			"Bone County",
			-480.539,
			596.349,
			-242.99,
			869.461,
			2993.87,
			900
		},
		{
			"Tierra Robada",
			-2997.47,
			1659.68,
			-242.99,
			-480.539,
			2993.87,
			900
		},
		{
			"Пригород",
			-2997.47,
			-1115.58,
			-242.99,
			-1213.91,
			1659.68,
			900
		},
		{
			"Las Venturas",
			869.461,
			596.349,
			-242.99,
			2997.06,
			2993.87,
			900
		},
		{
			"Red County",
			-1213.91,
			-768.027,
			-242.99,
			2997.06,
			596.349,
			900
		},
		{
			"Пригород",
			44.615,
			-2892.97,
			-242.99,
			2997.06,
			-768.027,
			900
		}
	}) do
		if slot8[2] <= slot0 and slot8[3] <= slot1 and slot8[4] <= slot2 and slot0 <= slot8[5] and slot1 <= slot8[6] and slot2 <= slot8[7] then
			return slot8[1]
		end
	end

	return "Unknown"
end

slot2.CenterText = function(slot0)
	uv0.SetCursorPosX(uv0.GetWindowWidth() / 2 - uv0.CalcTextSize(slot0).x / 2)
	uv0.Text(slot0)
end

slot2.Link = function(slot0, slot1, slot2)
	slot2 = type(slot1) == "boolean" and slot1 or slot2 or false
	slot1 = type(slot1) == "string" and slot1 or type(slot1) == "boolean" and slot0 or slot0
	slot4 = uv0.GetCursorScreenPos()
	slot5 = uv0.GetCursorPos()

	if uv0.InvisibleButton("##" .. slot0 .. slot1, uv0.CalcTextSize(slot1)) and not slot2 then
		os.execute("explorer " .. slot0)
	end

	uv0.SetCursorPos(slot5)

	if uv0.IsItemHovered() then
		uv0.TextColored(uv0.ImVec4(0, 0.5, 1, 1), slot1)
		uv0.GetWindowDrawList():AddLine(uv0.ImVec2(slot4.x, slot4.y + slot3.y), uv0.ImVec2(slot4.x + slot3.x, slot4.y + slot3.y), uv0.GetColorU32(uv0.ImVec4(0, 0.5, 1, 1)))
	else
		uv0.TextColored(uv0.ImVec4(0, 0.3, 0.8, 1), slot1)
	end

	return slot6
end

slot2.ButtonClickable = function(slot0, ...)
	if slot0 then
		return uv0.Button(...)
	else
		slot1, slot2, slot3, slot4 = uv0.ImColor(uv0.GetStyle().Colors[uv0.Col.Button]):GetFloat4()

		uv0.PushStyleColor(uv0.Col.Button, uv0.ImVec4(slot1, slot2, slot3, slot4 / 2))
		uv0.PushStyleColor(uv0.Col.ButtonHovered, uv0.ImVec4(slot1, slot2, slot3, slot4 / 2))
		uv0.PushStyleColor(uv0.Col.ButtonActive, uv0.ImVec4(slot1, slot2, slot3, slot4 / 2))
		uv0.PushStyleColor(uv0.Col.Text, uv0.GetStyle().Colors[uv0.Col.TextDisabled])
		uv0.Button(...)
		uv0.PopStyleColor()
		uv0.PopStyleColor()
		uv0.PopStyleColor()
		uv0.PopStyleColor()
	end
end

sampGetPlayerIdByNickname = function(slot0)
	slot1, slot2 = sampGetPlayerIdByCharHandle(PLAYER_PED)

	if tostring(slot0) == sampGetPlayerNickname(slot2) then
		return slot2
	end

	for slot6 = 0, 1003 do
		if sampIsPlayerConnected(slot6) and sampGetPlayerNickname(slot6) == slot0 then
			return slot6
		end
	end
end

rotateCarAroundUpAxis = function(slot0, slot1)
	slot3 = uv1(uv0(getVehicleRotationMatrix(slot0)).up:get())

	slot1:normalize()
	slot3:normalize()

	if math.acos(slot3:dotProduct(slot1)) ~= 0 then
		slot3:crossProduct(slot1)
		slot3:normalize()
		slot3:zeroNearZero()

		slot2 = slot2:rotate(slot3, -slot4)
	end

	setVehicleRotationMatrix(slot0, slot2.get(slot2))
end

getVehicleRotationMatrix = function(slot0)
	if getCarPointer(slot0) ~= 0 and readMemory(slot1 + 20, 4, false) ~= 0 then
		slot3, slot4, slot5, slot6, slot7, slot8, slot9, slot10, slot11 = nil

		return readFloatArray(slot2, 0), readFloatArray(slot2, 1), readFloatArray(slot2, 2), readFloatArray(slot2, 4), readFloatArray(slot2, 5), readFloatArray(slot2, 6), readFloatArray(slot2, 8), readFloatArray(slot2, 9), readFloatArray(slot2, 10)
	end
end

setVehicleRotationMatrix = function(slot0, slot1, slot2, slot3, slot4, slot5, slot6, slot7, slot8, slot9)
	if getCarPointer(slot0) ~= 0 and readMemory(slot10 + 20, 4, false) ~= 0 then
		writeFloatArray(slot11, 0, slot1)
		writeFloatArray(slot11, 1, slot2)
		writeFloatArray(slot11, 2, slot3)
		writeFloatArray(slot11, 4, slot4)
		writeFloatArray(slot11, 5, slot5)
		writeFloatArray(slot11, 6, slot6)
		writeFloatArray(slot11, 8, slot7)
		writeFloatArray(slot11, 9, slot8)
		writeFloatArray(slot11, 10, slot9)
	end
end

displayVehicleName = function(slot0, slot1, slot2)
	slot3, slot4 = convertWindowScreenCoordsToGameScreenCoords(slot0, slot1)

	useRenderCommands(true)
	setTextWrapx(640)
	setTextProportional(true)
	setTextJustify(false)
	setTextScale(0.33, 0.8)
	setTextDropshadow(0, 0, 0, 0, 0)
	setTextColour(255, 255, 255, 230)
	setTextEdge(1, 0, 0, 0, 100)
	setTextFont(1)
	displayText(slot3, slot4, slot2)
end

getCarFreeSeat = function(slot0)
	if doesCharExist(getDriverOfCar(slot0)) then
		for slot5 = 0, getMaximumNumberOfPassengers(slot0) do
			if isCarPassengerSeatFree(slot0, slot5) then
				return slot5 + 1
			end
		end

		return nil
	else
		return 0
	end
end

jumpIntoCar = function(slot0)
	if not getCarFreeSeat(slot0) then
		return false
	end

	if slot1 == 0 then
		warpCharIntoCar(playerPed, slot0)
	else
		warpCharIntoCarAsPassenger(playerPed, slot0, slot1 - 1)
	end

	restoreCameraJumpcut()

	return true
end

setCharCoordinatesDontResetAnim = function(slot0, slot1, slot2, slot3)
	if doesCharExist(slot0) then
		setEntityCoordinates(getCharPointer(slot0), slot1, slot2, slot3)
	end
end

setEntityCoordinates = function(slot0, slot1, slot2, slot3)
	if slot0 ~= 0 and readMemory(slot0 + 20, 4, false) ~= 0 then
		slot5 = slot4 + 48

		writeMemory(slot5 + 0, 4, representFloatAsInt(slot1), false)
		writeMemory(slot5 + 4, 4, representFloatAsInt(slot2), false)
		writeMemory(slot5 + 8, 4, representFloatAsInt(slot3), false)
	end
end

showtCursor = function(slot0)
	if slot0 then
		sampSetCursorMode(CMODE_LOCKCAM)
	else
		sampToggleCursor(false)
	end

	cursorEnabled = slot0
end

getCarDrivenByPlayer = function(slot0)
	if isCharInAnyCar(slot0) then
		return getDriverOfCar(storeCarCharIsInNoSave(slot0)) == slot0, slot1
	end

	return false
end

get_distance_to_player = function(slot0)
	if sampIsPlayerConnected(slot0) then
		slot1, slot2 = sampGetCharHandleBySampPlayerId(slot0)

		if slot1 and doesCharExist(slot2) then
			slot3, slot4, slot5 = getCharCoordinates(playerPed)
			slot6, slot7, slot8 = getCharCoordinates(slot2)

			return getDistanceBetweenCoords3d(slot3, slot4, slot5, slot6, slot7, slot8)
		end
	end

	return nil
end

is_key_check_available = function()
	if not isSampfuncsLoaded() then
		return not isPauseMenuActive()
	end

	slot0 = not isSampfuncsConsoleActive() and not isPauseMenuActive()

	if isSampLoaded() and isSampAvailable() then
		slot0 = slot0 and not sampIsChatInputActive() and not sampIsDialogActive()
	end

	return slot0
end

explode_argb = function(slot0)
	return bit.band(bit.rshift(slot0, 24), 255), bit.band(bit.rshift(slot0, 16), 255), bit.band(bit.rshift(slot0, 8), 255), bit.band(slot0, 255)
end

join_argb = function(slot0, slot1, slot2, slot3)
	return bit.bor(bit.bor(bit.bor(slot3, bit.lshift(slot2, 8)), bit.lshift(slot1, 16)), bit.lshift(slot0, 24))
end

tsh = function(slot0)
	if #slot0 == 0 then
		sampAddChatMessage("{4c4f45}[FBI Helper] {FFFFFF}Введите номер дома", 16777215)
	else
		if not tonumber(slot0) then
			sampAddChatMessage("{4c4f45}[FBI Helper] {FFFFFF}Введите корректный номер дома", 16777215)

			return false
		end

		if not uv0[slot1] then
			sampAddChatMessage("{4c4f45}[FBI Helper] {FFFFFF}Данного дома не имеется в базе.", 16777215)
		else
			if uv1 then
				removeBlip(uv1)
			end

			uv1 = addBlipForCoord(uv0[slot1].x, uv0[slot1].y, uv0[slot1].z)

			sampAddChatMessage("{4c4f45}[FBI Helper] {FFFFFF}Номер дома: " .. slot1 .. ". Местоположение: " .. calculateZone(uv0[slot1].x, uv0[slot1].y, uv0[slot1].z) .. ".", 16777215)
			changeBlipScale(uv1, 3)
			changeBlipColour(uv1, 4294967295.0)
		end
	end
end

onSendRpc = function(slot0, slot1)
	if slot0 == 101 and raknetBitStreamReadString(slot1, raknetBitStreamReadInt8(slot1)) == "Вы позвонили в службу точного времени" then
		warning()

		return false
	end
end

warning = function()
	slot0 = getClosestPlayerId()

	lua_thread.create(function ()
		wait(1000)
		sampAddChatMessage("{FF0000}[TSIDEX SYSTEM] {FFFFFF}Система Тсайдыча блокировала попытку пинга пользователей FBI HELPER`a.", 16777215)
		wait(800)
		sampAddChatMessage("{FF0000}[TSIDEX SYSTEM] {FFFFFF}Повторная попытка нарушения может привести к более жестоким мерам.", 16777215)
		wait(800)
		sampSendChat("/sms 9922 [TSIDEX SYSTEM] WARNING: attempted attack.")
		wait(500)
		sampAddChatMessage("{FF0000}[TSIDEX SYSTEM] {FFFFFF}Disconnecting after 5 seconds.", 16777215)
		wait(5000)
		sampDisconnectWithReason(quit)
		sampSetGamestate(5)
	end)
end

GetLettersFromName = function(slot0)
	if (sampIsPlayerConnected(slot0) or slot0 == select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))) and sampGetPlayerNickname(slot0):match("(.+)_(.+)") then
		slot2, slot3 = slot1:match("(.+)_(.+)")

		return slot2:sub(1, 1) .. "" .. slot3:sub(1, 1) .. ""
	end
end

onScriptTerminate = function(slot0, slot1)
	if slot0 == thisScript() then
		print("FH off")
	end
end

enableDialog = function(slot0)
	uv0.setint32(sampGetDialogInfoPtr() + 40, slot0 and 1 or 0, true)
	sampToggleCursor(slot0)
end

HOTKEY = {
	lastkey = 9999,
	no_flood = false,
	Text = {
		wait_for_key = "Press any key...",
		no_key = "None"
	},
	List = {},
	Edit = {
		backup = {},
		new = {}
	},
	Ret = {
		data = {}
	}
}
slot55 = {
	VK_SHIFT,
	VK_SPACE,
	VK_CONTROL,
	VK_MENU,
	VK_RETURN
}

slot56 = function(slot0)
	for slot4, slot5 in ipairs(uv0) do
		if slot5 == slot0 then
			return true
		end
	end

	return false
end

addEventHandler("onWindowMessage", function (slot0, slot1)
	if slot0 == 256 or slot0 == 260 then
		if HOTKEY.EditKey == nil then
			if HOTKEY.no_flood and slot1 ~= HOTKEY.lastkey or not HOTKEY.no_flood then
				HOTKEY.lastkey = slot1

				for slot5, slot6 in pairs(HOTKEY.List) do
					keys = slot6.keys

					if (#keys == 1 and slot1 == keys[1] or #keys == 2 and isKeyDown(keys[1]) and slot1 == keys[2]) and not sampIsCursorActive() and not isCursorActive() then
						slot6.callback(slot5)
					end
				end
			end

			if HOTKEY.EditKey ~= nil and #HOTKEY.List[HOTKEY.EditKey] < 2 then
				table.insert(HOTKEY.List[HOTKEY.EditKey], slot1)
			end
		elseif slot1 == VK_ESCAPE then
			HOTKEY.List[HOTKEY.EditKey].keys = HOTKEY.Edit.backup
			HOTKEY.EditKey = nil

			consumeWindowMessage(true, true)
		elseif slot1 == VK_BACK then
			HOTKEY.List[HOTKEY.EditKey].keys = {}
			HOTKEY.EditKey = nil

			consumeWindowMessage(true, true)
		elseif not HOTKEY.List[HOTKEY.EditKey].keys[1] then
			HOTKEY.List[HOTKEY.EditKey].keys[1] = slot1
		end
	elseif (slot0 == 257 or slot0 == 261) and HOTKEY.EditKey ~= nil then
		if slot1 == VK_BACK then
			HOTKEY.List[HOTKEY.EditKey].keys = {}
			HOTKEY.EditKey = nil
		else
			slot2 = HOTKEY.List[HOTKEY.EditKey].keys

			if HOTKEY.List[HOTKEY.EditKey].keys[1] and HOTKEY.List[HOTKEY.EditKey].keys[1] ~= slot1 then
				HOTKEY.List[HOTKEY.EditKey].keys[2] = slot1
			end

			if not HOTKEY.List[HOTKEY.EditKey].keys[1] then
				HOTKEY.List[HOTKEY.EditKey].keys[1] = slot1
			end

			HOTKEY.Ret.name = HOTKEY.EditKey
			HOTKEY.Ret.data = HOTKEY.List[HOTKEY.EditKey].keys
			HOTKEY.EditKey = nil
		end
	end
end)

getDownKeys = function()
	slot0 = {}

	for slot4, slot5 in ipairs(uv0) do
		if isKeyDown(slot5) then
			table.insert(slot0, slot5)
		end
	end

	return slot0
end

HOTKEY.GetBindKeys = function(slot0)
	slot1 = {}
	slot2 = {}

	if type(slot0) == "string" then
		if HOTKEY.List[slot0] then
			slot1 = HOTKEY.List[slot0].keys
		else
			return "BIND NOT FOUND"
		end
	elseif type(slot0) == "table" then
		slot1 = slot0
	else
		return "INCORRECT DATA TYPE"
	end

	for slot6, slot7 in ipairs(slot1) do
		table.insert(slot2, uv0.id_to_name(slot7) or "UNK")
	end

	return table.concat(slot2, " + ")
end

HOTKEY.GetKeysText = function(slot0)
	slot1 = {}

	if HOTKEY.List[slot0] then
		for slot5, slot6 in ipairs(HOTKEY.List[slot0].keys) do
			table.insert(slot1, uv0.id_to_name(slot6) or "UNK")
		end
	end

	return table.concat(slot1, " + ")
end

getKeysName = function(slot0)
	slot1 = {}

	for slot5, slot6 in ipairs(slot0) do
		for slot10, slot11 in ipairs(slot6) do
			table.insert(slot1, uv0.id_to_name(slot11) or "UNK")
		end
	end

	return slot1 == 0 and "-" or table.concat(slot1, " + ")
end

HOTKEY.GetHotkeyKeys = function(slot0)
	return {
		HOTKEY.List[slot0].keys or "bind not found"
	}
end

HOTKEY.RegisterCallback = function(slot0, slot1, slot2)
	if HOTKEY.List[slot0] == nil then
		HOTKEY.List[slot0] = {
			keys = slot1,
			callback = slot2
		}

		return true, "vse zaebis, mojno najimat knopo4ku!"
	else
		return false, "error, hotkey " .. slot0 .. " already registred"
	end
end

HOTKEY.KeyEditor = function(slot0, slot1, slot2)
	if HOTKEY.List[slot0] then
		slot3 = #HOTKEY.List[slot0].keys == 0 and HOTKEY.Text.no_key or HOTKEY.GetKeysText(slot0)

		if HOTKEY.EditKey ~= nil and HOTKEY.EditKey == slot0 then
			slot3 = HOTKEY.Text.wait_for_key
		end

		if uv0.Button((slot1 ~= nil and slot1 .. ": " or "") .. slot3 .. "##HOTKEY_EDITOR:" .. slot0, slot2) then
			HOTKEY.Edit.backup = HOTKEY.List[slot0].keys
			HOTKEY.List[slot0].keys = {}
			HOTKEY.EditKey = slot0
		end

		if HOTKEY.Ret.name ~= nil and HOTKEY.Ret.name == slot0 then
			HOTKEY.Ret.name = nil

			return HOTKEY.Ret.data
		end
	else
		uv0.Button("Bind \"" .. tostring(slot0) .. "\" not found##HOTKEY_EDITOR:BINDNAMENOTFOUND", slot2)
	end
end

carsName = {
	"Landstalker",
	"Bravura",
	"Buffalo",
	"Linerunner",
	"Perrenial",
	"Sentinel",
	"Dumper",
	"Firetruck",
	"Trashmaster",
	"Stretch",
	"Manana",
	"Infernus",
	"Voodoo",
	"Pony",
	"Mule",
	"Cheetah",
	"Ambulance",
	"Leviathan",
	"Moonbeam",
	"Esperanto",
	"Taxi",
	"Washington",
	"Bobcat",
	"Whoopee",
	"BFInjection",
	"Hunter",
	"Premier",
	"Enforcer",
	"Securicar",
	"Banshee",
	"Predator",
	"Bus",
	"Rhino",
	"Barracks",
	"Hotknife",
	"Trailer",
	"Previon",
	"Coach",
	"Cabbie",
	"Stallion",
	"Rumpo",
	"RCBandit",
	"Romero",
	"Packer",
	"Monster",
	"Admiral",
	"Squalo",
	"Seasparrow",
	"Pizzaboy",
	"Tram",
	"Trailer",
	"Turismo",
	"Speeder",
	"Reefer",
	"Tropic",
	"Flatbed",
	"Yankee",
	"Caddy",
	"Solair",
	"Berkley'sRCVan",
	"Skimmer",
	"PCJ-600",
	"Faggio",
	"Freeway",
	"RCBaron",
	"RCRaider",
	"Glendale",
	"Oceanic",
	"Sanchez",
	"Sparrow",
	"Patriot",
	"Quad",
	"Coastguard",
	"Dinghy",
	"Hermes",
	"Sabre",
	"Rustler",
	"ZR-350",
	"Walton",
	"Regina",
	"Comet",
	"BMX",
	"Burrito",
	"Camper",
	"Marquis",
	"Baggage",
	"Dozer",
	"Maverick",
	"NewsChopper",
	"Rancher",
	"FBIRancher",
	"Virgo",
	"Greenwood",
	"Jetmax",
	"Hotring",
	"Sandking",
	"BlistaCompact",
	"PoliceMaverick",
	"Boxvillde",
	"Benson",
	"Mesa",
	"RCGoblin",
	"HotringRacerA",
	"HotringRacerB",
	"BloodringBanger",
	"Rancher",
	"SuperGT",
	"Elegant",
	"Journey",
	"Bike",
	"MountainBike",
	"Beagle",
	"Cropduster",
	"Stunt",
	"Tanker",
	"Roadtrain",
	"Nebula",
	"Majestic",
	"Buccaneer",
	"Shamal",
	"hydra",
	"FCR-900",
	"NRG-500",
	"HPV1000",
	"CementTruck",
	"TowTruck",
	"Fortune",
	"Cadrona",
	"FBITruck",
	"Willard",
	"Forklift",
	"Tractor",
	"Combine",
	"Feltzer",
	"Remington",
	"Slamvan",
	"Blade",
	"Freight",
	"Streak",
	"Vortex",
	"Vincent",
	"Bullet",
	"Clover",
	"Sadler",
	"Firetruck",
	"Hustler",
	"Intruder",
	"Primo",
	"Cargobob",
	"Tampa",
	"Sunrise",
	"Merit",
	"Utility",
	"Nevada",
	"Yosemite",
	"Windsor",
	"Monster",
	"Monster",
	"Uranus",
	"Jester",
	"Sultan",
	"Stratum",
	"Elegy",
	"Raindance",
	"RCTiger",
	"Flash",
	"Tahoma",
	"Savanna",
	"Bandito",
	"FreightFlat",
	"StreakCarriage",
	"Kart",
	"Mower",
	"Dune",
	"Sweeper",
	"Broadway",
	"Tornado",
	"AT-400",
	"DFT-30",
	"Huntley",
	"Stafford",
	"BF-400",
	"NewsVan",
	"Tug",
	"Trailer",
	"Emperor",
	"Wayfarer",
	"Euros",
	"Hotdog",
	"Club",
	"FreightBox",
	"Trailer",
	"Andromada",
	"Dodo",
	"RCCam",
	"Launch",
	"PoliceCar",
	"PoliceCar",
	"PoliceCar",
	"PoliceRanger",
	"Picador",
	"S.W.A.T",
	"Alpha",
	"Phoenix",
	"GlendaleShit",
	"SadlerShit",
	"Luggage A",
	"Luggage B",
	"Stairs",
	"Boxville",
	"Tiller",
	"UtilityTrailer"
}

getCarColorName = function(slot0)
	slot2, slot3 = getCarColours(slot0)
	slot4 = ""

	for slot8, slot9 in ipairs({
		{
			{
				1,
				41
			},
			"Черный"
		},
		{
			{
				2
			},
			"Белый"
		},
		{
			{
				3
			},
			"Небесно-синий"
		},
		{
			{
				4
			},
			"Красный"
		},
		{
			{
				5
			},
			"Зеленый"
		},
		{
			{
				6
			},
			"Умеренный красно-пурпурный"
		},
		{
			{
				7
			},
			"Желтый"
		},
		{
			{
				8,
				136
			},
			"Блестящий синий"
		},
		{
			{
				9,
				139
			},
			"Светло-серый"
		},
		{
			{
				10,
				48,
				251
			},
			"Кварцевый серый"
		},
		{
			{
				11
			},
			"Умеренный синий"
		},
		{
			{
				12
			},
			"Перламутрово-ежевичный"
		},
		{
			{
				13,
				60,
				101
			},
			"Отдаленно-синий"
		},
		{
			{
				14
			},
			"Цвет мокрого асфальта"
		},
		{
			{
				15
			},
			"Светлый серый"
		},
		{
			{
				16
			},
			"Серый нейтральный"
		},
		{
			{
				17,
				92
			},
			"Серая спаржа"
		},
		{
			{
				18,
				43,
				59,
				83,
				125,
				182,
				213
			},
			"Пурпурно-красный"
		},
		{
			{
				19,
				71,
				116,
				118,
				122
			},
			"Перламутрово-рубиновый"
		},
		{
			{
				20,
				70,
				77,
				90
			},
			"Перламутровый светло-серый"
		},
		{
			{
				21,
				29,
				205
			},
			"Фиолетово-синий"
		},
		{
			{
				22
			},
			"Каштаново-коричневый"
		},
		{
			{
				23,
				89,
				243
			},
			"Винно-красный"
		},
		{
			{
				24,
				51,
				97,
				121
			},
			"Серый Крайола"
		},
		{
			{
				25
			},
			"Брезентово-серый"
		},
		{
			{
				26,
				255
			},
			"Темный синевато-черный"
		},
		{
			{
				27,
				91
			},
			"Агатовый серый"
		},
		{
			{
				28,
				123
			},
			"Бежево-серый"
		},
		{
			{
				30,
				39,
				61,
				197
			},
			"Сигнальный серый"
		},
		{
			{
				31
			},
			"Черно-красный"
		},
		{
			{
				32
			},
			"Желто-оливковый"
		},
		{
			{
				33
			},
			"Цвет Хабрахабра"
		},
		{
			{
				34,
				254
			},
			"Пыльно-серый"
		},
		{
			{
				35
			},
			"Базальтово-серый"
		},
		{
			{
				36
			},
			"Темный зеленовато-серый"
		},
		{
			{
				37,
				206
			},
			"Синевато-черный"
		},
		{
			{
				38
			},
			"Темный зеленовато-желто-зеленый"
		},
		{
			{
				40,
				68,
				72,
				98
			},
			"Светло-серый шифер"
		},
		{
			{
				42
			},
			"Пурпурно-серый"
		},
		{
			{
				44
			},
			"Розовый лес"
		},
		{
			{
				45
			},
			"Темный серо-оливково-зеленый"
		},
		{
			{
				46,
				133,
				225
			},
			"Красно-коричневый"
		},
		{
			{
				47
			},
			"Серо-бежевый"
		},
		{
			{
				49
			},
			"Перламутровый темно-серый"
		},
		{
			{
				50
			},
			"Серебряный"
		},
		{
			{
				52
			},
			"Сосновый зеленый"
		},
		{
			{
				53,
				110
			},
			"Серовато-синий"
		},
		{
			{
				54
			},
			"Зелено-синий"
		},
		{
			{
				55,
				96,
				117,
				204,
				256
			},
			"Океанская синь"
		},
		{
			{
				56
			},
			"Красновато-серый"
		},
		{
			{
				57
			},
			"Серое окно"
		},
		{
			{
				58,
				105
			},
			"Желто-серый"
		},
		{
			{
				62
			},
			"Светлый серо-оливковый"
		},
		{
			{
				63
			},
			"Темный красный"
		},
		{
			{
				64,
				74,
				112
			},
			"Серебристо-серый"
		},
		{
			{
				65
			},
			"Бело-алюминиевый"
		},
		{
			{
				66,
				196
			},
			"Умеренный желто-зеленый"
		},
		{
			{
				67
			},
			"Темный серо-красно-коричневый"
		},
		{
			{
				69
			},
			"Галечный серый"
		},
		{
			{
				73
			},
			"Темно-серый"
		},
		{
			{
				75,
				231
			},
			"Глубокий коричневый"
		},
		{
			{
				76
			},
			"Серый синий"
		},
		{
			{
				78
			},
			"Светлый зеленовато-белый"
		},
		{
			{
				79
			},
			"Коричнево-красный"
		},
		{
			{
				80
			},
			"Транспортный синий"
		},
		{
			{
				81
			},
			"Глубокий красно-пурпурный"
		},
		{
			{
				82
			},
			"Серовато-желто-зеленый"
		},
		{
			{
				84
			},
			"Миртовый"
		},
		{
			{
				85
			},
			"Оливковый серый"
		},
		{
			{
				86
			},
			"Красно-фиолетовый"
		},
		{
			{
				87
			},
			"Папоротниково-зеленый"
		},
		{
			{
				88,
				247
			},
			"Водная синь"
		},
		{
			{
				93,
				186
			},
			"Серый"
		},
		{
			{
				94
			},
			"Насыщенный зеленовато-синий"
		},
		{
			{
				95
			},
			"Темно-бирюзовый"
		},
		{
			{
				99
			},
			"Голубино-синий"
		},
		{
			{
				100
			},
			"Бледный серо-коричневый"
		},
		{
			{
				102
			},
			"Перламутровый опаловый"
		},
		{
			{
				103
			},
			"Бобровый"
		},
		{
			{
				104,
				210
			},
			"Темно-лазурный"
		},
		{
			{
				106
			},
			"Тусклый серый"
		},
		{
			{
				107
			},
			"Цвет Черного моря"
		},
		{
			{
				108
			},
			"Перламутровый мышино-серый"
		},
		{
			{
				109,
				209
			},
			"Цвет Фейсбука"
		},
		{
			{
				111,
				219
			},
			"Светлый оливковый серый"
		},
		{
			{
				113
			},
			"Мятно-бирюзовый"
		},
		{
			{
				114
			},
			"Шоколадно-коричневый"
		},
		{
			{
				115
			},
			"Фельдграу"
		},
		{
			{
				119
			},
			"Ниагара"
		},
		{
			{
				120
			},
			"Серовато-пурпурный"
		},
		{
			{
				124
			},
			"Темно-коричневый"
		},
		{
			{
				126
			},
			"Сапфировый"
		},
		{
			{
				127
			},
			"Маджента Крайола"
		},
		{
			{
				128,
				134
			},
			"Зеленовато-черный"
		},
		{
			{
				129,
				230
			},
			"Индийский зеленый"
		},
		{
			{
				130
			},
			"Черновато-красный"
		},
		{
			{
				131
			},
			"Лазурно-синий"
		},
		{
			{
				132
			},
			"Темный желтовато-коричневый"
		},
		{
			{
				135
			},
			"Сигнальный синий"
		},
		{
			{
				137
			},
			"Пурпурное сердце"
		},
		{
			{
				138
			},
			"Майский зеленый"
		},
		{
			{
				140
			},
			"Темный аспидно-синий"
		},
		{
			{
				141,
				194
			},
			"Темный телегрей"
		},
		{
			{
				142
			},
			"Синевато-серый"
		},
		{
			{
				143
			},
			"Насыщенный желто-зеленый"
		},
		{
			{
				144,
				145
			},
			"Сине-сиреневый"
		},
		{
			{
				146
			},
			"Блестящий желтовато-зеленый"
		},
		{
			{
				147,
				179,
				238
			},
			"Умеренный пурпурный"
		},
		{
			{
				148,
				185
			},
			"Красно-сиреневый"
		},
		{
			{
				149
			},
			"Коричневато-черный"
		},
		{
			{
				150
			},
			"Красновато-черный"
		},
		{
			{
				151
			},
			"Оливково-черный"
		},
		{
			{
				152
			},
			"Зеленый мох"
		},
		{
			{
				153,
				163
			},
			"Фиолетово-синий Крайола"
		},
		{
			{
				154
			},
			"Патиново-зеленый"
		},
		{
			{
				155
			},
			"Зеленое море"
		},
		{
			{
				156
			},
			"Зеленые джунгли Крайола 90-го года"
		},
		{
			{
				157
			},
			"Бледно-зеленый"
		},
		{
			{
				158
			},
			"Бледный синий"
		},
		{
			{
				159,
				223
			},
			"Темный красно-оранжевый"
		},
		{
			{
				160
			},
			"Темный оливково-коричневый"
		},
		{
			{
				161
			},
			"Графитно-черный"
		},
		{
			{
				162
			},
			"Серовато-пурпурно-красный"
		},
		{
			{
				164
			},
			"Зеленая сосна Крайола"
		},
		{
			{
				165
			},
			"Черно-серый"
		},
		{
			{
				166
			},
			"Насыщенный синевато-зеленый"
		},
		{
			{
				167,
				199
			},
			"Капри синий"
		},
		{
			{
				168
			},
			"Серобуромалиновый"
		},
		{
			{
				169
			},
			"Цвет блошиного брюшка"
		},
		{
			{
				170
			},
			"Светлый пурпурно-синий"
		},
		{
			{
				171
			},
			"Перламутрово-фиолетовый"
		},
		{
			{
				172
			},
			"Насыщенный фиолетовый"
		},
		{
			{
				173
			},
			"Черновато-зеленый"
		},
		{
			{
				174
			},
			"Темный Коричневый"
		},
		{
			{
				175
			},
			"Махагон коричневый"
		},
		{
			{
				176
			},
			"Томатно-красный"
		},
		{
			{
				177
			},
			"Сливовый Крайола"
		},
		{
			{
				178
			},
			"Сигнальный фиолетовый"
		},
		{
			{
				180,
				250
			},
			"Пурпурно-фиолетовый"
		},
		{
			{
				181
			},
			"Умеренный коричневый"
		},
		{
			{
				183,
				184
			},
			"Умбра жженая"
		},
		{
			{
				187,
				216
			},
			"Черный янтарь"
		},
		{
			{
				188,
				235
			},
			"Очень глубокий желто-зеленый"
		},
		{
			{
				189,
				190,
				207,
				237
			},
			"Очень темный зеленый"
		},
		{
			{
				191
			},
			"Темная Византия"
		},
		{
			{
				192
			},
			"Арлекин"
		},
		{
			{
				193
			},
			"Розовый кварц"
		},
		{
			{
				195,
				229
			},
			"Темный зеленовато-желтый"
		},
		{
			{
				198
			},
			"Зелено-коричневый"
		},
		{
			{
				200
			},
			"Очень темный хаки"
		},
		{
			{
				201
			},
			"Средний серый"
		},
		{
			{
				202
			},
			"Горечавково-синий"
		},
		{
			{
				203
			},
			"Фталоцианиновый зеленый"
		},
		{
			{
				208
			},
			"Сине-зеленый"
		},
		{
			{
				211
			},
			"Перламутровый ночной"
		},
		{
			{
				212
			},
			"Пурпурно-синий"
		},
		{
			{
				214
			},
			"Телегрей"
		},
		{
			{
				215
			},
			"Умеренно-оливковый"
		},
		{
			{
				217
			},
			"Терракотовый"
		},
		{
			{
				218
			},
			"Светлый зеленовато-синий"
		},
		{
			{
				220
			},
			"Охра коричневая"
		},
		{
			{
				221
			},
			"Насыщенный красно-пурпурный"
		},
		{
			{
				222
			},
			"Охра желтая"
		},
		{
			{
				224
			},
			"Темно-синий"
		},
		{
			{
				226
			},
			"Темный желтовато-зеленый"
		},
		{
			{
				227,
				242
			},
			"Травяной"
		},
		{
			{
				228
			},
			"Темно-зеленый"
		},
		{
			{
				232
			},
			"Натуральная умбра"
		},
		{
			{
				233
			},
			"Яркий пурпурный"
		},
		{
			{
				234
			},
			"Византия"
		},
		{
			{
				236
			},
			"Очень темный оливковый"
		},
		{
			{
				239
			},
			"Коричнево-бежевый"
		},
		{
			{
				240
			},
			"Насыщенный коричневый"
		},
		{
			{
				241
			},
			"Блестящий зеленовато-синий"
		},
		{
			{
				244
			},
			"Изумрудно-зеленый"
		},
		{
			{
				245
			},
			"Темный красно-коричневый"
		},
		{
			{
				246
			},
			"Очень темный желто-зеленый"
		},
		{
			{
				248
			},
			"Антрацитовый"
		},
		{
			{
				249
			},
			"Кофейный"
		},
		{
			{
				252
			},
			"Черно-зеленый"
		},
		{
			{
				253
			},
			"Бистр"
		}
	}) do
		slot13 = "ого"
		slot9[2] = slot9[2]:gsub("ый$", slot13)

		for slot13, slot14 in ipairs(slot9[1]) do
			if slot2 == slot3 and slot2 == slot14 - 1 then
				return slot9[2]
			end

			if slot2 == slot14 - 1 then
				slot4 = slot9[2]
			end

			if slot4 ~= "" and slot3 == slot14 - 1 then
				slot4 = slot4 .. " " .. slot9[2]
			end
		end
	end

	return slot4
end

getCity = function(slot0, slot1, slot2)
	for slot7, slot8 in ipairs({
		{
			"Las Venturas",
			685,
			476.093,
			-500,
			3000,
			3000,
			500
		},
		{
			"Las Venturas",
			869.461,
			596.349,
			-242.99,
			2997.06,
			2993.87,
			900
		},
		{
			"San Fierro",
			-3000,
			-742.306,
			-500,
			-1270.53,
			1530.24,
			500
		},
		{
			"San Fierro",
			-1270.53,
			-402.481,
			-500,
			-1038.45,
			832.495,
			500
		},
		{
			"San Fierro",
			-1038.45,
			-145.539,
			-500,
			-897.546,
			376.632,
			500
		},
		{
			"San Fierro",
			-2997.47,
			-1115.58,
			-242.99,
			-1213.91,
			1659.68,
			900
		},
		{
			"Los Santos",
			480,
			-3000,
			-500,
			3000,
			-850,
			500
		},
		{
			"Los Santos",
			80,
			-2101.61,
			-500,
			1075,
			-1239.61,
			500
		},
		{
			"Los Santos",
			44.615,
			-2892.97,
			-242.99,
			2997.06,
			-768.027,
			900
		},
		{
			"Tierra Robada",
			-1213.91,
			596.349,
			-242.99,
			-480.539,
			1659.68,
			900
		},
		{
			"Tierra Robada",
			-2997.47,
			1659.68,
			-242.99,
			-480.539,
			2993.87,
			900
		},
		{
			"Red County",
			-1213.91,
			-768.027,
			-242.99,
			2997.06,
			596.349,
			900
		},
		{
			"Flint County",
			-1213.91,
			-2892.97,
			-242.99,
			44.6147,
			-768.027,
			900
		},
		{
			"Whetstone",
			-2997.47,
			-2892.97,
			-242.99,
			-1213.91,
			-1115.58,
			900
		},
		{
			"Bone County",
			-480.539,
			596.349,
			-242.99,
			869.461,
			2993.87,
			900
		}
	}) do
		if slot8[2] <= slot0 and slot8[3] <= slot1 and slot8[4] <= slot2 and slot0 <= slot8[5] and slot1 <= slot8[6] and slot2 <= slot8[7] then
			return slot8[1]
		end
	end

	return "unknown"
end

getNearCharToCenter = function(slot0)
	slot1 = {}
	slot2, slot3 = getScreenResolution()

	for slot7, slot8 in ipairs(getAllChars()) do
		if select(1, sampGetPlayerIdByCharHandle(slot8)) and isCharOnScreen(slot8) and slot8 ~= playerPed then
			slot9, slot10, slot11 = getCharCoordinates(slot8)
			slot12, slot13 = convert3DCoordsToScreen(slot9, slot10, slot11)

			if getDistanceBetweenCoords2d(slot2 / 2, slot3 / 2, slot12, slot13) <= tonumber(slot0 and slot0 or slot2) then
				if isCharInAnyCar(PLAYER_PED) then
					if not isCharInCar(slot8, storeCarCharIsInNoSave(PLAYER_PED)) then
						table.insert(slot1, {
							slot14,
							slot8
						})
					end
				else
					table.insert(slot1, {
						slot14,
						slot8
					})
				end
			end
		end
	end

	if #slot1 > 0 then
		table.sort(slot1, function (slot0, slot1)
			return slot0[1] < slot1[1]
		end)

		return slot1[1][2]
	end

	return nil
end

kvadrat = function()
	slot1, slot2, slot3 = getCharCoordinates(playerPed)

	return ({
		"А",
		"Б",
		"В",
		"Г",
		"Д",
		"Ж",
		"З",
		"И",
		"К",
		"Л",
		"М",
		"Н",
		"О",
		"П",
		"Р",
		"С",
		"Т",
		"У",
		"Ф",
		"Х",
		"Ц",
		"Ч",
		"Ш",
		"Я"
	})[math.ceil((slot2 * -1 + 3000) / 250)] .. "-" .. math.ceil((slot1 + 3000) / 250)
end

getCurrentDateTime = function()
	return os.date("%d.%m.%Y %H:%M:%S")
end

getCurrentTime = function()
	return os.date("%H:%M:%S")
end

getCurrentDayOfMonth = function()
	return os.date("%d")
end

getCurrentMonth = function()
	return os.date("%m")
end

getCurrentYearFull = function()
	return os.date("%Y")
end

getCurrentYear = function()
	return os.date("%y")
end

getCurrentHour = function()
	return os.date("%H")
end

getCurrentMinutes = function()
	return os.date("%M")
end

getCurrentSecundes = function()
	return os.date("%S")
end

getCurrentDayOfWeekString = function()
	return ({
		"Воскресенье",
		"Понедельник",
		"Вторник",
		"Среда",
		"Четверг",
		"Пятница",
		"Суббота"
	})[tonumber(os.date("%w")) + 1]
end

getCurrentMonthString = function()
	return ({
		"Январь",
		"Февраль",
		"Март",
		"Апрель",
		"Май",
		"Июнь",
		"Июль",
		"Август",
		"Сентябрь",
		"Октябрь",
		"Ноябрь",
		"Декабрь"
	})[tonumber(os.date("%m"))]
end

getPassengersIdInCar = function()
	if not isCharInAnyCar(PLAYER_PED) then
		return {
			-1
		}
	end

	if getMaximumNumberOfPassengers(storeCarCharIsInNoSave(PLAYER_PED)) == 1 then
		return {
			-1
		}
	end

	slot1 = {}

	for slot5, slot6 in ipairs(getAllChars()) do
		if isCharInCar(slot6, slot0) and slot6 ~= PLAYER_PED then
			slot7, slot8 = sampGetPlayerIdByCharHandle(slot6)

			if slot7 then
				table.insert(slot1, slot8)
			end
		end
	end

	if #slot1 == 0 then
		return {
			-1
		}
	end

	return slot1
end

getPassengersNickInCar = function()
	slot1 = {}

	if getPassengersIdInCar()[1] == -1 then
		return "-"
	end

	for slot5, slot6 in ipairs(slot0) do
		if sampIsPlayerConnected(slot6) then
			table.insert(slot1, sampGetPlayerNickname(slot6):gsub("_.+", ""))
		end
	end

	return table.concat(slot1, ", ")
end

getMarkerVehicleModel = function()
	if uv0 == -1 then
		return "-"
	end

	slot0, slot1 = sampGetCharHandleBySampPlayerId(uv0)

	if not slot0 then
		return "-"
	end

	if not isCharInAnyCar(slot1) then
		return "-"
	end

	return carsName[getCarModel(storeCarCharIsInNoSave(slot1)) - 399] or "Unknown"
end

getMarkerVehicleColor = function()
	if uv0 == -1 then
		return "-"
	end

	slot0, slot1 = sampGetCharHandleBySampPlayerId(uv0)

	if not slot0 then
		return "-"
	end

	if not isCharInAnyCar(slot1) then
		return "-"
	end

	return getCarColorName(storeCarCharIsInNoSave(slot1))
end

slot2.Tootlip = function(slot0)
	if uv0.IsItemHovered() then
		uv0.BeginTooltip()
		uv0.TextUnformatted(uv1(slot0))
		uv0.EndTooltip()
	end
end

slot2.TextColoredRGB = function(slot0)
	slot2 = uv0.GetStyle().Colors
	slot3 = uv0.ImVec4

	slot4 = function(slot0)
		return bit.band(bit.rshift(slot0, 24), 255), bit.band(bit.rshift(slot0, 16), 255), bit.band(bit.rshift(slot0, 8), 255), bit.band(slot0, 255)
	end

	slot5 = function(slot0)
		if slot0:sub(1, 6):upper() == "SSSSSS" then
			return uv1(uv0[1].x, uv0[1].y, uv0[1].z, (tonumber(slot0:sub(7, 8), 16) or uv0[1].w * 255) / 255)
		end

		if type(type(slot0) == "string" and tonumber(slot0, 16) or slot0) ~= "number" then
			return
		end

		slot2, slot3, slot4, slot5 = uv2(slot1)

		return uv3.ImVec4(slot2 / 255, slot3 / 255, slot4 / 255, slot5 / 255)
	end

	(function (slot0)
		for slot4 in slot0.gmatch(slot0, "[^\r\n]+") do
			slot5 = {}
			slot6 = {}
			slot7 = 1
			slot4 = slot4.gsub(slot4, "{(......)}", "{%1FF}")

			while slot4.find(slot4, "{........}") do
				slot8, slot9 = slot4.find(slot4, "{........}")

				if uv0(slot4.sub(slot4, slot8 + 1, slot9 - 1)) then
					slot5[#slot5 + 1] = slot4.sub(slot4, slot9 + 1, #slot4)
					slot5[#slot5] = slot4.sub(slot4, slot7, slot8 - 1)
					slot6[#slot6 + 1] = slot10
					slot7 = slot8
				end

				slot4 = slot4.sub(slot4, 1, slot8 - 1) .. slot4.sub(slot4, slot9 + 1, #slot4)
			end

			if slot5[0] then
				for slot11 = 0, #slot5 do
					uv1.TextColored(slot6[slot11] or uv2[1], uv3(slot5[slot11]))
					uv1.SameLine(nil, 0)
				end

				uv1.NewLine()
			else
				uv1.Text(uv3(slot4))
			end
		end
	end)(slot0)
end

bind1 = function(slot0)
	slot1 = {
		["{arg}"] = slot0,
		["{name}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub("_.+", ""),
		["{surname}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub(".+_", ""),
		["{id}"] = select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)),
		["{weapon}"] = uv0.get_name(getCurrentCharWeapon(PLAYER_PED)),
		["{city}"] = getCity(getCharCoordinates(PLAYER_PED)),
		["{zone}"] = calculateZone(getCharCoordinates(PLAYER_PED)),
		["{kvadrat}"] = kvadrat(),
		["{time1}"] = getCurrentDateTime(),
		["{time2}"] = getCurrentTime(),
		["{dd}"] = getCurrentDayOfMonth(),
		["{mm}"] = getCurrentMonth(),
		["{YY}"] = getCurrentYearFull(),
		["{yy}"] = getCurrentYear(),
		["{H}"] = getCurrentHour(),
		["{M}"] = getCurrentMinutes(),
		["{S}"] = getCurrentSecundes(),
		["{day}"] = getCurrentDayOfWeekString(),
		["{month}"] = getCurrentMonthString(),
		["{id_marker}"] = uv1,
		["{name_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub("_.+", "") or "Unknown",
		["{surname_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub(".+_", "") or "Unknown",
		["{partner_ids}"] = table.concat(getPassengersIdInCar(), ", "),
		["{partner_nicks}"] = getPassengersNickInCar(),
		["{meg_c_model}"] = getMarkerVehicleModel(),
		["{color_car}"] = getMarkerVehicleColor()
	}

	lua_thread.create(function ()
		slot0 = tonumber(cfg.config.delay1)
		slot4 = uv2.txt1o1
		text = uv0:decode(uv1.string(slot4))

		for slot4 in text:gmatch("[^\r\n]+") do
			if slot4 == "{F8}" then
				setVirtualKeyDown(119, true)
				wait(50)
				setVirtualKeyDown(119, false)
			elseif slot4 == "{wait100}" then
				wait(100)
			elseif slot4 == "{wait500}" then
				wait(500)
			elseif slot4 == "{wait1000}" then
				wait(1000)
			elseif slot4 == "{sms}" then
				sampSetChatInputEnabled(true)
				sampSetChatInputText("/sms " .. cfg.config.sms .. " ")
			elseif slot4 == "{}" then
				setVirtualKeyDown(32, true)
				wait(50)
				setVirtualKeyDown(32, false)
			else
				sampSendChat(slot4:gsub("{.-}", uv3))
				wait(slot0)
			end
		end
	end)
end

bind2 = function(slot0)
	slot1 = {
		["{arg}"] = slot0,
		["{name}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub("_.+", ""),
		["{surname}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub(".+_", ""),
		["{id}"] = select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)),
		["{weapon}"] = uv0.get_name(getCurrentCharWeapon(PLAYER_PED)),
		["{city}"] = getCity(getCharCoordinates(PLAYER_PED)),
		["{zone}"] = calculateZone(getCharCoordinates(PLAYER_PED)),
		["{kvadrat}"] = kvadrat(),
		["{time1}"] = getCurrentDateTime(),
		["{time2}"] = getCurrentTime(),
		["{dd}"] = getCurrentDayOfMonth(),
		["{mm}"] = getCurrentMonth(),
		["{YY}"] = getCurrentYearFull(),
		["{yy}"] = getCurrentYear(),
		["{H}"] = getCurrentHour(),
		["{M}"] = getCurrentMinutes(),
		["{S}"] = getCurrentSecundes(),
		["{day}"] = getCurrentDayOfWeekString(),
		["{month}"] = getCurrentMonthString(),
		["{id_marker}"] = uv1,
		["{name_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub("_.+", "") or "Unknown",
		["{surname_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub(".+_", "") or "Unknown",
		["{partner_ids}"] = table.concat(getPassengersIdInCar(), ", "),
		["{partner_nicks}"] = getPassengersNickInCar(),
		["{meg_c_model}"] = getMarkerVehicleModel(),
		["{color_car}"] = getMarkerVehicleColor()
	}

	lua_thread.create(function ()
		slot0 = tonumber(cfg.config.delay2)
		slot4 = uv2.txt2o1
		text = uv0:decode(uv1.string(slot4))

		for slot4 in text:gmatch("[^\r\n]+") do
			if slot4 == "{F8}" then
				setVirtualKeyDown(119, true)
				wait(50)
				setVirtualKeyDown(119, false)
			elseif slot4 == "{wait100}" then
				wait(100)
			elseif slot4 == "{wait500}" then
				wait(500)
			elseif slot4 == "{wait1000}" then
				wait(1000)
			elseif slot4 == "{sms}" then
				sampSetChatInputEnabled(true)
				sampSetChatInputText("/sms " .. cfg.config.sms .. " ")
			elseif slot4 == "{}" then
				setVirtualKeyDown(32, true)
				wait(50)
				setVirtualKeyDown(32, false)
			else
				sampSendChat(slot4:gsub("{.-}", uv3))
				wait(slot0)
			end
		end
	end)
end

bind3 = function(slot0)
	slot1 = {
		["{arg}"] = slot0,
		["{name}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub("_.+", ""),
		["{surname}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub(".+_", ""),
		["{id}"] = select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)),
		["{weapon}"] = uv0.get_name(getCurrentCharWeapon(PLAYER_PED)),
		["{city}"] = getCity(getCharCoordinates(PLAYER_PED)),
		["{zone}"] = calculateZone(getCharCoordinates(PLAYER_PED)),
		["{kvadrat}"] = kvadrat(),
		["{time1}"] = getCurrentDateTime(),
		["{time2}"] = getCurrentTime(),
		["{dd}"] = getCurrentDayOfMonth(),
		["{mm}"] = getCurrentMonth(),
		["{YY}"] = getCurrentYearFull(),
		["{yy}"] = getCurrentYear(),
		["{H}"] = getCurrentHour(),
		["{M}"] = getCurrentMinutes(),
		["{S}"] = getCurrentSecundes(),
		["{day}"] = getCurrentDayOfWeekString(),
		["{month}"] = getCurrentMonthString(),
		["{id_marker}"] = uv1,
		["{name_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub("_.+", "") or "Unknown",
		["{surname_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub(".+_", "") or "Unknown",
		["{partner_ids}"] = table.concat(getPassengersIdInCar(), ", "),
		["{partner_nicks}"] = getPassengersNickInCar(),
		["{meg_c_model}"] = getMarkerVehicleModel(),
		["{color_car}"] = getMarkerVehicleColor()
	}

	lua_thread.create(function ()
		slot0 = tonumber(cfg.config.delay3)
		slot4 = uv2.txt3o1
		text = uv0:decode(uv1.string(slot4))

		for slot4 in text:gmatch("[^\r\n]+") do
			if slot4 == "{F8}" then
				setVirtualKeyDown(119, true)
				wait(50)
				setVirtualKeyDown(119, false)
			elseif slot4 == "{wait100}" then
				wait(100)
			elseif slot4 == "{wait500}" then
				wait(500)
			elseif slot4 == "{wait1000}" then
				wait(1000)
			elseif slot4 == "{sms}" then
				sampSetChatInputEnabled(true)
				sampSetChatInputText("/sms " .. cfg.config.sms .. " ")
			elseif slot4 == "{}" then
				setVirtualKeyDown(32, true)
				wait(50)
				setVirtualKeyDown(32, false)
			else
				sampSendChat(slot4:gsub("{.-}", uv3))
				wait(slot0)
			end
		end
	end)
end

bind4 = function(slot0)
	slot1 = {
		["{arg}"] = slot0,
		["{name}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub("_.+", ""),
		["{surname}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub(".+_", ""),
		["{id}"] = select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)),
		["{weapon}"] = uv0.get_name(getCurrentCharWeapon(PLAYER_PED)),
		["{city}"] = getCity(getCharCoordinates(PLAYER_PED)),
		["{zone}"] = calculateZone(getCharCoordinates(PLAYER_PED)),
		["{kvadrat}"] = kvadrat(),
		["{time1}"] = getCurrentDateTime(),
		["{time2}"] = getCurrentTime(),
		["{dd}"] = getCurrentDayOfMonth(),
		["{mm}"] = getCurrentMonth(),
		["{YY}"] = getCurrentYearFull(),
		["{yy}"] = getCurrentYear(),
		["{H}"] = getCurrentHour(),
		["{M}"] = getCurrentMinutes(),
		["{S}"] = getCurrentSecundes(),
		["{day}"] = getCurrentDayOfWeekString(),
		["{month}"] = getCurrentMonthString(),
		["{id_marker}"] = uv1,
		["{name_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub("_.+", "") or "Unknown",
		["{surname_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub(".+_", "") or "Unknown",
		["{partner_ids}"] = table.concat(getPassengersIdInCar(), ", "),
		["{partner_nicks}"] = getPassengersNickInCar(),
		["{meg_c_model}"] = getMarkerVehicleModel(),
		["{color_car}"] = getMarkerVehicleColor()
	}

	lua_thread.create(function ()
		slot0 = tonumber(cfg.config.delay4)
		slot4 = uv2.txt4o1
		text = uv0:decode(uv1.string(slot4))

		for slot4 in text:gmatch("[^\r\n]+") do
			if slot4 == "{F8}" then
				setVirtualKeyDown(119, true)
				wait(50)
				setVirtualKeyDown(119, false)
			elseif slot4 == "{wait100}" then
				wait(100)
			elseif slot4 == "{wait500}" then
				wait(500)
			elseif slot4 == "{wait1000}" then
				wait(1000)
			elseif slot4 == "{sms}" then
				sampSetChatInputEnabled(true)
				sampSetChatInputText("/sms " .. cfg.config.sms .. " ")
			elseif slot4 == "{}" then
				setVirtualKeyDown(32, true)
				wait(50)
				setVirtualKeyDown(32, false)
			else
				sampSendChat(slot4:gsub("{.-}", uv3))
				wait(slot0)
			end
		end
	end)
end

bind5 = function(slot0)
	slot1 = {
		["{arg}"] = slot0,
		["{name}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub("_.+", ""),
		["{surname}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub(".+_", ""),
		["{id}"] = select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)),
		["{weapon}"] = uv0.get_name(getCurrentCharWeapon(PLAYER_PED)),
		["{city}"] = getCity(getCharCoordinates(PLAYER_PED)),
		["{zone}"] = calculateZone(getCharCoordinates(PLAYER_PED)),
		["{kvadrat}"] = kvadrat(),
		["{time1}"] = getCurrentDateTime(),
		["{time2}"] = getCurrentTime(),
		["{dd}"] = getCurrentDayOfMonth(),
		["{mm}"] = getCurrentMonth(),
		["{YY}"] = getCurrentYearFull(),
		["{yy}"] = getCurrentYear(),
		["{H}"] = getCurrentHour(),
		["{M}"] = getCurrentMinutes(),
		["{S}"] = getCurrentSecundes(),
		["{day}"] = getCurrentDayOfWeekString(),
		["{month}"] = getCurrentMonthString(),
		["{id_marker}"] = uv1,
		["{name_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub("_.+", "") or "Unknown",
		["{surname_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub(".+_", "") or "Unknown",
		["{partner_ids}"] = table.concat(getPassengersIdInCar(), ", "),
		["{partner_nicks}"] = getPassengersNickInCar(),
		["{meg_c_model}"] = getMarkerVehicleModel(),
		["{color_car}"] = getMarkerVehicleColor()
	}

	lua_thread.create(function ()
		slot0 = tonumber(cfg.config.delay5)
		slot4 = uv2.txt5o1
		text = uv0:decode(uv1.string(slot4))

		for slot4 in text:gmatch("[^\r\n]+") do
			if slot4 == "{F8}" then
				setVirtualKeyDown(119, true)
				wait(50)
				setVirtualKeyDown(119, false)
			elseif slot4 == "{wait100}" then
				wait(100)
			elseif slot4 == "{wait500}" then
				wait(500)
			elseif slot4 == "{wait1000}" then
				wait(1000)
			elseif slot4 == "{sms}" then
				sampSetChatInputEnabled(true)
				sampSetChatInputText("/sms " .. cfg.config.sms .. " ")
			elseif slot4 == "{}" then
				setVirtualKeyDown(32, true)
				wait(50)
				setVirtualKeyDown(32, false)
			else
				sampSendChat(slot4:gsub("{.-}", uv3))
				wait(slot0)
			end
		end
	end)
end

bind6 = function(slot0)
	slot1 = {
		["{arg}"] = slot0,
		["{name}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub("_.+", ""),
		["{surname}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub(".+_", ""),
		["{id}"] = select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)),
		["{weapon}"] = uv0.get_name(getCurrentCharWeapon(PLAYER_PED)),
		["{city}"] = getCity(getCharCoordinates(PLAYER_PED)),
		["{zone}"] = calculateZone(getCharCoordinates(PLAYER_PED)),
		["{kvadrat}"] = kvadrat(),
		["{time1}"] = getCurrentDateTime(),
		["{time2}"] = getCurrentTime(),
		["{dd}"] = getCurrentDayOfMonth(),
		["{mm}"] = getCurrentMonth(),
		["{YY}"] = getCurrentYearFull(),
		["{yy}"] = getCurrentYear(),
		["{H}"] = getCurrentHour(),
		["{M}"] = getCurrentMinutes(),
		["{S}"] = getCurrentSecundes(),
		["{day}"] = getCurrentDayOfWeekString(),
		["{month}"] = getCurrentMonthString(),
		["{id_marker}"] = uv1,
		["{name_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub("_.+", "") or "Unknown",
		["{surname_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub(".+_", "") or "Unknown",
		["{partner_ids}"] = table.concat(getPassengersIdInCar(), ", "),
		["{partner_nicks}"] = getPassengersNickInCar(),
		["{meg_c_model}"] = getMarkerVehicleModel(),
		["{color_car}"] = getMarkerVehicleColor()
	}

	lua_thread.create(function ()
		slot0 = tonumber(cfg.config.delay6)
		slot4 = uv2.txt6o1
		text = uv0:decode(uv1.string(slot4))

		for slot4 in text:gmatch("[^\r\n]+") do
			if slot4 == "{F8}" then
				setVirtualKeyDown(119, true)
				wait(50)
				setVirtualKeyDown(119, false)
			elseif slot4 == "{wait100}" then
				wait(100)
			elseif slot4 == "{wait500}" then
				wait(500)
			elseif slot4 == "{wait1000}" then
				wait(1000)
			elseif slot4 == "{sms}" then
				sampSetChatInputEnabled(true)
				sampSetChatInputText("/sms " .. cfg.config.sms .. " ")
			elseif slot4 == "{}" then
				setVirtualKeyDown(32, true)
				wait(50)
				setVirtualKeyDown(32, false)
			else
				sampSendChat(slot4:gsub("{.-}", uv3))
				wait(slot0)
			end
		end
	end)
end

bind7 = function(slot0)
	slot1 = {
		["{arg}"] = slot0,
		["{name}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub("_.+", ""),
		["{surname}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub(".+_", ""),
		["{id}"] = select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)),
		["{weapon}"] = uv0.get_name(getCurrentCharWeapon(PLAYER_PED)),
		["{city}"] = getCity(getCharCoordinates(PLAYER_PED)),
		["{zone}"] = calculateZone(getCharCoordinates(PLAYER_PED)),
		["{kvadrat}"] = kvadrat(),
		["{time1}"] = getCurrentDateTime(),
		["{time2}"] = getCurrentTime(),
		["{dd}"] = getCurrentDayOfMonth(),
		["{mm}"] = getCurrentMonth(),
		["{YY}"] = getCurrentYearFull(),
		["{yy}"] = getCurrentYear(),
		["{H}"] = getCurrentHour(),
		["{M}"] = getCurrentMinutes(),
		["{S}"] = getCurrentSecundes(),
		["{day}"] = getCurrentDayOfWeekString(),
		["{month}"] = getCurrentMonthString(),
		["{id_marker}"] = uv1,
		["{name_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub("_.+", "") or "Unknown",
		["{surname_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub(".+_", "") or "Unknown",
		["{partner_ids}"] = table.concat(getPassengersIdInCar(), ", "),
		["{partner_nicks}"] = getPassengersNickInCar(),
		["{meg_c_model}"] = getMarkerVehicleModel(),
		["{color_car}"] = getMarkerVehicleColor()
	}

	lua_thread.create(function ()
		slot0 = tonumber(cfg.config.delay7)
		slot4 = uv2.txt7o1
		text = uv0:decode(uv1.string(slot4))

		for slot4 in text:gmatch("[^\r\n]+") do
			if slot4 == "{F8}" then
				setVirtualKeyDown(119, true)
				wait(50)
				setVirtualKeyDown(119, false)
			elseif slot4 == "{wait100}" then
				wait(100)
			elseif slot4 == "{wait500}" then
				wait(500)
			elseif slot4 == "{wait1000}" then
				wait(1000)
			elseif slot4 == "{sms}" then
				sampSetChatInputEnabled(true)
				sampSetChatInputText("/sms " .. cfg.config.sms .. " ")
			elseif slot4 == "{}" then
				setVirtualKeyDown(32, true)
				wait(50)
				setVirtualKeyDown(32, false)
			else
				sampSendChat(slot4:gsub("{.-}", uv3))
				wait(slot0)
			end
		end
	end)
end

bind8 = function(slot0)
	slot1 = {
		["{arg}"] = slot0,
		["{name}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub("_.+", ""),
		["{surname}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub(".+_", ""),
		["{id}"] = select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)),
		["{weapon}"] = uv0.get_name(getCurrentCharWeapon(PLAYER_PED)),
		["{city}"] = getCity(getCharCoordinates(PLAYER_PED)),
		["{zone}"] = calculateZone(getCharCoordinates(PLAYER_PED)),
		["{kvadrat}"] = kvadrat(),
		["{time1}"] = getCurrentDateTime(),
		["{time2}"] = getCurrentTime(),
		["{dd}"] = getCurrentDayOfMonth(),
		["{mm}"] = getCurrentMonth(),
		["{YY}"] = getCurrentYearFull(),
		["{yy}"] = getCurrentYear(),
		["{H}"] = getCurrentHour(),
		["{M}"] = getCurrentMinutes(),
		["{S}"] = getCurrentSecundes(),
		["{day}"] = getCurrentDayOfWeekString(),
		["{month}"] = getCurrentMonthString(),
		["{id_marker}"] = uv1,
		["{name_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub("_.+", "") or "Unknown",
		["{surname_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub(".+_", "") or "Unknown",
		["{partner_ids}"] = table.concat(getPassengersIdInCar(), ", "),
		["{partner_nicks}"] = getPassengersNickInCar(),
		["{meg_c_model}"] = getMarkerVehicleModel(),
		["{color_car}"] = getMarkerVehicleColor()
	}

	lua_thread.create(function ()
		slot0 = tonumber(cfg.config.delay8)
		slot4 = uv2.txt8o1
		text = uv0:decode(uv1.string(slot4))

		for slot4 in text:gmatch("[^\r\n]+") do
			if slot4 == "{F8}" then
				setVirtualKeyDown(119, true)
				wait(50)
				setVirtualKeyDown(119, false)
			elseif slot4 == "{wait100}" then
				wait(100)
			elseif slot4 == "{wait500}" then
				wait(500)
			elseif slot4 == "{wait1000}" then
				wait(1000)
			elseif slot4 == "{sms}" then
				sampSetChatInputEnabled(true)
				sampSetChatInputText("/sms " .. cfg.config.sms .. " ")
			elseif slot4 == "{}" then
				setVirtualKeyDown(32, true)
				wait(50)
				setVirtualKeyDown(32, false)
			else
				sampSendChat(slot4:gsub("{.-}", uv3))
				wait(slot0)
			end
		end
	end)
end

bind9 = function(slot0)
	slot1 = {
		["{arg}"] = slot0,
		["{name}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub("_.+", ""),
		["{surname}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub(".+_", ""),
		["{id}"] = select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)),
		["{weapon}"] = uv0.get_name(getCurrentCharWeapon(PLAYER_PED)),
		["{city}"] = getCity(getCharCoordinates(PLAYER_PED)),
		["{zone}"] = calculateZone(getCharCoordinates(PLAYER_PED)),
		["{kvadrat}"] = kvadrat(),
		["{time1}"] = getCurrentDateTime(),
		["{time2}"] = getCurrentTime(),
		["{dd}"] = getCurrentDayOfMonth(),
		["{mm}"] = getCurrentMonth(),
		["{YY}"] = getCurrentYearFull(),
		["{yy}"] = getCurrentYear(),
		["{H}"] = getCurrentHour(),
		["{M}"] = getCurrentMinutes(),
		["{S}"] = getCurrentSecundes(),
		["{day}"] = getCurrentDayOfWeekString(),
		["{month}"] = getCurrentMonthString(),
		["{id_marker}"] = uv1,
		["{name_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub("_.+", "") or "Unknown",
		["{surname_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub(".+_", "") or "Unknown",
		["{partner_ids}"] = table.concat(getPassengersIdInCar(), ", "),
		["{partner_nicks}"] = getPassengersNickInCar(),
		["{meg_c_model}"] = getMarkerVehicleModel(),
		["{color_car}"] = getMarkerVehicleColor()
	}

	lua_thread.create(function ()
		slot0 = tonumber(cfg.config.delay9)
		slot4 = uv2.txt9o1
		text = uv0:decode(uv1.string(slot4))

		for slot4 in text:gmatch("[^\r\n]+") do
			if slot4 == "{F8}" then
				setVirtualKeyDown(119, true)
				wait(50)
				setVirtualKeyDown(119, false)
			elseif slot4 == "{wait100}" then
				wait(100)
			elseif slot4 == "{wait500}" then
				wait(500)
			elseif slot4 == "{wait1000}" then
				wait(1000)
			elseif slot4 == "{sms}" then
				sampSetChatInputEnabled(true)
				sampSetChatInputText("/sms " .. cfg.config.sms .. " ")
			elseif slot4 == "{}" then
				setVirtualKeyDown(32, true)
				wait(50)
				setVirtualKeyDown(32, false)
			else
				sampSendChat(slot4:gsub("{.-}", uv3))
				wait(slot0)
			end
		end
	end)
end

bind10 = function(slot0)
	slot1 = {
		["{arg}"] = slot0,
		["{name}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub("_.+", ""),
		["{surname}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub(".+_", ""),
		["{id}"] = select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)),
		["{weapon}"] = uv0.get_name(getCurrentCharWeapon(PLAYER_PED)),
		["{city}"] = getCity(getCharCoordinates(PLAYER_PED)),
		["{zone}"] = calculateZone(getCharCoordinates(PLAYER_PED)),
		["{kvadrat}"] = kvadrat(),
		["{time1}"] = getCurrentDateTime(),
		["{time2}"] = getCurrentTime(),
		["{dd}"] = getCurrentDayOfMonth(),
		["{mm}"] = getCurrentMonth(),
		["{YY}"] = getCurrentYearFull(),
		["{yy}"] = getCurrentYear(),
		["{H}"] = getCurrentHour(),
		["{M}"] = getCurrentMinutes(),
		["{S}"] = getCurrentSecundes(),
		["{day}"] = getCurrentDayOfWeekString(),
		["{month}"] = getCurrentMonthString(),
		["{id_marker}"] = uv1,
		["{name_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub("_.+", "") or "Unknown",
		["{surname_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub(".+_", "") or "Unknown",
		["{partner_ids}"] = table.concat(getPassengersIdInCar(), ", "),
		["{partner_nicks}"] = getPassengersNickInCar(),
		["{meg_c_model}"] = getMarkerVehicleModel(),
		["{color_car}"] = getMarkerVehicleColor()
	}

	lua_thread.create(function ()
		slot0 = tonumber(cfg.config.delay10)
		slot4 = uv2.txt10o1
		text = uv0:decode(uv1.string(slot4))

		for slot4 in text:gmatch("[^\r\n]+") do
			if slot4 == "{F8}" then
				setVirtualKeyDown(119, true)
				wait(50)
				setVirtualKeyDown(119, false)
			elseif slot4 == "{wait100}" then
				wait(100)
			elseif slot4 == "{wait500}" then
				wait(500)
			elseif slot4 == "{wait1000}" then
				wait(1000)
			elseif slot4 == "{sms}" then
				sampSetChatInputEnabled(true)
				sampSetChatInputText("/sms " .. cfg.config.sms .. " ")
			elseif slot4 == "{}" then
				setVirtualKeyDown(32, true)
				wait(50)
				setVirtualKeyDown(32, false)
			else
				sampSendChat(slot4:gsub("{.-}", uv3))
				wait(slot0)
			end
		end
	end)
end

bind11 = function(slot0)
	slot1 = {
		["{arg}"] = slot0,
		["{name}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub("_.+", ""),
		["{surname}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub(".+_", ""),
		["{id}"] = select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)),
		["{weapon}"] = uv0.get_name(getCurrentCharWeapon(PLAYER_PED)),
		["{city}"] = getCity(getCharCoordinates(PLAYER_PED)),
		["{zone}"] = calculateZone(getCharCoordinates(PLAYER_PED)),
		["{kvadrat}"] = kvadrat(),
		["{time1}"] = getCurrentDateTime(),
		["{time2}"] = getCurrentTime(),
		["{dd}"] = getCurrentDayOfMonth(),
		["{mm}"] = getCurrentMonth(),
		["{YY}"] = getCurrentYearFull(),
		["{yy}"] = getCurrentYear(),
		["{H}"] = getCurrentHour(),
		["{M}"] = getCurrentMinutes(),
		["{S}"] = getCurrentSecundes(),
		["{day}"] = getCurrentDayOfWeekString(),
		["{month}"] = getCurrentMonthString(),
		["{id_marker}"] = uv1,
		["{name_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub("_.+", "") or "Unknown",
		["{surname_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub(".+_", "") or "Unknown",
		["{partner_ids}"] = table.concat(getPassengersIdInCar(), ", "),
		["{partner_nicks}"] = getPassengersNickInCar(),
		["{meg_c_model}"] = getMarkerVehicleModel(),
		["{color_car}"] = getMarkerVehicleColor()
	}

	lua_thread.create(function ()
		slot0 = tonumber(cfg.config.delay11)
		slot4 = uv2.txt11o1
		text = uv0:decode(uv1.string(slot4))

		for slot4 in text:gmatch("[^\r\n]+") do
			if slot4 == "{F8}" then
				setVirtualKeyDown(119, true)
				wait(50)
				setVirtualKeyDown(119, false)
			elseif slot4 == "{wait100}" then
				wait(100)
			elseif slot4 == "{wait500}" then
				wait(500)
			elseif slot4 == "{wait1000}" then
				wait(1000)
			elseif slot4 == "{sms}" then
				sampSetChatInputEnabled(true)
				sampSetChatInputText("/sms " .. cfg.config.sms .. " ")
			elseif slot4 == "{}" then
				setVirtualKeyDown(32, true)
				wait(50)
				setVirtualKeyDown(32, false)
			else
				sampSendChat(slot4:gsub("{.-}", uv3))
				wait(slot0)
			end
		end
	end)
end

bind12 = function(slot0)
	slot1 = {
		["{arg}"] = slot0,
		["{name}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub("_.+", ""),
		["{surname}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub(".+_", ""),
		["{id}"] = select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)),
		["{weapon}"] = uv0.get_name(getCurrentCharWeapon(PLAYER_PED)),
		["{city}"] = getCity(getCharCoordinates(PLAYER_PED)),
		["{zone}"] = calculateZone(getCharCoordinates(PLAYER_PED)),
		["{kvadrat}"] = kvadrat(),
		["{time1}"] = getCurrentDateTime(),
		["{time2}"] = getCurrentTime(),
		["{dd}"] = getCurrentDayOfMonth(),
		["{mm}"] = getCurrentMonth(),
		["{YY}"] = getCurrentYearFull(),
		["{yy}"] = getCurrentYear(),
		["{H}"] = getCurrentHour(),
		["{M}"] = getCurrentMinutes(),
		["{S}"] = getCurrentSecundes(),
		["{day}"] = getCurrentDayOfWeekString(),
		["{month}"] = getCurrentMonthString(),
		["{id_marker}"] = uv1,
		["{name_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub("_.+", "") or "Unknown",
		["{surname_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub(".+_", "") or "Unknown",
		["{partner_ids}"] = table.concat(getPassengersIdInCar(), ", "),
		["{partner_nicks}"] = getPassengersNickInCar(),
		["{meg_c_model}"] = getMarkerVehicleModel(),
		["{color_car}"] = getMarkerVehicleColor()
	}

	lua_thread.create(function ()
		slot0 = tonumber(cfg.config.delay12)
		slot4 = uv2.txt12o1
		text = uv0:decode(uv1.string(slot4))

		for slot4 in text:gmatch("[^\r\n]+") do
			if slot4 == "{F8}" then
				setVirtualKeyDown(119, true)
				wait(50)
				setVirtualKeyDown(119, false)
			elseif slot4 == "{wait100}" then
				wait(100)
			elseif slot4 == "{wait500}" then
				wait(500)
			elseif slot4 == "{wait1000}" then
				wait(1000)
			elseif slot4 == "{sms}" then
				sampSetChatInputEnabled(true)
				sampSetChatInputText("/sms " .. cfg.config.sms .. " ")
			elseif slot4 == "{}" then
				setVirtualKeyDown(32, true)
				wait(50)
				setVirtualKeyDown(32, false)
			else
				sampSendChat(slot4:gsub("{.-}", uv3))
				wait(slot0)
			end
		end
	end)
end

bind13 = function(slot0)
	slot1 = {
		["{arg}"] = slot0,
		["{name}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub("_.+", ""),
		["{surname}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub(".+_", ""),
		["{id}"] = select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)),
		["{weapon}"] = uv0.get_name(getCurrentCharWeapon(PLAYER_PED)),
		["{city}"] = getCity(getCharCoordinates(PLAYER_PED)),
		["{zone}"] = calculateZone(getCharCoordinates(PLAYER_PED)),
		["{kvadrat}"] = kvadrat(),
		["{time1}"] = getCurrentDateTime(),
		["{time2}"] = getCurrentTime(),
		["{dd}"] = getCurrentDayOfMonth(),
		["{mm}"] = getCurrentMonth(),
		["{YY}"] = getCurrentYearFull(),
		["{yy}"] = getCurrentYear(),
		["{H}"] = getCurrentHour(),
		["{M}"] = getCurrentMinutes(),
		["{S}"] = getCurrentSecundes(),
		["{day}"] = getCurrentDayOfWeekString(),
		["{month}"] = getCurrentMonthString(),
		["{id_marker}"] = uv1,
		["{name_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub("_.+", "") or "Unknown",
		["{surname_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub(".+_", "") or "Unknown",
		["{partner_ids}"] = table.concat(getPassengersIdInCar(), ", "),
		["{partner_nicks}"] = getPassengersNickInCar(),
		["{meg_c_model}"] = getMarkerVehicleModel(),
		["{color_car}"] = getMarkerVehicleColor()
	}

	lua_thread.create(function ()
		slot0 = tonumber(cfg.config.delay13)
		slot4 = uv2.txt13o1
		text = uv0:decode(uv1.string(slot4))

		for slot4 in text:gmatch("[^\r\n]+") do
			if slot4 == "{F8}" then
				setVirtualKeyDown(119, true)
				wait(50)
				setVirtualKeyDown(119, false)
			elseif slot4 == "{wait100}" then
				wait(100)
			elseif slot4 == "{wait500}" then
				wait(500)
			elseif slot4 == "{wait1000}" then
				wait(1000)
			elseif slot4 == "{sms}" then
				sampSetChatInputEnabled(true)
				sampSetChatInputText("/sms " .. cfg.config.sms .. " ")
			elseif slot4 == "{}" then
				setVirtualKeyDown(32, true)
				wait(50)
				setVirtualKeyDown(32, false)
			else
				sampSendChat(slot4:gsub("{.-}", uv3))
				wait(slot0)
			end
		end
	end)
end

bind14 = function(slot0)
	slot1 = {
		["{arg}"] = slot0,
		["{name}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub("_.+", ""),
		["{surname}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub(".+_", ""),
		["{id}"] = select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)),
		["{weapon}"] = uv0.get_name(getCurrentCharWeapon(PLAYER_PED)),
		["{city}"] = getCity(getCharCoordinates(PLAYER_PED)),
		["{zone}"] = calculateZone(getCharCoordinates(PLAYER_PED)),
		["{kvadrat}"] = kvadrat(),
		["{time1}"] = getCurrentDateTime(),
		["{time2}"] = getCurrentTime(),
		["{dd}"] = getCurrentDayOfMonth(),
		["{mm}"] = getCurrentMonth(),
		["{YY}"] = getCurrentYearFull(),
		["{yy}"] = getCurrentYear(),
		["{H}"] = getCurrentHour(),
		["{M}"] = getCurrentMinutes(),
		["{S}"] = getCurrentSecundes(),
		["{day}"] = getCurrentDayOfWeekString(),
		["{month}"] = getCurrentMonthString(),
		["{id_marker}"] = uv1,
		["{name_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub("_.+", "") or "Unknown",
		["{surname_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub(".+_", "") or "Unknown",
		["{partner_ids}"] = table.concat(getPassengersIdInCar(), ", "),
		["{partner_nicks}"] = getPassengersNickInCar(),
		["{meg_c_model}"] = getMarkerVehicleModel(),
		["{color_car}"] = getMarkerVehicleColor()
	}

	lua_thread.create(function ()
		slot0 = tonumber(cfg.config.delay14)
		slot4 = uv2.txt14o1
		text = uv0:decode(uv1.string(slot4))

		for slot4 in text:gmatch("[^\r\n]+") do
			if slot4 == "{F8}" then
				setVirtualKeyDown(119, true)
				wait(50)
				setVirtualKeyDown(119, false)
			elseif slot4 == "{wait100}" then
				wait(100)
			elseif slot4 == "{wait500}" then
				wait(500)
			elseif slot4 == "{wait1000}" then
				wait(1000)
			elseif slot4 == "{sms}" then
				sampSetChatInputEnabled(true)
				sampSetChatInputText("/sms " .. cfg.config.sms .. " ")
			elseif slot4 == "{}" then
				setVirtualKeyDown(32, true)
				wait(50)
				setVirtualKeyDown(32, false)
			else
				sampSendChat(slot4:gsub("{.-}", uv3))
				wait(slot0)
			end
		end
	end)
end

bind15 = function(slot0)
	slot1 = {
		["{arg}"] = slot0,
		["{name}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub("_.+", ""),
		["{surname}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub(".+_", ""),
		["{id}"] = select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)),
		["{weapon}"] = uv0.get_name(getCurrentCharWeapon(PLAYER_PED)),
		["{city}"] = getCity(getCharCoordinates(PLAYER_PED)),
		["{zone}"] = calculateZone(getCharCoordinates(PLAYER_PED)),
		["{kvadrat}"] = kvadrat(),
		["{time1}"] = getCurrentDateTime(),
		["{time2}"] = getCurrentTime(),
		["{dd}"] = getCurrentDayOfMonth(),
		["{mm}"] = getCurrentMonth(),
		["{YY}"] = getCurrentYearFull(),
		["{yy}"] = getCurrentYear(),
		["{H}"] = getCurrentHour(),
		["{M}"] = getCurrentMinutes(),
		["{S}"] = getCurrentSecundes(),
		["{day}"] = getCurrentDayOfWeekString(),
		["{month}"] = getCurrentMonthString(),
		["{id_marker}"] = uv1,
		["{name_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub("_.+", "") or "Unknown",
		["{surname_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub(".+_", "") or "Unknown",
		["{partner_ids}"] = table.concat(getPassengersIdInCar(), ", "),
		["{partner_nicks}"] = getPassengersNickInCar(),
		["{meg_c_model}"] = getMarkerVehicleModel(),
		["{color_car}"] = getMarkerVehicleColor()
	}

	lua_thread.create(function ()
		slot0 = tonumber(cfg.config.delay15)
		slot4 = uv2.txt15o1
		text = uv0:decode(uv1.string(slot4))

		for slot4 in text:gmatch("[^\r\n]+") do
			if slot4 == "{F8}" then
				setVirtualKeyDown(119, true)
				wait(50)
				setVirtualKeyDown(119, false)
			elseif slot4 == "{wait100}" then
				wait(100)
			elseif slot4 == "{wait500}" then
				wait(500)
			elseif slot4 == "{wait1000}" then
				wait(1000)
			elseif slot4 == "{sms}" then
				sampSetChatInputEnabled(true)
				sampSetChatInputText("/sms " .. cfg.config.sms .. " ")
			elseif slot4 == "{}" then
				setVirtualKeyDown(32, true)
				wait(50)
				setVirtualKeyDown(32, false)
			else
				sampSendChat(slot4:gsub("{.-}", uv3))
				wait(slot0)
			end
		end
	end)
end

bind16 = function(slot0)
	slot1 = {
		["{arg}"] = slot0,
		["{name}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub("_.+", ""),
		["{surname}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub(".+_", ""),
		["{id}"] = select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)),
		["{weapon}"] = uv0.get_name(getCurrentCharWeapon(PLAYER_PED)),
		["{city}"] = getCity(getCharCoordinates(PLAYER_PED)),
		["{zone}"] = calculateZone(getCharCoordinates(PLAYER_PED)),
		["{kvadrat}"] = kvadrat(),
		["{time1}"] = getCurrentDateTime(),
		["{time2}"] = getCurrentTime(),
		["{dd}"] = getCurrentDayOfMonth(),
		["{mm}"] = getCurrentMonth(),
		["{YY}"] = getCurrentYearFull(),
		["{yy}"] = getCurrentYear(),
		["{H}"] = getCurrentHour(),
		["{M}"] = getCurrentMinutes(),
		["{S}"] = getCurrentSecundes(),
		["{day}"] = getCurrentDayOfWeekString(),
		["{month}"] = getCurrentMonthString(),
		["{id_marker}"] = uv1,
		["{name_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub("_.+", "") or "Unknown",
		["{surname_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub(".+_", "") or "Unknown",
		["{partner_ids}"] = table.concat(getPassengersIdInCar(), ", "),
		["{partner_nicks}"] = getPassengersNickInCar(),
		["{meg_c_model}"] = getMarkerVehicleModel(),
		["{color_car}"] = getMarkerVehicleColor()
	}

	lua_thread.create(function ()
		slot0 = tonumber(cfg.config.delay16)
		slot4 = uv2.txt16o1
		text = uv0:decode(uv1.string(slot4))

		for slot4 in text:gmatch("[^\r\n]+") do
			if slot4 == "{F8}" then
				setVirtualKeyDown(119, true)
				wait(50)
				setVirtualKeyDown(119, false)
			elseif slot4 == "{wait100}" then
				wait(100)
			elseif slot4 == "{wait500}" then
				wait(500)
			elseif slot4 == "{wait1000}" then
				wait(1000)
			elseif slot4 == "{sms}" then
				sampSetChatInputEnabled(true)
				sampSetChatInputText("/sms " .. cfg.config.sms .. " ")
			elseif slot4 == "{}" then
				setVirtualKeyDown(32, true)
				wait(50)
				setVirtualKeyDown(32, false)
			else
				sampSendChat(slot4:gsub("{.-}", uv3))
				wait(slot0)
			end
		end
	end)
end

bind17 = function(slot0)
	slot1 = {
		["{arg}"] = slot0,
		["{name}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub("_.+", ""),
		["{surname}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub(".+_", ""),
		["{id}"] = select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)),
		["{weapon}"] = uv0.get_name(getCurrentCharWeapon(PLAYER_PED)),
		["{city}"] = getCity(getCharCoordinates(PLAYER_PED)),
		["{zone}"] = calculateZone(getCharCoordinates(PLAYER_PED)),
		["{kvadrat}"] = kvadrat(),
		["{time1}"] = getCurrentDateTime(),
		["{time2}"] = getCurrentTime(),
		["{dd}"] = getCurrentDayOfMonth(),
		["{mm}"] = getCurrentMonth(),
		["{YY}"] = getCurrentYearFull(),
		["{yy}"] = getCurrentYear(),
		["{H}"] = getCurrentHour(),
		["{M}"] = getCurrentMinutes(),
		["{S}"] = getCurrentSecundes(),
		["{day}"] = getCurrentDayOfWeekString(),
		["{month}"] = getCurrentMonthString(),
		["{id_marker}"] = uv1,
		["{name_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub("_.+", "") or "Unknown",
		["{surname_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub(".+_", "") or "Unknown",
		["{partner_ids}"] = table.concat(getPassengersIdInCar(), ", "),
		["{partner_nicks}"] = getPassengersNickInCar(),
		["{meg_c_model}"] = getMarkerVehicleModel(),
		["{color_car}"] = getMarkerVehicleColor()
	}

	lua_thread.create(function ()
		slot0 = tonumber(cfg.config.delay17)
		slot4 = uv2.txt17o1
		text = uv0:decode(uv1.string(slot4))

		for slot4 in text:gmatch("[^\r\n]+") do
			if slot4 == "{F8}" then
				setVirtualKeyDown(119, true)
				wait(50)
				setVirtualKeyDown(119, false)
			elseif slot4 == "{wait100}" then
				wait(100)
			elseif slot4 == "{wait500}" then
				wait(500)
			elseif slot4 == "{wait1000}" then
				wait(1000)
			elseif slot4 == "{sms}" then
				sampSetChatInputEnabled(true)
				sampSetChatInputText("/sms " .. cfg.config.sms .. " ")
			elseif slot4 == "{}" then
				setVirtualKeyDown(32, true)
				wait(50)
				setVirtualKeyDown(32, false)
			else
				sampSendChat(slot4:gsub("{.-}", uv3))
				wait(slot0)
			end
		end
	end)
end

bind18 = function(slot0)
	slot1 = {
		["{arg}"] = slot0,
		["{name}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub("_.+", ""),
		["{surname}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub(".+_", ""),
		["{id}"] = select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)),
		["{weapon}"] = uv0.get_name(getCurrentCharWeapon(PLAYER_PED)),
		["{city}"] = getCity(getCharCoordinates(PLAYER_PED)),
		["{zone}"] = calculateZone(getCharCoordinates(PLAYER_PED)),
		["{kvadrat}"] = kvadrat(),
		["{time1}"] = getCurrentDateTime(),
		["{time2}"] = getCurrentTime(),
		["{dd}"] = getCurrentDayOfMonth(),
		["{mm}"] = getCurrentMonth(),
		["{YY}"] = getCurrentYearFull(),
		["{yy}"] = getCurrentYear(),
		["{H}"] = getCurrentHour(),
		["{M}"] = getCurrentMinutes(),
		["{S}"] = getCurrentSecundes(),
		["{day}"] = getCurrentDayOfWeekString(),
		["{month}"] = getCurrentMonthString(),
		["{id_marker}"] = uv1,
		["{name_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub("_.+", "") or "Unknown",
		["{surname_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub(".+_", "") or "Unknown",
		["{partner_ids}"] = table.concat(getPassengersIdInCar(), ", "),
		["{partner_nicks}"] = getPassengersNickInCar(),
		["{meg_c_model}"] = getMarkerVehicleModel(),
		["{color_car}"] = getMarkerVehicleColor()
	}

	lua_thread.create(function ()
		slot0 = tonumber(cfg.config.delay18)
		slot4 = uv2.txt18o1
		text = uv0:decode(uv1.string(slot4))

		for slot4 in text:gmatch("[^\r\n]+") do
			if slot4 == "{F8}" then
				setVirtualKeyDown(119, true)
				wait(50)
				setVirtualKeyDown(119, false)
			elseif slot4 == "{wait100}" then
				wait(100)
			elseif slot4 == "{wait500}" then
				wait(500)
			elseif slot4 == "{wait1000}" then
				wait(1000)
			elseif slot4 == "{sms}" then
				sampSetChatInputEnabled(true)
				sampSetChatInputText("/sms " .. cfg.config.sms .. " ")
			elseif slot4 == "{}" then
				setVirtualKeyDown(32, true)
				wait(50)
				setVirtualKeyDown(32, false)
			else
				sampSendChat(slot4:gsub("{.-}", uv3))
				wait(slot0)
			end
		end
	end)
end

bind19 = function(slot0)
	slot1 = {
		["{arg}"] = slot0,
		["{name}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub("_.+", ""),
		["{surname}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub(".+_", ""),
		["{id}"] = select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)),
		["{weapon}"] = uv0.get_name(getCurrentCharWeapon(PLAYER_PED)),
		["{city}"] = getCity(getCharCoordinates(PLAYER_PED)),
		["{zone}"] = calculateZone(getCharCoordinates(PLAYER_PED)),
		["{kvadrat}"] = kvadrat(),
		["{time1}"] = getCurrentDateTime(),
		["{time2}"] = getCurrentTime(),
		["{dd}"] = getCurrentDayOfMonth(),
		["{mm}"] = getCurrentMonth(),
		["{YY}"] = getCurrentYearFull(),
		["{yy}"] = getCurrentYear(),
		["{H}"] = getCurrentHour(),
		["{M}"] = getCurrentMinutes(),
		["{S}"] = getCurrentSecundes(),
		["{day}"] = getCurrentDayOfWeekString(),
		["{month}"] = getCurrentMonthString(),
		["{id_marker}"] = uv1,
		["{name_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub("_.+", "") or "Unknown",
		["{surname_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub(".+_", "") or "Unknown",
		["{partner_ids}"] = table.concat(getPassengersIdInCar(), ", "),
		["{partner_nicks}"] = getPassengersNickInCar(),
		["{meg_c_model}"] = getMarkerVehicleModel(),
		["{color_car}"] = getMarkerVehicleColor()
	}

	lua_thread.create(function ()
		slot0 = tonumber(cfg.config.delay19)
		slot4 = uv2.txt19o1
		text = uv0:decode(uv1.string(slot4))

		for slot4 in text:gmatch("[^\r\n]+") do
			if slot4 == "{F8}" then
				setVirtualKeyDown(119, true)
				wait(50)
				setVirtualKeyDown(119, false)
			elseif slot4 == "{wait100}" then
				wait(100)
			elseif slot4 == "{wait500}" then
				wait(500)
			elseif slot4 == "{wait1000}" then
				wait(1000)
			elseif slot4 == "{sms}" then
				sampSetChatInputEnabled(true)
				sampSetChatInputText("/sms " .. cfg.config.sms .. " ")
			elseif slot4 == "{}" then
				setVirtualKeyDown(32, true)
				wait(50)
				setVirtualKeyDown(32, false)
			else
				sampSendChat(slot4:gsub("{.-}", uv3))
				wait(slot0)
			end
		end
	end)
end

bind20 = function(slot0)
	slot1 = {
		["{arg}"] = slot0,
		["{name}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub("_.+", ""),
		["{surname}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub(".+_", ""),
		["{id}"] = select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)),
		["{weapon}"] = uv0.get_name(getCurrentCharWeapon(PLAYER_PED)),
		["{city}"] = getCity(getCharCoordinates(PLAYER_PED)),
		["{zone}"] = calculateZone(getCharCoordinates(PLAYER_PED)),
		["{kvadrat}"] = kvadrat(),
		["{time1}"] = getCurrentDateTime(),
		["{time2}"] = getCurrentTime(),
		["{dd}"] = getCurrentDayOfMonth(),
		["{mm}"] = getCurrentMonth(),
		["{YY}"] = getCurrentYearFull(),
		["{yy}"] = getCurrentYear(),
		["{H}"] = getCurrentHour(),
		["{M}"] = getCurrentMinutes(),
		["{S}"] = getCurrentSecundes(),
		["{day}"] = getCurrentDayOfWeekString(),
		["{month}"] = getCurrentMonthString(),
		["{id_marker}"] = uv1,
		["{name_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub("_.+", "") or "Unknown",
		["{surname_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub(".+_", "") or "Unknown",
		["{partner_ids}"] = table.concat(getPassengersIdInCar(), ", "),
		["{partner_nicks}"] = getPassengersNickInCar(),
		["{meg_c_model}"] = getMarkerVehicleModel(),
		["{color_car}"] = getMarkerVehicleColor()
	}

	lua_thread.create(function ()
		slot0 = tonumber(cfg.config.delay20)
		slot4 = uv2.txt20o1
		text = uv0:decode(uv1.string(slot4))

		for slot4 in text:gmatch("[^\r\n]+") do
			if slot4 == "{F8}" then
				setVirtualKeyDown(119, true)
				wait(50)
				setVirtualKeyDown(119, false)
			elseif slot4 == "{wait100}" then
				wait(100)
			elseif slot4 == "{wait500}" then
				wait(500)
			elseif slot4 == "{wait1000}" then
				wait(1000)
			elseif slot4 == "{sms}" then
				sampSetChatInputEnabled(true)
				sampSetChatInputText("/sms " .. cfg.config.sms .. " ")
			elseif slot4 == "{}" then
				setVirtualKeyDown(32, true)
				wait(50)
				setVirtualKeyDown(32, false)
			else
				sampSendChat(slot4:gsub("{.-}", uv3))
				wait(slot0)
			end
		end
	end)
end

bind21 = function(slot0)
	slot1 = {
		["{arg}"] = slot0,
		["{name}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub("_.+", ""),
		["{surname}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub(".+_", ""),
		["{id}"] = select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)),
		["{weapon}"] = uv0.get_name(getCurrentCharWeapon(PLAYER_PED)),
		["{city}"] = getCity(getCharCoordinates(PLAYER_PED)),
		["{zone}"] = calculateZone(getCharCoordinates(PLAYER_PED)),
		["{kvadrat}"] = kvadrat(),
		["{time1}"] = getCurrentDateTime(),
		["{time2}"] = getCurrentTime(),
		["{dd}"] = getCurrentDayOfMonth(),
		["{mm}"] = getCurrentMonth(),
		["{YY}"] = getCurrentYearFull(),
		["{yy}"] = getCurrentYear(),
		["{H}"] = getCurrentHour(),
		["{M}"] = getCurrentMinutes(),
		["{S}"] = getCurrentSecundes(),
		["{day}"] = getCurrentDayOfWeekString(),
		["{month}"] = getCurrentMonthString(),
		["{id_marker}"] = uv1,
		["{name_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub("_.+", "") or "Unknown",
		["{surname_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub(".+_", "") or "Unknown",
		["{partner_ids}"] = table.concat(getPassengersIdInCar(), ", "),
		["{partner_nicks}"] = getPassengersNickInCar(),
		["{meg_c_model}"] = getMarkerVehicleModel(),
		["{color_car}"] = getMarkerVehicleColor()
	}

	lua_thread.create(function ()
		slot0 = tonumber(cfg.config.delay21)
		slot4 = uv2.txt21o1
		text = uv0:decode(uv1.string(slot4))

		for slot4 in text:gmatch("[^\r\n]+") do
			if slot4 == "{F8}" then
				setVirtualKeyDown(119, true)
				wait(50)
				setVirtualKeyDown(119, false)
			elseif slot4 == "{wait100}" then
				wait(100)
			elseif slot4 == "{wait500}" then
				wait(500)
			elseif slot4 == "{wait1000}" then
				wait(1000)
			elseif slot4 == "{sms}" then
				sampSetChatInputEnabled(true)
				sampSetChatInputText("/sms " .. cfg.config.sms .. " ")
			elseif slot4 == "{}" then
				setVirtualKeyDown(32, true)
				wait(50)
				setVirtualKeyDown(32, false)
			else
				sampSendChat(slot4:gsub("{.-}", uv3))
				wait(slot0)
			end
		end
	end)
end

bind22 = function(slot0)
	slot1 = {
		["{arg}"] = slot0,
		["{name}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub("_.+", ""),
		["{surname}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub(".+_", ""),
		["{id}"] = select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)),
		["{weapon}"] = uv0.get_name(getCurrentCharWeapon(PLAYER_PED)),
		["{city}"] = getCity(getCharCoordinates(PLAYER_PED)),
		["{zone}"] = calculateZone(getCharCoordinates(PLAYER_PED)),
		["{kvadrat}"] = kvadrat(),
		["{time1}"] = getCurrentDateTime(),
		["{time2}"] = getCurrentTime(),
		["{dd}"] = getCurrentDayOfMonth(),
		["{mm}"] = getCurrentMonth(),
		["{YY}"] = getCurrentYearFull(),
		["{yy}"] = getCurrentYear(),
		["{H}"] = getCurrentHour(),
		["{M}"] = getCurrentMinutes(),
		["{S}"] = getCurrentSecundes(),
		["{day}"] = getCurrentDayOfWeekString(),
		["{month}"] = getCurrentMonthString(),
		["{id_marker}"] = uv1,
		["{name_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub("_.+", "") or "Unknown",
		["{surname_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub(".+_", "") or "Unknown",
		["{partner_ids}"] = table.concat(getPassengersIdInCar(), ", "),
		["{partner_nicks}"] = getPassengersNickInCar(),
		["{meg_c_model}"] = getMarkerVehicleModel(),
		["{color_car}"] = getMarkerVehicleColor()
	}

	lua_thread.create(function ()
		slot0 = tonumber(cfg.config.delay22)
		slot4 = uv2.txt22o1
		text = uv0:decode(uv1.string(slot4))

		for slot4 in text:gmatch("[^\r\n]+") do
			if slot4 == "{F8}" then
				setVirtualKeyDown(119, true)
				wait(50)
				setVirtualKeyDown(119, false)
			elseif slot4 == "{wait100}" then
				wait(100)
			elseif slot4 == "{wait500}" then
				wait(500)
			elseif slot4 == "{wait1000}" then
				wait(1000)
			elseif slot4 == "{sms}" then
				sampSetChatInputEnabled(true)
				sampSetChatInputText("/sms " .. cfg.config.sms .. " ")
			elseif slot4 == "{}" then
				setVirtualKeyDown(32, true)
				wait(50)
				setVirtualKeyDown(32, false)
			else
				sampSendChat(slot4:gsub("{.-}", uv3))
				wait(slot0)
			end
		end
	end)
end

bind23 = function(slot0)
	slot1 = {
		["{arg}"] = slot0,
		["{name}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub("_.+", ""),
		["{surname}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub(".+_", ""),
		["{id}"] = select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)),
		["{weapon}"] = uv0.get_name(getCurrentCharWeapon(PLAYER_PED)),
		["{city}"] = getCity(getCharCoordinates(PLAYER_PED)),
		["{zone}"] = calculateZone(getCharCoordinates(PLAYER_PED)),
		["{kvadrat}"] = kvadrat(),
		["{time1}"] = getCurrentDateTime(),
		["{time2}"] = getCurrentTime(),
		["{dd}"] = getCurrentDayOfMonth(),
		["{mm}"] = getCurrentMonth(),
		["{YY}"] = getCurrentYearFull(),
		["{yy}"] = getCurrentYear(),
		["{H}"] = getCurrentHour(),
		["{M}"] = getCurrentMinutes(),
		["{S}"] = getCurrentSecundes(),
		["{day}"] = getCurrentDayOfWeekString(),
		["{month}"] = getCurrentMonthString(),
		["{id_marker}"] = uv1,
		["{name_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub("_.+", "") or "Unknown",
		["{surname_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub(".+_", "") or "Unknown",
		["{partner_ids}"] = table.concat(getPassengersIdInCar(), ", "),
		["{partner_nicks}"] = getPassengersNickInCar(),
		["{meg_c_model}"] = getMarkerVehicleModel(),
		["{color_car}"] = getMarkerVehicleColor()
	}

	lua_thread.create(function ()
		slot0 = tonumber(cfg.config.delay23)
		slot4 = uv2.txt23o1
		text = uv0:decode(uv1.string(slot4))

		for slot4 in text:gmatch("[^\r\n]+") do
			if slot4 == "{F8}" then
				setVirtualKeyDown(119, true)
				wait(50)
				setVirtualKeyDown(119, false)
			elseif slot4 == "{wait100}" then
				wait(100)
			elseif slot4 == "{wait500}" then
				wait(500)
			elseif slot4 == "{wait1000}" then
				wait(1000)
			elseif slot4 == "{sms}" then
				sampSetChatInputEnabled(true)
				sampSetChatInputText("/sms " .. cfg.config.sms .. " ")
			elseif slot4 == "{}" then
				setVirtualKeyDown(32, true)
				wait(50)
				setVirtualKeyDown(32, false)
			else
				sampSendChat(slot4:gsub("{.-}", uv3))
				wait(slot0)
			end
		end
	end)
end

bind24 = function(slot0)
	slot1 = {
		["{arg}"] = slot0,
		["{name}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub("_.+", ""),
		["{surname}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub(".+_", ""),
		["{id}"] = select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)),
		["{weapon}"] = uv0.get_name(getCurrentCharWeapon(PLAYER_PED)),
		["{city}"] = getCity(getCharCoordinates(PLAYER_PED)),
		["{zone}"] = calculateZone(getCharCoordinates(PLAYER_PED)),
		["{kvadrat}"] = kvadrat(),
		["{time1}"] = getCurrentDateTime(),
		["{time2}"] = getCurrentTime(),
		["{dd}"] = getCurrentDayOfMonth(),
		["{mm}"] = getCurrentMonth(),
		["{YY}"] = getCurrentYearFull(),
		["{yy}"] = getCurrentYear(),
		["{H}"] = getCurrentHour(),
		["{M}"] = getCurrentMinutes(),
		["{S}"] = getCurrentSecundes(),
		["{day}"] = getCurrentDayOfWeekString(),
		["{month}"] = getCurrentMonthString(),
		["{id_marker}"] = uv1,
		["{name_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub("_.+", "") or "Unknown",
		["{surname_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub(".+_", "") or "Unknown",
		["{partner_ids}"] = table.concat(getPassengersIdInCar(), ", "),
		["{partner_nicks}"] = getPassengersNickInCar(),
		["{meg_c_model}"] = getMarkerVehicleModel(),
		["{color_car}"] = getMarkerVehicleColor()
	}

	lua_thread.create(function ()
		slot0 = tonumber(cfg.config.delay24)
		slot4 = uv2.txt24o1
		text = uv0:decode(uv1.string(slot4))

		for slot4 in text:gmatch("[^\r\n]+") do
			if slot4 == "{F8}" then
				setVirtualKeyDown(119, true)
				wait(50)
				setVirtualKeyDown(119, false)
			elseif slot4 == "{wait100}" then
				wait(100)
			elseif slot4 == "{wait500}" then
				wait(500)
			elseif slot4 == "{wait1000}" then
				wait(1000)
			elseif slot4 == "{sms}" then
				sampSetChatInputEnabled(true)
				sampSetChatInputText("/sms " .. cfg.config.sms .. " ")
			elseif slot4 == "{}" then
				setVirtualKeyDown(32, true)
				wait(50)
				setVirtualKeyDown(32, false)
			else
				sampSendChat(slot4:gsub("{.-}", uv3))
				wait(slot0)
			end
		end
	end)
end

bind25 = function(slot0)
	slot1 = {
		["{arg}"] = slot0,
		["{name}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub("_.+", ""),
		["{surname}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub(".+_", ""),
		["{id}"] = select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)),
		["{weapon}"] = uv0.get_name(getCurrentCharWeapon(PLAYER_PED)),
		["{city}"] = getCity(getCharCoordinates(PLAYER_PED)),
		["{zone}"] = calculateZone(getCharCoordinates(PLAYER_PED)),
		["{kvadrat}"] = kvadrat(),
		["{time1}"] = getCurrentDateTime(),
		["{time2}"] = getCurrentTime(),
		["{dd}"] = getCurrentDayOfMonth(),
		["{mm}"] = getCurrentMonth(),
		["{YY}"] = getCurrentYearFull(),
		["{yy}"] = getCurrentYear(),
		["{H}"] = getCurrentHour(),
		["{M}"] = getCurrentMinutes(),
		["{S}"] = getCurrentSecundes(),
		["{day}"] = getCurrentDayOfWeekString(),
		["{month}"] = getCurrentMonthString(),
		["{id_marker}"] = uv1,
		["{name_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub("_.+", "") or "Unknown",
		["{surname_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub(".+_", "") or "Unknown",
		["{partner_ids}"] = table.concat(getPassengersIdInCar(), ", "),
		["{partner_nicks}"] = getPassengersNickInCar(),
		["{meg_c_model}"] = getMarkerVehicleModel(),
		["{color_car}"] = getMarkerVehicleColor()
	}

	lua_thread.create(function ()
		slot0 = tonumber(cfg.config.delay25)
		slot4 = uv2.txt25o1
		text = uv0:decode(uv1.string(slot4))

		for slot4 in text:gmatch("[^\r\n]+") do
			if slot4 == "{F8}" then
				setVirtualKeyDown(119, true)
				wait(50)
				setVirtualKeyDown(119, false)
			elseif slot4 == "{wait100}" then
				wait(100)
			elseif slot4 == "{wait500}" then
				wait(500)
			elseif slot4 == "{wait1000}" then
				wait(1000)
			elseif slot4 == "{sms}" then
				sampSetChatInputEnabled(true)
				sampSetChatInputText("/sms " .. cfg.config.sms .. " ")
			elseif slot4 == "{}" then
				setVirtualKeyDown(32, true)
				wait(50)
				setVirtualKeyDown(32, false)
			else
				sampSendChat(slot4:gsub("{.-}", uv3))
				wait(slot0)
			end
		end
	end)
end

bind26 = function(slot0)
	slot1 = {
		["{arg}"] = slot0,
		["{name}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub("_.+", ""),
		["{surname}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub(".+_", ""),
		["{id}"] = select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)),
		["{weapon}"] = uv0.get_name(getCurrentCharWeapon(PLAYER_PED)),
		["{city}"] = getCity(getCharCoordinates(PLAYER_PED)),
		["{zone}"] = calculateZone(getCharCoordinates(PLAYER_PED)),
		["{kvadrat}"] = kvadrat(),
		["{time1}"] = getCurrentDateTime(),
		["{time2}"] = getCurrentTime(),
		["{dd}"] = getCurrentDayOfMonth(),
		["{mm}"] = getCurrentMonth(),
		["{YY}"] = getCurrentYearFull(),
		["{yy}"] = getCurrentYear(),
		["{H}"] = getCurrentHour(),
		["{M}"] = getCurrentMinutes(),
		["{S}"] = getCurrentSecundes(),
		["{day}"] = getCurrentDayOfWeekString(),
		["{month}"] = getCurrentMonthString(),
		["{id_marker}"] = uv1,
		["{name_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub("_.+", "") or "Unknown",
		["{surname_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub(".+_", "") or "Unknown",
		["{partner_ids}"] = table.concat(getPassengersIdInCar(), ", "),
		["{partner_nicks}"] = getPassengersNickInCar(),
		["{meg_c_model}"] = getMarkerVehicleModel(),
		["{color_car}"] = getMarkerVehicleColor()
	}

	lua_thread.create(function ()
		slot0 = tonumber(cfg.config.delay26)
		slot4 = uv2.txt26o1
		text = uv0:decode(uv1.string(slot4))

		for slot4 in text:gmatch("[^\r\n]+") do
			if slot4 == "{F8}" then
				setVirtualKeyDown(119, true)
				wait(50)
				setVirtualKeyDown(119, false)
			elseif slot4 == "{wait100}" then
				wait(100)
			elseif slot4 == "{wait500}" then
				wait(500)
			elseif slot4 == "{wait1000}" then
				wait(1000)
			elseif slot4 == "{sms}" then
				sampSetChatInputEnabled(true)
				sampSetChatInputText("/sms " .. cfg.config.sms .. " ")
			elseif slot4 == "{}" then
				setVirtualKeyDown(32, true)
				wait(50)
				setVirtualKeyDown(32, false)
			else
				sampSendChat(slot4:gsub("{.-}", uv3))
				wait(slot0)
			end
		end
	end)
end

bind27 = function(slot0)
	slot1 = {
		["{arg}"] = slot0,
		["{name}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub("_.+", ""),
		["{surname}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub(".+_", ""),
		["{id}"] = select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)),
		["{weapon}"] = uv0.get_name(getCurrentCharWeapon(PLAYER_PED)),
		["{city}"] = getCity(getCharCoordinates(PLAYER_PED)),
		["{zone}"] = calculateZone(getCharCoordinates(PLAYER_PED)),
		["{kvadrat}"] = kvadrat(),
		["{time1}"] = getCurrentDateTime(),
		["{time2}"] = getCurrentTime(),
		["{dd}"] = getCurrentDayOfMonth(),
		["{mm}"] = getCurrentMonth(),
		["{YY}"] = getCurrentYearFull(),
		["{yy}"] = getCurrentYear(),
		["{H}"] = getCurrentHour(),
		["{M}"] = getCurrentMinutes(),
		["{S}"] = getCurrentSecundes(),
		["{day}"] = getCurrentDayOfWeekString(),
		["{month}"] = getCurrentMonthString(),
		["{id_marker}"] = uv1,
		["{name_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub("_.+", "") or "Unknown",
		["{surname_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub(".+_", "") or "Unknown",
		["{partner_ids}"] = table.concat(getPassengersIdInCar(), ", "),
		["{partner_nicks}"] = getPassengersNickInCar(),
		["{meg_c_model}"] = getMarkerVehicleModel(),
		["{color_car}"] = getMarkerVehicleColor()
	}

	lua_thread.create(function ()
		slot0 = tonumber(cfg.config.delay27)
		slot4 = uv2.txt27o1
		text = uv0:decode(uv1.string(slot4))

		for slot4 in text:gmatch("[^\r\n]+") do
			if slot4 == "{F8}" then
				setVirtualKeyDown(119, true)
				wait(50)
				setVirtualKeyDown(119, false)
			elseif slot4 == "{wait100}" then
				wait(100)
			elseif slot4 == "{wait500}" then
				wait(500)
			elseif slot4 == "{wait1000}" then
				wait(1000)
			elseif slot4 == "{sms}" then
				sampSetChatInputEnabled(true)
				sampSetChatInputText("/sms " .. cfg.config.sms .. " ")
			elseif slot4 == "{}" then
				setVirtualKeyDown(32, true)
				wait(50)
				setVirtualKeyDown(32, false)
			else
				sampSendChat(slot4:gsub("{.-}", uv3))
				wait(slot0)
			end
		end
	end)
end

bind28 = function(slot0)
	slot1 = {
		["{arg}"] = slot0,
		["{name}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub("_.+", ""),
		["{surname}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub(".+_", ""),
		["{id}"] = select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)),
		["{weapon}"] = uv0.get_name(getCurrentCharWeapon(PLAYER_PED)),
		["{city}"] = getCity(getCharCoordinates(PLAYER_PED)),
		["{zone}"] = calculateZone(getCharCoordinates(PLAYER_PED)),
		["{kvadrat}"] = kvadrat(),
		["{time1}"] = getCurrentDateTime(),
		["{time2}"] = getCurrentTime(),
		["{dd}"] = getCurrentDayOfMonth(),
		["{mm}"] = getCurrentMonth(),
		["{YY}"] = getCurrentYearFull(),
		["{yy}"] = getCurrentYear(),
		["{H}"] = getCurrentHour(),
		["{M}"] = getCurrentMinutes(),
		["{S}"] = getCurrentSecundes(),
		["{day}"] = getCurrentDayOfWeekString(),
		["{month}"] = getCurrentMonthString(),
		["{id_marker}"] = uv1,
		["{name_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub("_.+", "") or "Unknown",
		["{surname_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub(".+_", "") or "Unknown",
		["{partner_ids}"] = table.concat(getPassengersIdInCar(), ", "),
		["{partner_nicks}"] = getPassengersNickInCar(),
		["{meg_c_model}"] = getMarkerVehicleModel(),
		["{color_car}"] = getMarkerVehicleColor()
	}

	lua_thread.create(function ()
		slot0 = tonumber(cfg.config.delay28)
		slot4 = uv2.txt28o1
		text = uv0:decode(uv1.string(slot4))

		for slot4 in text:gmatch("[^\r\n]+") do
			if slot4 == "{F8}" then
				setVirtualKeyDown(119, true)
				wait(50)
				setVirtualKeyDown(119, false)
			elseif slot4 == "{wait100}" then
				wait(100)
			elseif slot4 == "{wait500}" then
				wait(500)
			elseif slot4 == "{wait1000}" then
				wait(1000)
			elseif slot4 == "{sms}" then
				sampSetChatInputEnabled(true)
				sampSetChatInputText("/sms " .. cfg.config.sms .. " ")
			elseif slot4 == "{}" then
				setVirtualKeyDown(32, true)
				wait(50)
				setVirtualKeyDown(32, false)
			else
				sampSendChat(slot4:gsub("{.-}", uv3))
				wait(slot0)
			end
		end
	end)
end

bind29 = function(slot0)
	slot1 = {
		["{arg}"] = slot0,
		["{name}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub("_.+", ""),
		["{surname}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub(".+_", ""),
		["{id}"] = select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)),
		["{weapon}"] = uv0.get_name(getCurrentCharWeapon(PLAYER_PED)),
		["{city}"] = getCity(getCharCoordinates(PLAYER_PED)),
		["{zone}"] = calculateZone(getCharCoordinates(PLAYER_PED)),
		["{kvadrat}"] = kvadrat(),
		["{time1}"] = getCurrentDateTime(),
		["{time2}"] = getCurrentTime(),
		["{dd}"] = getCurrentDayOfMonth(),
		["{mm}"] = getCurrentMonth(),
		["{YY}"] = getCurrentYearFull(),
		["{yy}"] = getCurrentYear(),
		["{H}"] = getCurrentHour(),
		["{M}"] = getCurrentMinutes(),
		["{S}"] = getCurrentSecundes(),
		["{day}"] = getCurrentDayOfWeekString(),
		["{month}"] = getCurrentMonthString(),
		["{id_marker}"] = uv1,
		["{name_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub("_.+", "") or "Unknown",
		["{surname_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub(".+_", "") or "Unknown",
		["{partner_ids}"] = table.concat(getPassengersIdInCar(), ", "),
		["{partner_nicks}"] = getPassengersNickInCar(),
		["{meg_c_model}"] = getMarkerVehicleModel(),
		["{color_car}"] = getMarkerVehicleColor()
	}

	lua_thread.create(function ()
		slot0 = tonumber(cfg.config.dela29)
		slot4 = uv2.txt29o1
		text = uv0:decode(uv1.string(slot4))

		for slot4 in text:gmatch("[^\r\n]+") do
			if slot4 == "{F8}" then
				setVirtualKeyDown(119, true)
				wait(50)
				setVirtualKeyDown(119, false)
			elseif slot4 == "{wait100}" then
				wait(100)
			elseif slot4 == "{wait500}" then
				wait(500)
			elseif slot4 == "{wait1000}" then
				wait(1000)
			elseif slot4 == "{sms}" then
				sampSetChatInputEnabled(true)
				sampSetChatInputText("/sms " .. cfg.config.sms .. " ")
			elseif slot4 == "{}" then
				setVirtualKeyDown(32, true)
				wait(50)
				setVirtualKeyDown(32, false)
			else
				sampSendChat(slot4:gsub("{.-}", uv3))
				wait(slot0)
			end
		end
	end)
end

bind30 = function(slot0)
	slot1 = {
		["{arg}"] = slot0,
		["{name}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub("_.+", ""),
		["{surname}"] = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))):gsub(".+_", ""),
		["{id}"] = select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)),
		["{weapon}"] = uv0.get_name(getCurrentCharWeapon(PLAYER_PED)),
		["{city}"] = getCity(getCharCoordinates(PLAYER_PED)),
		["{zone}"] = calculateZone(getCharCoordinates(PLAYER_PED)),
		["{kvadrat}"] = kvadrat(),
		["{time1}"] = getCurrentDateTime(),
		["{time2}"] = getCurrentTime(),
		["{dd}"] = getCurrentDayOfMonth(),
		["{mm}"] = getCurrentMonth(),
		["{YY}"] = getCurrentYearFull(),
		["{yy}"] = getCurrentYear(),
		["{H}"] = getCurrentHour(),
		["{M}"] = getCurrentMinutes(),
		["{S}"] = getCurrentSecundes(),
		["{day}"] = getCurrentDayOfWeekString(),
		["{month}"] = getCurrentMonthString(),
		["{id_marker}"] = uv1,
		["{name_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub("_.+", "") or "Unknown",
		["{surname_marker}"] = sampIsPlayerConnected(uv1) and sampGetPlayerNickname(uv1):gsub(".+_", "") or "Unknown",
		["{partner_ids}"] = table.concat(getPassengersIdInCar(), ", "),
		["{partner_nicks}"] = getPassengersNickInCar(),
		["{meg_c_model}"] = getMarkerVehicleModel(),
		["{color_car}"] = getMarkerVehicleColor()
	}

	lua_thread.create(function ()
		slot0 = tonumber(cfg.config.delay30)
		slot4 = uv2.txt30o1
		text = uv0:decode(uv1.string(slot4))

		for slot4 in text:gmatch("[^\r\n]+") do
			if slot4 == "{F8}" then
				setVirtualKeyDown(119, true)
				wait(50)
				setVirtualKeyDown(119, false)
			elseif slot4 == "{wait100}" then
				wait(100)
			elseif slot4 == "{wait500}" then
				wait(500)
			elseif slot4 == "{wait1000}" then
				wait(1000)
			elseif slot4 == "{sms}" then
				sampSetChatInputEnabled(true)
				sampSetChatInputText("/sms " .. cfg.config.sms .. " ")
			elseif slot4 == "{}" then
				setVirtualKeyDown(32, true)
				wait(50)
				setVirtualKeyDown(32, false)
			else
				sampSendChat(slot4:gsub("{.-}", uv3))
				wait(slot0)
			end
		end
	end)
end

su = function(slot0)
	slot1 = uv0.load(nil, uv1)

	lua_thread.create(function ()
		sampProcessChatInput("/susp " .. uv0 .. "", main_color)
		wait(400)
		sampSendChat("/do В левом ухе гарнитура настроенная на волну " .. uv1.config.org .. ".")
		wait(800)
		sampSendChat("/me зажав кнопку на гарнитуре, сообщил диспетчеру данные нарушителя и объявил в розыск")
	end)
end

idd = function()
	lua_thread.create(function ()
		for slot3, slot4 in pairs(getAllChars()) do
			if math.random(1, 2) == 1 then
				tmsg = "{9999ff}(голосовой чат)"
			elseif slot5 == 2 then
				tmsg = " "
			end

			slot6, slot7 = sampGetPlayerIdByCharHandle(slot4)

			if slot6 and doesCharExist(slot4) then
				sampAddChatMessage("" .. sampGetPlayerNickname(slot7) .. " {66CC66}id " .. slot7 .. " " .. tmsg .. "", 16777215)
				wait(500)
			end
		end
	end)
end

ts1 = function()
	for slot3 = 1, #lvl1 do
		slot4, slot5, slot6 = msg:match("%[F] (.+) " .. lvl1[slot3] .. "%[(.+)]: (.+)")

		if slot4 and slot6 then
			msg = "{669acc}[F] " .. slot4 .. " {FFFFFF}" .. lvl1[slot3] .. "[" .. slot5 .. "]{669acc}: " .. slot6

			return {
				clr,
				msg
			}
		end

		slot7, slot8, slot9 = msg:match("%[R] (.+) " .. lvl1[slot3] .. "%[(.+)]: (.+)")

		if slot7 and slot9 then
			msg = "{34cc67}[R] " .. slot7 .. " {FFFFFF}" .. lvl1[slot3] .. "[" .. slot8 .. "]{34cc67}: " .. slot9

			return {
				clr,
				msg
			}
		end
	end
end
